leocafonso/svdtoheaders/demo/h/ra4m1_reg.h

/* SYSTEM - System Control */
#define SYSTEM_BASE                       0x4001e000
#define SYSTEM_VBTCR1_OFFSET              0x041f
#define SYSTEM_VBTCR1                     (SYSTEM_BASE + SYSTEM_VBTCR1_OFFSET)
#define SYSTEM_VBTCR1_BPWSWSTP            (1 <<  0) /* 01: Battery Power supply Switch Stop */
#define SYSTEM_VBTCR2_OFFSET              0x04b0
#define SYSTEM_VBTCR2                     (SYSTEM_BASE + SYSTEM_VBTCR2_OFFSET)
#define SYSTEM_VBTCR2_VBTLVDLVL           (2 <<  6) /* 40: VBATT Pin Voltage Low Voltage Detect Level Select Bit */
#define SYSTEM_VBTCR2_VBTLVDLVL_MASK           (0x03)
#define SYSTEM_VBTCR2_VBTLVDEN            (1 <<  4) /* 10: VBATT Pin Low Voltage Detect Enable Bit */
#define SYSTEM_VBTSR_OFFSET               0x04b1
#define SYSTEM_VBTSR                      (SYSTEM_BASE + SYSTEM_VBTSR_OFFSET)
#define SYSTEM_VBTSR_VBTRVLD              (1 <<  4) /* 10: VBATT_R Valid */
#define SYSTEM_VBTSR_VBTBLDF              (1 <<  1) /* 02: VBATT Battery Low voltage Detect Flag */
#define SYSTEM_VBTSR_VBTRDF               (1 <<  0) /* 01: VBAT_R Reset Detect Flag */
#define SYSTEM_VBTCMPCR_OFFSET            0x04b2
#define SYSTEM_VBTCMPCR                   (SYSTEM_BASE + SYSTEM_VBTCMPCR_OFFSET)
#define SYSTEM_VBTCMPCR_VBTCMPE           (1 <<  0) /* 01: VBATT pin low voltage detect circuit output enable */
#define SYSTEM_VBTLVDICR_OFFSET           0x04b4
#define SYSTEM_VBTLVDICR                  (SYSTEM_BASE + SYSTEM_VBTLVDICR_OFFSET)
#define SYSTEM_VBTLVDICR_VBTLVDISEL       (1 <<  1) /* 02: Pin Low Voltage Detect Interrupt Select bit */
#define SYSTEM_VBTLVDICR_VBTLVDIE         (1 <<  0) /* 01: VBATT Pin Low Voltage Detect Interrupt Enable bit */
#define SYSTEM_VBTWCTLR_OFFSET            0x04b6
#define SYSTEM_VBTWCTLR                   (SYSTEM_BASE + SYSTEM_VBTWCTLR_OFFSET)
#define SYSTEM_VBTWCTLR_VWEN              (1 <<  0) /* 01: VBATT wakeup enable */
#define SYSTEM_VBTWCH0OTSR_OFFSET         0x04b8
#define SYSTEM_VBTWCH0OTSR                (SYSTEM_BASE + SYSTEM_VBTWCH0OTSR_OFFSET)
#define SYSTEM_VBTWCH0OTSR_CH0VRTCATE     (1 <<  4) /* 10: VBATWIO0 Output RTC Alarm Signal Enable */
#define SYSTEM_VBTWCH0OTSR_CH0VRTCTE      (1 <<  3) /* 08: VBATWIO0 Output RTC Periodic Signal Enable */
#define SYSTEM_VBTWCH0OTSR_CH0VCH2TE      (1 <<  2) /* 04: VBATWIO0 Output VBATWIO2 Trigger Enable */
#define SYSTEM_VBTWCH0OTSR_CH0VCH1TE      (1 <<  1) /* 02: VBATWIO0 Output VBATWIO1 Trigger Enable */
#define SYSTEM_VBTWCH1OTSR_OFFSET         0x04b9
#define SYSTEM_VBTWCH1OTSR                (SYSTEM_BASE + SYSTEM_VBTWCH1OTSR_OFFSET)
#define SYSTEM_VBTWCH1OTSR_CH1VRTCATE     (1 <<  4) /* 10: VBATWIO1 Output RTC Alarm Signal Enable */
#define SYSTEM_VBTWCH1OTSR_CH1VRTCTE      (1 <<  3) /* 08: VBATWIO1 Output RTC Periodic Signal Enable */
#define SYSTEM_VBTWCH1OTSR_CH1VCH2TE      (1 <<  2) /* 04: VBATWIO1 Output VBATWIO2 Trigger Enable */
#define SYSTEM_VBTWCH1OTSR_CH1VCH0TE      (1 <<  0) /* 01: VBATWIO1 Output VBATWIO0 Trigger Enable */
#define SYSTEM_VBTWCH2OTSR_OFFSET         0x04ba
#define SYSTEM_VBTWCH2OTSR                (SYSTEM_BASE + SYSTEM_VBTWCH2OTSR_OFFSET)
#define SYSTEM_VBTWCH2OTSR_CH2VRTCATE     (1 <<  4) /* 10: VBATWIO2 Output RTC Alarm Signal Enable */
#define SYSTEM_VBTWCH2OTSR_CH2VRTCTE      (1 <<  3) /* 08: VBATWIO2 Output RTC Periodic Signal Enable */
#define SYSTEM_VBTWCH2OTSR_CH2VCH1TE      (1 <<  1) /* 02: VBATWIO2 Output VBATWIO1 Trigger Enable */
#define SYSTEM_VBTWCH2OTSR_CH2VCH0TE      (1 <<  0) /* 01: VBATWIO2 Output VBATWIO0 Trigger Enable */
#define SYSTEM_VBTICTLR_OFFSET            0x04bb
#define SYSTEM_VBTICTLR                   (SYSTEM_BASE + SYSTEM_VBTICTLR_OFFSET)
#define SYSTEM_VBTICTLR_VCH2INEN          (1 <<  2) /* 04: VBATT Wakeup I/O 2 Input Enable */
#define SYSTEM_VBTICTLR_VCH1INEN          (1 <<  1) /* 02: VBATT Wakeup I/O 1 Input Enable */
#define SYSTEM_VBTICTLR_VCH0INEN          (1 <<  0) /* 01: VBATT Wakeup I/O 0 Input Enable */
#define SYSTEM_VBTOCTLR_OFFSET            0x04bc
#define SYSTEM_VBTOCTLR                   (SYSTEM_BASE + SYSTEM_VBTOCTLR_OFFSET)
#define SYSTEM_VBTOCTLR_VOUT2LSEL         (1 <<  5) /* 20: VBATT Wakeup I/O 2 Output Level Selection */
#define SYSTEM_VBTOCTLR_VOUT1LSEL         (1 <<  4) /* 10: VBATT Wakeup I/O 1 Output Level Selection */
#define SYSTEM_VBTOCTLR_VOUT0LSEL         (1 <<  3) /* 08: VBATT Wakeup I/O 0 Output Level Selection */
#define SYSTEM_VBTOCTLR_VCH2OEN           (1 <<  2) /* 04: VBATT Wakeup I/O 2 Output Enable */
#define SYSTEM_VBTOCTLR_VCH1OEN           (1 <<  1) /* 02: VBATT Wakeup I/O 1 Output Enable */
#define SYSTEM_VBTOCTLR_VCH0OEN           (1 <<  0) /* 01: VBATT Wakeup I/O 0 Output Enable */
#define SYSTEM_VBTWTER_OFFSET             0x04bd
#define SYSTEM_VBTWTER                    (SYSTEM_BASE + SYSTEM_VBTWTER_OFFSET)
#define SYSTEM_VBTWTER_VRTCAE             (1 <<  4) /* 10: RTC Alarm Signal Enable */
#define SYSTEM_VBTWTER_VRTCIE             (1 <<  3) /* 08: RTC Periodic Signal Enable */
#define SYSTEM_VBTWTER_VCH2E              (1 <<  2) /* 04: VBATWIO2 Pin Enable */
#define SYSTEM_VBTWTER_VCH1E              (1 <<  1) /* 02: VBATWIO1 Pin Enable */
#define SYSTEM_VBTWTER_VCH0E              (1 <<  0) /* 01: VBATWIO0 Pin Enable */
#define SYSTEM_VBTWEGR_OFFSET             0x04be
#define SYSTEM_VBTWEGR                    (SYSTEM_BASE + SYSTEM_VBTWEGR_OFFSET)
#define SYSTEM_VBTWEGR_VCH2EG             (1 <<  2) /* 04: VBATWIO2 Wakeup Trigger Source Edge Select */
#define SYSTEM_VBTWEGR_VCH1EG             (1 <<  1) /* 02: VBATWIO1 Wakeup Trigger Source Edge Select */
#define SYSTEM_VBTWEGR_VCH0EG             (1 <<  0) /* 01: VBATWIO0 Wakeup Trigger Source Edge Select */
#define SYSTEM_VBTWFR_OFFSET              0x04bf
#define SYSTEM_VBTWFR                     (SYSTEM_BASE + SYSTEM_VBTWFR_OFFSET)
#define SYSTEM_VBTWFR_VRTCAF              (1 <<  4) /* 10: VBATT RTC-Alarm Wakeup Trigger Flag */
#define SYSTEM_VBTWFR_VRTCIF              (1 <<  3) /* 08: VBATT RTC-Interval Wakeup Trigger Flag */
#define SYSTEM_VBTWFR_VCH2F               (1 <<  2) /* 04: VBATWIO2 Wakeup Trigger Flag */
#define SYSTEM_VBTWFR_VCH1F               (1 <<  1) /* 02: VBATWIO1 Wakeup Trigger Flag */
#define SYSTEM_VBTWFR_VCH0F               (1 <<  0) /* 01: VBATWIO0 Wakeup Trigger Flag */
#define SYSTEM_VBTBKR_SIZE                512
#define SYSTEM_VBTBKR_OFFSET              0x0500
#define SYSTEM_VBTBKR(p)                  (SYSTEM_BASE + SYSTEM_VBTBKR_OFFSET + (p)*0x0001)
#define SYSTEM_VBTBKR_VBTBKR              (8 <<  0) /* 01: VBTBKR is a 512-byte readable/writable register to store data powered by VBATT. The value of this register is retained even when VCC is not powered but VBATT is powered. VBTBKR is initialized by VBATT selected voltage power-on-reset. */
#define SYSTEM_VBTBKR_VBTBKR_MASK              (0xff)
#define SYSTEM_SCKDIVCR_OFFSET            0x0020
#define SYSTEM_SCKDIVCR                   (SYSTEM_BASE + SYSTEM_SCKDIVCR_OFFSET)
#define SYSTEM_SCKDIVCR_FCK               (3 << 28) /* 10000000: Flash IF Clock (FCLK) Select */
#define SYSTEM_SCKDIVCR_FCK_MASK               (0x07)
#define SYSTEM_SCKDIVCR_ICK               (3 << 24) /* 1000000: System Clock (ICLK) Select */
#define SYSTEM_SCKDIVCR_ICK_MASK               (0x07)
#define SYSTEM_SCKDIVCR_PCKA              (3 << 12) /* 1000: Peripheral Module Clock A (PCLKA) Select */
#define SYSTEM_SCKDIVCR_PCKA_MASK              (0x07)
#define SYSTEM_SCKDIVCR_PCKB              (3 <<  8) /* 100: Peripheral Module Clock B (PCLKB) Select */
#define SYSTEM_SCKDIVCR_PCKB_MASK              (0x07)
#define SYSTEM_SCKDIVCR_PCKC              (3 <<  4) /* 10: Peripheral Module Clock C (PCLKC) Select */
#define SYSTEM_SCKDIVCR_PCKC_MASK              (0x07)
#define SYSTEM_SCKDIVCR_PCKD              (3 <<  0) /* 01: Peripheral Module Clock D (PCLKD) Select */
#define SYSTEM_SCKDIVCR_PCKD_MASK              (0x07)
#define SYSTEM_SCKSCR_OFFSET              0x0026
#define SYSTEM_SCKSCR                     (SYSTEM_BASE + SYSTEM_SCKSCR_OFFSET)
#define SYSTEM_SCKSCR_CKSEL               (3 <<  0) /* 01: Clock Source Select Selecting the system clock source faster than 32MHz(system clock source > 32MHz ) is prohibit when SCKDIVCR.ICK[2:0] bits select the division-by-1 and MEMWAIT.MEMWAIT =0. */
#define SYSTEM_SCKSCR_CKSEL_MASK               (0x07)
#define SYSTEM_PLLCR_OFFSET               0x002a
#define SYSTEM_PLLCR                      (SYSTEM_BASE + SYSTEM_PLLCR_OFFSET)
#define SYSTEM_PLLCR_PLLSTP               (1 <<  0) /* 01: PLL Stop Control */
#define SYSTEM_PLLCCR2_OFFSET             0x002b
#define SYSTEM_PLLCCR2                    (SYSTEM_BASE + SYSTEM_PLLCCR2_OFFSET)
#define SYSTEM_PLLCCR2_PLODIV             (2 <<  6) /* 40: PLL Output Frequency Division Ratio Select */
#define SYSTEM_PLLCCR2_PLODIV_MASK             (0x03)
#define SYSTEM_PLLCCR2_PLLMUL             (5 <<  0) /* 01: PLL Frequency Multiplication Factor Select */
#define SYSTEM_PLLCCR2_PLLMUL_MASK             (0x1f)
#define SYSTEM_MEMWAIT_OFFSET             0x0031
#define SYSTEM_MEMWAIT                    (SYSTEM_BASE + SYSTEM_MEMWAIT_OFFSET)
#define SYSTEM_MEMWAIT_MEMWAIT            (1 <<  0) /* 01: Memory Wait Cycle Select Note: Writing 0 to the MEMWAIT is prohibited when SCKDIVCR.ICK selects division by 1 and SCKSCR.CKSEL[2:0] bits select the system clock source that is faster than 32 MHz (ICLK > 32 MHz). */
#define SYSTEM_MOSCCR_OFFSET              0x0032
#define SYSTEM_MOSCCR                     (SYSTEM_BASE + SYSTEM_MOSCCR_OFFSET)
#define SYSTEM_MOSCCR_MOSTP               (1 <<  0) /* 01: Main Clock Oscillator Stop Note: MOMCR register must be set before setting MOSTP to 0. */
#define SYSTEM_HOCOCR_OFFSET              0x0036
#define SYSTEM_HOCOCR                     (SYSTEM_BASE + SYSTEM_HOCOCR_OFFSET)
#define SYSTEM_HOCOCR_HCSTP               (1 <<  0) /* 01: HOCO Stop */
#define SYSTEM_MOCOCR_OFFSET              0x0038
#define SYSTEM_MOCOCR                     (SYSTEM_BASE + SYSTEM_MOCOCR_OFFSET)
#define SYSTEM_MOCOCR_MCSTP               (1 <<  0) /* 01: MOCO Stop */
#define SYSTEM_OSCSF_OFFSET               0x003c
#define SYSTEM_OSCSF                      (SYSTEM_BASE + SYSTEM_OSCSF_OFFSET)
#define SYSTEM_OSCSF_PLLSF                (1 <<  5) /* 20: PLL Clock Oscillation Stabilization Flag */
#define SYSTEM_OSCSF_MOSCSF               (1 <<  3) /* 08: Main Clock Oscillation Stabilization Flag */
#define SYSTEM_OSCSF_HOCOSF               (1 <<  0) /* 01: HOCO Clock Oscillation Stabilization Flag NOTE: The HOCOSF bit value after a reset is 1 when the OFS1.HOCOEN bit is 0. It is 0 when the OFS1.HOCOEN bit is 1. */
#define SYSTEM_CKOCR_OFFSET               0x003e
#define SYSTEM_CKOCR                      (SYSTEM_BASE + SYSTEM_CKOCR_OFFSET)
#define SYSTEM_CKOCR_CKOEN                (1 <<  7) /* 80: Clock out enable */
#define SYSTEM_CKOCR_CKODIV               (3 <<  4) /* 10: Clock out input frequency Division Select */
#define SYSTEM_CKOCR_CKODIV_MASK               (0x07)
#define SYSTEM_CKOCR_CKOSEL               (3 <<  0) /* 01: Clock out source select */
#define SYSTEM_CKOCR_CKOSEL_MASK               (0x07)
#define SYSTEM_TRCKCR_OFFSET              0x003f
#define SYSTEM_TRCKCR                     (SYSTEM_BASE + SYSTEM_TRCKCR_OFFSET)
#define SYSTEM_TRCKCR_TRCKEN              (1 <<  7) /* 80: Trace Clock operating enable */
#define SYSTEM_TRCKCR_TRCK                (4 <<  0) /* 01: Trace Clock operating frequency select */
#define SYSTEM_TRCKCR_TRCK_MASK                (0x0f)
#define SYSTEM_OSTDCR_OFFSET              0x0040
#define SYSTEM_OSTDCR                     (SYSTEM_BASE + SYSTEM_OSTDCR_OFFSET)
#define SYSTEM_OSTDCR_OSTDE               (1 <<  7) /* 80: Oscillation Stop Detection Function Enable */
#define SYSTEM_OSTDCR_OSTDIE              (1 <<  0) /* 01: Oscillation Stop Detection Interrupt Enable */
#define SYSTEM_OSTDSR_OFFSET              0x0041
#define SYSTEM_OSTDSR                     (SYSTEM_BASE + SYSTEM_OSTDSR_OFFSET)
#define SYSTEM_OSTDSR_OSTDF               (1 <<  0) /* 01: Oscillation Stop Detection Flag */
#define SYSTEM_SLCDSCKCR_OFFSET           0x0050
#define SYSTEM_SLCDSCKCR                  (SYSTEM_BASE + SYSTEM_SLCDSCKCR_OFFSET)
#define SYSTEM_SLCDSCKCR_LCDSCKEN         (1 <<  7) /* 80: LCD Source Clock Out Enable */
#define SYSTEM_SLCDSCKCR_LCDSCKSEL        (3 <<  0) /* 01: LCD Source Clock (LCDSRCCLK) Select */
#define SYSTEM_SLCDSCKCR_LCDSCKSEL_MASK        (0x07)
#define SYSTEM_MOCOUTCR_OFFSET            0x0061
#define SYSTEM_MOCOUTCR                   (SYSTEM_BASE + SYSTEM_MOCOUTCR_OFFSET)
#define SYSTEM_MOCOUTCR_MOCOUTRM          (8 <<  0) /* 01: MOCO User Trimming 1000_0000 : -128 1000_0001 : -127 1000_0010 : -126 . . . 1111_1111 : -1 0000_0000 : Center Code 0000_0001 : +1 . . . 0111_1101 : +125 0111_1110 : +126 0111_1111 : +127 These bits are added to original MOCO trimming bits */
#define SYSTEM_MOCOUTCR_MOCOUTRM_MASK          (0xff)
#define SYSTEM_HOCOUTCR_OFFSET            0x0062
#define SYSTEM_HOCOUTCR                   (SYSTEM_BASE + SYSTEM_HOCOUTCR_OFFSET)
#define SYSTEM_HOCOUTCR_HOCOUTRM          (8 <<  0) /* 01: HOCO User Trimming 1000_0000 : -128 1000_0001 : -127 1000_0010 : -126 . . . 1111_1111 : -1 0000_0000 : Center Code 0000_0001 : +1 . . . 0111_1101 : +125 0111_1110 : +126 0111_1111 : +127 These bits are added to original HOCO trimming bits */
#define SYSTEM_HOCOUTCR_HOCOUTRM_MASK          (0xff)
#define SYSTEM_MOSCWTCR_OFFSET            0x00a2
#define SYSTEM_MOSCWTCR                   (SYSTEM_BASE + SYSTEM_MOSCWTCR_OFFSET)
#define SYSTEM_MOSCWTCR_MSTS              (4 <<  0) /* 01: Main clock oscillator wait time setting */
#define SYSTEM_MOSCWTCR_MSTS_MASK              (0x0f)
#define SYSTEM_HOCOWTCR_OFFSET            0x00a5
#define SYSTEM_HOCOWTCR                   (SYSTEM_BASE + SYSTEM_HOCOWTCR_OFFSET)
#define SYSTEM_HOCOWTCR_HSTS              (3 <<  0) /* 01: HOCO wait time setting */
#define SYSTEM_HOCOWTCR_HSTS_MASK              (0x07)
#define SYSTEM_USBCKCR_OFFSET             0x00d0
#define SYSTEM_USBCKCR                    (SYSTEM_BASE + SYSTEM_USBCKCR_OFFSET)
#define SYSTEM_USBCKCR_USBCLKSEL          (1 <<  0) /* 01: USB Clock Source Select */
#define SYSTEM_MOMCR_OFFSET               0x0413
#define SYSTEM_MOMCR                      (SYSTEM_BASE + SYSTEM_MOMCR_OFFSET)
#define SYSTEM_MOMCR_MOSEL                (1 <<  6) /* 40: Main Clock Oscillator Switching */
#define SYSTEM_MOMCR_MODRV1               (1 <<  3) /* 08: Main Clock Oscillator Drive Capability 1 Switching */
#define SYSTEM_SOSCCR_OFFSET              0x0480
#define SYSTEM_SOSCCR                     (SYSTEM_BASE + SYSTEM_SOSCCR_OFFSET)
#define SYSTEM_SOSCCR_SOSTP               (1 <<  0) /* 01: Sub-Clock Oscillator Stop */
#define SYSTEM_SOMCR_OFFSET               0x0481
#define SYSTEM_SOMCR                      (SYSTEM_BASE + SYSTEM_SOMCR_OFFSET)
#define SYSTEM_SOMCR_SODRV                (2 <<  0) /* 01: Sub-Clock Oscillator Drive Capability Switching */
#define SYSTEM_SOMCR_SODRV_MASK                (0x03)
#define SYSTEM_LOCOCR_OFFSET              0x0490
#define SYSTEM_LOCOCR                     (SYSTEM_BASE + SYSTEM_LOCOCR_OFFSET)
#define SYSTEM_LOCOCR_LCSTP               (1 <<  0) /* 01: LOCO Stop */
#define SYSTEM_LOCOUTCR_OFFSET            0x0492
#define SYSTEM_LOCOUTCR                   (SYSTEM_BASE + SYSTEM_LOCOUTCR_OFFSET)
#define SYSTEM_LOCOUTCR_LOCOUTRM          (8 <<  0) /* 01: LOCO User Trimming 1000_0000 : -128 1000_0001 : -127 1000_0010 : -126 . . . 1111_1111 : -1 0000_0000 : Center Code 0000_0001 : +1 . . . 0111_1101 : +125 0111_1110 : +126 0111_1111 : +127 These bits are added to original LOCO trimming bits */
#define SYSTEM_LOCOUTCR_LOCOUTRM_MASK          (0xff)
#define SYSTEM_SBYCR_OFFSET               0x000c
#define SYSTEM_SBYCR                      (SYSTEM_BASE + SYSTEM_SBYCR_OFFSET)
#define SYSTEM_SBYCR_SSBY                 (1 << 15) /* 8000: Software Standby */
#define SYSTEM_MSTPCRA_OFFSET             0x001c
#define SYSTEM_MSTPCRA                    (SYSTEM_BASE + SYSTEM_MSTPCRA_OFFSET)
#define SYSTEM_MSTPCRA_MSTPA22            (1 << 22) /* 400000: DMA Controller/Data Transfer Controller Module Stop */
#define SYSTEM_MSTPCRA_MSTPA6             (1 <<  6) /* 40: ECCRAM Module Stop */
#define SYSTEM_MSTPCRA_MSTPA0             (1 <<  0) /* 01: RAM0 Module Stop */
#define SYSTEM_SNZCR_OFFSET               0x0092
#define SYSTEM_SNZCR                      (SYSTEM_BASE + SYSTEM_SNZCR_OFFSET)
#define SYSTEM_SNZCR_SNZE                 (1 <<  7) /* 80: Snooze Mode Enable */
#define SYSTEM_SNZCR_SNZDTCEN             (1 <<  1) /* 02: DTC Enable in Snooze Mode */
#define SYSTEM_SNZCR_RXDREQEN             (1 <<  0) /* 01: RXD0 Snooze Request Enable NOTE: Do not set to 1 other than in asynchronous mode. */
#define SYSTEM_SNZEDCR_OFFSET             0x0094
#define SYSTEM_SNZEDCR                    (SYSTEM_BASE + SYSTEM_SNZEDCR_OFFSET)
#define SYSTEM_SNZEDCR_SCI0UMTED          (1 <<  7) /* 80: SCI0 Address Mismatch Snooze End Enable */
#define SYSTEM_SNZEDCR_AD0UMTED           (1 <<  4) /* 10: ADC140 Compare Mismatch Snooze End Enable */
#define SYSTEM_SNZEDCR_AD0MATED           (1 <<  3) /* 08: ADC140 Compare Match Snooze End Enable */
#define SYSTEM_SNZEDCR_DTCNZRED           (1 <<  2) /* 04: Not Last DTC Transmission Completion Snooze End Enable */
#define SYSTEM_SNZEDCR_DTCZRED            (1 <<  1) /* 02: Last DTC Transmission Completion Snooze End Enable */
#define SYSTEM_SNZEDCR_AGTUNFED           (1 <<  0) /* 01: AGT1 Underflow Snooze End Enable */
#define SYSTEM_SNZREQCR_OFFSET            0x0098
#define SYSTEM_SNZREQCR                   (SYSTEM_BASE + SYSTEM_SNZREQCR_OFFSET)
#define SYSTEM_SNZREQCR_SNZREQEN30        (1 << 30) /* 40000000: Snooze Request Enable 30 Enable AGT1 compare match B snooze request */
#define SYSTEM_SNZREQCR_SNZREQEN29        (1 << 29) /* 20000000: Snooze Request Enable 29 Enable AGT1 compare match A snooze request */
#define SYSTEM_SNZREQCR_SNZREQEN28        (1 << 28) /* 10000000: Snooze Request Enable 28 Enable AGT1 underflow snooze request */
#define SYSTEM_SNZREQCR_SNZREQEN25        (1 << 25) /* 2000000: Snooze Request Enable 25 Enable RTC period snooze request */
#define SYSTEM_SNZREQCR_SNZREQEN24        (1 << 24) /* 1000000: Snooze Request Enable 24 Enable RTC alarm snooze request */
#define SYSTEM_SNZREQCR_SNZREQEN23        (1 << 23) /* 800000: Snooze Request Enable 23 Enable RTC alarm snooze request */
#define SYSTEM_SNZREQCR_SNZREQEN17        (1 << 17) /* 20000: Snooze Request Enable 17 Enable KINT snooze request */
#define SYSTEM_SNZREQCR_SNZREQEN15        (1 << 15) /* 8000: Snooze Request Enable 15 Enable IRQ15 pin snooze request */
#define SYSTEM_SNZREQCR_SNZREQEN14        (1 << 14) /* 4000: Snooze Request Enable 14 Enable IRQ14 pin snooze request */
#define SYSTEM_SNZREQCR_SNZREQEN12        (1 << 12) /* 1000: Snooze Request Enable 12 Enable IRQ12 pin snooze request */
#define SYSTEM_SNZREQCR_SNZREQEN11        (1 << 11) /* 800: Snooze Request Enable 11 Enable IRQ11 pin snooze request */
#define SYSTEM_SNZREQCR_SNZREQEN10        (1 << 10) /* 400: Snooze Request Enable 10 Enable IRQ10 pin snooze request */
#define SYSTEM_SNZREQCR_SNZREQEN9         (1 <<  9) /* 200: Snooze Request Enable 9 Enable IRQ9 pin snooze request */
#define SYSTEM_SNZREQCR_SNZREQEN8         (1 <<  8) /* 100: Snooze Request Enable 8 Enable IRQ8 pin snooze request */
#define SYSTEM_SNZREQCR_SNZREQEN7         (1 <<  7) /* 80: Snooze Request Enable 7 Enable IRQ7 pin snooze request */
#define SYSTEM_SNZREQCR_SNZREQEN6         (1 <<  6) /* 40: Snooze Request Enable 6 Enable IRQ6 pin snooze request */
#define SYSTEM_SNZREQCR_SNZREQEN5         (1 <<  5) /* 20: Snooze Request Enable 5 Enable IRQ5 pin snooze request */
#define SYSTEM_SNZREQCR_SNZREQEN4         (1 <<  4) /* 10: Snooze Request Enable 4 Enable IRQ4 pin snooze request */
#define SYSTEM_SNZREQCR_SNZREQEN3         (1 <<  3) /* 08: Snooze Request Enable 3 Enable IRQ3 pin snooze request */
#define SYSTEM_SNZREQCR_SNZREQEN2         (1 <<  2) /* 04: Snooze Request Enable 2 Enable IRQ2 pin snooze request */
#define SYSTEM_SNZREQCR_SNZREQEN1         (1 <<  1) /* 02: Snooze Request Enable 1 Enable IRQ1 pin snooze request */
#define SYSTEM_SNZREQCR_SNZREQEN0         (1 <<  0) /* 01: Snooze Request Enable 0 Enable IRQ0 pin snooze request */
#define SYSTEM_FLSTOP_OFFSET              0x009e
#define SYSTEM_FLSTOP                     (SYSTEM_BASE + SYSTEM_FLSTOP_OFFSET)
#define SYSTEM_FLSTOP_FLSTPF              (1 <<  4) /* 10: Flash Memory Operation Status Flag */
#define SYSTEM_FLSTOP_FLSTOP              (1 <<  0) /* 01: Selecting ON/OFF of the Flash Memory Operation */
#define SYSTEM_OPCCR_OFFSET               0x00a0
#define SYSTEM_OPCCR                      (SYSTEM_BASE + SYSTEM_OPCCR_OFFSET)
#define SYSTEM_OPCCR_OPCMTSF              (1 <<  4) /* 10: Operating Power Control Mode Transition Status Flag */
#define SYSTEM_OPCCR_OPCM                 (2 <<  0) /* 01: Operating Power Control Mode Select */
#define SYSTEM_OPCCR_OPCM_MASK                 (0x03)
#define SYSTEM_SOPCCR_OFFSET              0x00aa
#define SYSTEM_SOPCCR                     (SYSTEM_BASE + SYSTEM_SOPCCR_OFFSET)
#define SYSTEM_SOPCCR_SOPCMTSF            (1 <<  4) /* 10: Sub Operating Power Control Mode Transition Status Flag */
#define SYSTEM_SOPCCR_SOPCM               (1 <<  0) /* 01: Sub Operating Power Control Mode Select */
#define SYSTEM_SYOCDCR_OFFSET             0x040e
#define SYSTEM_SYOCDCR                    (SYSTEM_BASE + SYSTEM_SYOCDCR_OFFSET)
#define SYSTEM_SYOCDCR_DBGEN              (1 <<  7) /* 80: Debugger Enable bit */
#define SYSTEM_LVCMPCR_OFFSET             0x0417
#define SYSTEM_LVCMPCR                    (SYSTEM_BASE + SYSTEM_LVCMPCR_OFFSET)
#define SYSTEM_LVCMPCR_LVD2E              (1 <<  6) /* 40: Voltage Detection 2 Enable */
#define SYSTEM_LVCMPCR_LVD1E              (1 <<  5) /* 20: Voltage Detection 1 Enable */
#define SYSTEM_LVDLVLR_OFFSET             0x0418
#define SYSTEM_LVDLVLR                    (SYSTEM_BASE + SYSTEM_LVDLVLR_OFFSET)
#define SYSTEM_LVDLVLR_LVD2LVL            (3 <<  5) /* 20: Voltage Detection 2 Level Select (Standard voltage during drop in voltage) */
#define SYSTEM_LVDLVLR_LVD2LVL_MASK            (0x07)
#define SYSTEM_LVDLVLR_LVD1LVL            (5 <<  0) /* 01: Voltage Detection 1 Level Select (Standard voltage during drop in voltage) */
#define SYSTEM_LVDLVLR_LVD1LVL_MASK            (0x1f)
#define SYSTEM_LVDCR0_SIZE                2
#define SYSTEM_LVDCR0_OFFSET              0x041a
#define SYSTEM_LVDCR0(p)                  (SYSTEM_BASE + SYSTEM_LVDCR0_OFFSET + (p)*0x0001)
#define SYSTEM_LVDCR0_RN                  (1 <<  7) /* 80: Voltage Monitor Reset Negate Select */
#define SYSTEM_LVDCR0_RI                  (1 <<  6) /* 40: Voltage Monitor Circuit Mode Select */
#define SYSTEM_LVDCR0_CMPE                (1 <<  2) /* 04: Voltage Monitor Circuit Comparison Result Output Enable */
#define SYSTEM_LVDCR0_RIE                 (1 <<  0) /* 01: Voltage Monitor Interrupt/Reset Enable */
#define SYSTEM_LVDCR1_SIZE                2
#define SYSTEM_LVDCR1_OFFSET              0x00e0
#define SYSTEM_LVDCR1(p)                  (SYSTEM_BASE + SYSTEM_LVDCR1_OFFSET + (p)*0x0002)
#define SYSTEM_LVDCR1_IRQSEL              (1 <<  2) /* 04: Voltage Monitor Interrupt Type Select */
#define SYSTEM_LVDCR1_IDTSEL              (2 <<  0) /* 01: Voltage Monitor Interrupt Generation Condition Select */
#define SYSTEM_LVDCR1_IDTSEL_MASK              (0x03)
#define SYSTEM_LVDSR_SIZE                 2
#define SYSTEM_LVDSR_OFFSET               0x00e1
#define SYSTEM_LVDSR(p)                   (SYSTEM_BASE + SYSTEM_LVDSR_OFFSET + (p)*0x0002)
#define SYSTEM_LVDSR_MON                  (1 <<  1) /* 02: Voltage Monitor 1 Signal Monitor Flag */
#define SYSTEM_LVDSR_DET                  (1 <<  0) /* 01: Voltage Monitor Voltage Change Detection Flag NOTE: Only 0 can be written to this bit. After writing 0 to this bit, it takes 2 system clock cycles for the bit to be read as 0. */
