leocafonso/svdtoheaders/demo/h/ra4m1_reg.h
#define SYSTEM_PRCR_OFFSET                0x03fe
#define SYSTEM_PRCR                       (SYSTEM_BASE + SYSTEM_PRCR_OFFSET)
#define SYSTEM_PRCR_PRKEY                 (8 <<  8) /* 100: PRC Key Code */
#define SYSTEM_PRCR_PRKEY_MASK                 (0xff)
#define SYSTEM_PRCR_PRC3                  (1 <<  3) /* 08: Protect Bit 3 */
#define SYSTEM_PRCR_PRC1                  (1 <<  1) /* 02: Protect Bit 1 */
#define SYSTEM_PRCR_PRC0                  (1 <<  0) /* 01: Protect Bit 0 */
#define SYSTEM_RSTSR0_OFFSET              0x0410
#define SYSTEM_RSTSR0                     (SYSTEM_BASE + SYSTEM_RSTSR0_OFFSET)
#define SYSTEM_RSTSR0_LVD2RF              (1 <<  3) /* 08: Voltage Monitor 2 Reset Detect Flag Note: Only 0 can be written to clear the flag. The reset flag must be written with 0 after the reset flag is read as 1. */
#define SYSTEM_RSTSR0_LVD1RF              (1 <<  2) /* 04: Voltage Monitor 1 Reset Detect Flag Note: Only 0 can be written to clear the flag. The reset flag must be written with 0 after the reset flag is read as 1. */
#define SYSTEM_RSTSR0_LVD0RF              (1 <<  1) /* 02: Voltage Monitor 0 Reset Detect Flag Note: Only 0 can be written to clear the flag. The reset flag must be written with 0 after the reset flag is read as 1. */
#define SYSTEM_RSTSR0_PORF                (1 <<  0) /* 01: Power-On Reset Detect Flag Note: Only 0 can be written to clear the flag. The reset flag must be written with 0 after the reset flag is read as 1. */
#define SYSTEM_RSTSR2_OFFSET              0x0411
#define SYSTEM_RSTSR2                     (SYSTEM_BASE + SYSTEM_RSTSR2_OFFSET)
#define SYSTEM_RSTSR2_CWSF                (1 <<  0) /* 01: Cold/Warm Start Determination Flag Note: Only 1 can be written to set the flag. */
#define SYSTEM_RSTSR1_OFFSET              0x00c0
#define SYSTEM_RSTSR1                     (SYSTEM_BASE + SYSTEM_RSTSR1_OFFSET)
#define SYSTEM_RSTSR1_SPERF               (1 << 12) /* 1000: SP Error Reset Detect Flag Note: Only 0 can be written to clear the flag. The reset flag must be written as 0 after the reset flag is read as 1. */
#define SYSTEM_RSTSR1_BUSMRF              (1 << 11) /* 800: Bus Master MPU Reset Detect Flag Note: Only 0 can be written to clear the flag. The reset flag must be written as 0 after the reset flag is read as 1. */
#define SYSTEM_RSTSR1_BUSSRF              (1 << 10) /* 400: Bus Slave MPU Reset Detect Flag Note: Only 0 can be written to clear the flag. The reset flag must be written as 0 after the reset flag is read as 1. */
#define SYSTEM_RSTSR1_REERF               (1 <<  9) /* 200: RAM ECC Error Reset Detect Flag Note: Only 0 can be written to clear the flag. The reset flag must be written as 0 after the reset flag is read as 1. */
#define SYSTEM_RSTSR1_RPERF               (1 <<  8) /* 100: RAM Parity Error Reset Detect Flag Note: Only 0 can be written to clear the flag. The reset flag must be written as 0 after the reset flag is read as 1. */
#define SYSTEM_RSTSR1_SWRF                (1 <<  2) /* 04: Software Reset Detect Flag Note: Only 0 can be written to clear the flag. The reset flag must be written as 0 after the reset flag is read as 1. */
#define SYSTEM_RSTSR1_WDTRF               (1 <<  1) /* 02: Watchdog Timer Reset Detect Flag Note: Only 0 can be written to clear the flag. The reset flag must be written as 0 after the reset flag is read as 1. */
#define SYSTEM_RSTSR1_IWDTRF              (1 <<  0) /* 01: Independent Watchdog Timer Reset Detect Flag Note: Only 0 can be written to clear the flag. The reset flag must be written as 0 after the reset flag is read as 1. */
#define SYSTEM_BKRACR_OFFSET              0x00c6
#define SYSTEM_BKRACR                     (SYSTEM_BASE + SYSTEM_BKRACR_OFFSET)
#define SYSTEM_BKRACR_BKRACS              (3 <<  0) /* 01: Backup Register Access Control Register */
#define SYSTEM_BKRACR_BKRACS_MASK              (0x07)

/* BUS - BUS Control */
#define BUS_BASE                          0x40003000
#define BUS_BUSMCNT_SIZE                  4
#define BUS_BUSMCNT_OFFSET                0x1000
#define BUS_BUSMCNT(p)                    (BUS_BASE + BUS_BUSMCNT_OFFSET + (p)*0x0004)
#define BUS_BUSMCNT_IERES                 (1 << 15) /* 8000: Ignore Error Responses */
#define BUS_BUSSCNTFLI_OFFSET             0x1100
#define BUS_BUSSCNTFLI                    (BUS_BASE + BUS_BUSSCNTFLI_OFFSET)
#define BUS_BUSSCNTFLI_ARBMET             (2 <<  4) /* 10: Arbitration Method Specify the priority between groups */
#define BUS_BUSSCNTFLI_ARBMET_MASK             (0x03)
#define BUS_BUSSCNT_SIZE                  2
#define BUS_BUSSCNT_OFFSET                0x1108
#define BUS_BUSSCNT(p)                    (BUS_BASE + BUS_BUSSCNT_OFFSET + (p)*0x0004)
#define BUS_BUSSCNT_ARBMET                (2 <<  4) /* 10: Arbitration Method Specify the priority between groups */
#define BUS_BUSSCNT_ARBMET_MASK                (0x03)
#define BUS_BUSSCNT_SIZE                  4
#define BUS_BUSSCNT_OFFSET                0x1114
#define BUS_BUSSCNT(p)                    (BUS_BASE + BUS_BUSSCNT_OFFSET + (p)*0x0004)
#define BUS_BUSSCNT_ARBMET                (2 <<  4) /* 10: Arbitration Method Specify the priority between groups */
#define BUS_BUSSCNT_ARBMET_MASK                (0x03)
#define BUS_BUSSCNTP6B_OFFSET             0x1128
#define BUS_BUSSCNTP6B                    (BUS_BASE + BUS_BUSSCNTP6B_OFFSET)
#define BUS_BUSSCNTP6B_ARBMET             (2 <<  4) /* 10: Arbitration Method Specify the priority between groups */
#define BUS_BUSSCNTP6B_ARBMET_MASK             (0x03)
#define BUS_BUSSCNTFBU_OFFSET             0x1130
#define BUS_BUSSCNTFBU                    (BUS_BASE + BUS_BUSSCNTFBU_OFFSET)
#define BUS_BUSSCNTFBU_ARBMET             (2 <<  4) /* 10: Arbitration Method Specify the priority between groups */
#define BUS_BUSSCNTFBU_ARBMET_MASK             (0x03)
#define BUS_BUSERRADD_SIZE                4
#define BUS_BUSERRADD_OFFSET              0x1800
#define BUS_BUSERRADD(p)                  (BUS_BASE + BUS_BUSERRADD_OFFSET + (p)*0x0010)
#define BUS_BUSERRADD_BERAD               (32 <<  0) /* 01: Bus Error Address When a bus error occurs, It stores an error address. */
#define BUS_BUSERRADD_BERAD_MASK               (0xffffffff)
#define BUS_BUSERRSTAT_SIZE               4
#define BUS_BUSERRSTAT_OFFSET             0x1804
#define BUS_BUSERRSTAT(p)                 (BUS_BASE + BUS_BUSERRSTAT_OFFSET + (p)*0x0010)
#define BUS_BUSERRSTAT_ERRSTAT            (1 <<  7) /* 80: Bus Error Status When bus error assert, error flag occurs. */
#define BUS_BUSERRSTAT_ACCSTAT            (1 <<  0) /* 01: Error Access Status The status at the time of the error */

/* CAC - Clock Frequency Accuracy Measurement Circuit */
#define CAC_BASE                          0x40044600
#define CAC_CACR0_OFFSET                  0x0000
#define CAC_CACR0                         (CAC_BASE + CAC_CACR0_OFFSET)
#define CAC_CACR0_CFME                    (1 <<  0) /* 01: Clock Frequency Measurement Enable. */
#define CAC_CACR1_OFFSET                  0x0001
#define CAC_CACR1                         (CAC_BASE + CAC_CACR1_OFFSET)
#define CAC_CACR1_EDGES                   (2 <<  6) /* 40: Valid Edge Select */
#define CAC_CACR1_EDGES_MASK                   (0x03)
#define CAC_CACR1_TCSS                    (2 <<  4) /* 10: Measurement Target Clock Frequency Division Ratio Select */
#define CAC_CACR1_TCSS_MASK                    (0x03)
#define CAC_CACR1_FMCS                    (3 <<  1) /* 02: Measurement Target Clock Select */
#define CAC_CACR1_FMCS_MASK                    (0x07)
#define CAC_CACR1_CACREFE                 (1 <<  0) /* 01: CACREF Pin Input Enable */
#define CAC_CACR2_OFFSET                  0x0002
#define CAC_CACR2                         (CAC_BASE + CAC_CACR2_OFFSET)
#define CAC_CACR2_DFS                     (2 <<  6) /* 40: Digital Filter Selection */
#define CAC_CACR2_DFS_MASK                     (0x03)
#define CAC_CACR2_RCDS                    (2 <<  4) /* 10: Measurement Reference Clock Frequency Division Ratio Select */
#define CAC_CACR2_RCDS_MASK                    (0x03)
#define CAC_CACR2_RSCS                    (3 <<  1) /* 02: Measurement Reference Clock Select */
#define CAC_CACR2_RSCS_MASK                    (0x07)
#define CAC_CACR2_RPS                     (1 <<  0) /* 01: Reference Signal Select */
#define CAC_CAICR_OFFSET                  0x0003
#define CAC_CAICR                         (CAC_BASE + CAC_CAICR_OFFSET)
#define CAC_CAICR_OVFFCL                  (1 <<  6) /* 40: OVFF Clear */
#define CAC_CAICR_MENDFCL                 (1 <<  5) /* 20: MENDF Clear */
#define CAC_CAICR_FERRFCL                 (1 <<  4) /* 10: FERRF Clear */
#define CAC_CAICR_OVFIE                   (1 <<  2) /* 04: Overflow Interrupt Request Enable */
#define CAC_CAICR_MENDIE                  (1 <<  1) /* 02: Measurement End Interrupt Request Enable */
#define CAC_CAICR_FERRIE                  (1 <<  0) /* 01: Frequency Error Interrupt Request Enable */
#define CAC_CASTR_OFFSET                  0x0004
#define CAC_CASTR                         (CAC_BASE + CAC_CASTR_OFFSET)
#define CAC_CASTR_OVFF                    (1 <<  2) /* 04: Counter Overflow Flag */
#define CAC_CASTR_MENDF                   (1 <<  1) /* 02: Measurement End Flag */
#define CAC_CASTR_FERRF                   (1 <<  0) /* 01: Frequency Error Flag */
#define CAC_CAULVR_OFFSET                 0x0006
#define CAC_CAULVR                        (CAC_BASE + CAC_CAULVR_OFFSET)
#define CAC_CAULVR_CAULVR                 (16 <<  0) /* 01: CAULVR is a 16-bit readable/writable register that stores the upper-limit value of the frequency. */
#define CAC_CAULVR_CAULVR_MASK                 (0xffff)
#define CAC_CALLVR_OFFSET                 0x0008
#define CAC_CALLVR                        (CAC_BASE + CAC_CALLVR_OFFSET)
#define CAC_CALLVR_CALLVR                 (16 <<  0) /* 01: CALLVR is a 16-bit readable/writable register that stores the lower-limit value of the frequency. */
#define CAC_CALLVR_CALLVR_MASK                 (0xffff)
#define CAC_CACNTBR_OFFSET                0x000a
#define CAC_CACNTBR                       (CAC_BASE + CAC_CACNTBR_OFFSET)
#define CAC_CACNTBR_CACNTBR               (16 <<  0) /* 01: CACNTBR is a 16-bit read-only register that retains the counter value at the time a valid reference signal edge is input */
#define CAC_CACNTBR_CACNTBR_MASK               (0xffff)

