leocafonso/svdtoheaders/demo/h/ra4m1_reg.h
/* CAN0 - CAN0 Module */
#define CAN0_BASE                         0x40050000
#define CAN0_MB_ID_SIZE                   32
#define CAN0_MB_ID_OFFSET                 0x0200
#define CAN0_MB_ID(p)                     (CAN0_BASE + CAN0_MB_ID_OFFSET + (p)*0x0010)
#define CAN0_MB_ID_IDE                    (1 << 31) /* 80000000: ID Extension */
#define CAN0_MB_ID_RTR                    (1 << 30) /* 40000000: Remote Transmission Request */
#define CAN0_MB_ID_SID                    (11 << 18) /* 40000: Standard ID */
#define CAN0_MB_ID_SID_MASK                    (0x7ff)
#define CAN0_MB_ID_EID                    (18 <<  0) /* 01: Extended ID */
#define CAN0_MB_ID_EID_MASK                    (0x3ffff)
#define CAN0_MB_DL_SIZE                   32
#define CAN0_MB_DL_OFFSET                 0x0204
#define CAN0_MB_DL(p)                     (CAN0_BASE + CAN0_MB_DL_OFFSET + (p)*0x0010)
#define CAN0_MB_DL_DLC                    (4 <<  0) /* 01: Data Length Code */
#define CAN0_MB_DL_DLC_MASK                    (0x0f)
#define CAN0_MB_D0_SIZE                   32
#define CAN0_MB_D0_OFFSET                 0x0206
#define CAN0_MB_D0(p)                     (CAN0_BASE + CAN0_MB_D0_OFFSET + (p)*0x0010)
#define CAN0_MB_D0_DATA0                  (8 <<  0) /* 01: Data Bytes 0. DATA0 store the transmitted or received CAN message data. Transmission or reception starts from DATA0. The bit order on the CAN bus is MSB first, and transmission or reception starts from bit 7. */
#define CAN0_MB_D0_DATA0_MASK                  (0xff)
#define CAN0_MB_D1_SIZE                   32
#define CAN0_MB_D1_OFFSET                 0x0207
#define CAN0_MB_D1(p)                     (CAN0_BASE + CAN0_MB_D1_OFFSET + (p)*0x0010)
#define CAN0_MB_D1_DATA1                  (8 <<  0) /* 01: Data Bytes 1 DATA1 store the transmitted or received CAN message data. Transmission or reception starts from DATA0. The bit order on the CAN bus is MSB first, and transmission or reception starts from bit 7. */
#define CAN0_MB_D1_DATA1_MASK                  (0xff)
#define CAN0_MB_D2_SIZE                   32
#define CAN0_MB_D2_OFFSET                 0x0208
#define CAN0_MB_D2(p)                     (CAN0_BASE + CAN0_MB_D2_OFFSET + (p)*0x0010)
#define CAN0_MB_D2_DATA2                  (8 <<  0) /* 01: Data Bytes 2 DATA2 store the transmitted or received CAN message data. Transmission or reception starts from DATA0. The bit order on the CAN bus is MSB first, and transmission or reception starts from bit 7. */
#define CAN0_MB_D2_DATA2_MASK                  (0xff)
#define CAN0_MB_D3_SIZE                   32
#define CAN0_MB_D3_OFFSET                 0x0209
#define CAN0_MB_D3(p)                     (CAN0_BASE + CAN0_MB_D3_OFFSET + (p)*0x0010)
#define CAN0_MB_D3_DATA3                  (8 <<  0) /* 01: Data Bytes 3 DATA3 store the transmitted or received CAN message data. Transmission or reception starts from DATA0. The bit order on the CAN bus is MSB first, and transmission or reception starts from bit 7. */
#define CAN0_MB_D3_DATA3_MASK                  (0xff)
#define CAN0_MB_D4_SIZE                   32
#define CAN0_MB_D4_OFFSET                 0x020a
#define CAN0_MB_D4(p)                     (CAN0_BASE + CAN0_MB_D4_OFFSET + (p)*0x0010)
#define CAN0_MB_D4_DATA4                  (8 <<  0) /* 01: Data Bytes 4 DATA4 store the transmitted or received CAN message data. Transmission or reception starts from DATA0. The bit order on the CAN bus is MSB first, and transmission or reception starts from bit 7. */
#define CAN0_MB_D4_DATA4_MASK                  (0xff)
#define CAN0_MB_D5_SIZE                   32
#define CAN0_MB_D5_OFFSET                 0x020b
#define CAN0_MB_D5(p)                     (CAN0_BASE + CAN0_MB_D5_OFFSET + (p)*0x0010)
#define CAN0_MB_D5_DATA5                  (8 <<  0) /* 01: Data Bytes 5 DATA5 store the transmitted or received CAN message data. Transmission or reception starts from DATA0. The bit order on the CAN bus is MSB first, and transmission or reception starts from bit 7. */
#define CAN0_MB_D5_DATA5_MASK                  (0xff)
#define CAN0_MB_D6_SIZE                   32
#define CAN0_MB_D6_OFFSET                 0x020c
#define CAN0_MB_D6(p)                     (CAN0_BASE + CAN0_MB_D6_OFFSET + (p)*0x0010)
#define CAN0_MB_D6_DATA6                  (8 <<  0) /* 01: Data Bytes 6 DATA6 store the transmitted or received CAN message data. Transmission or reception starts from DATA0. The bit order on the CAN bus is MSB first, and transmission or reception starts from bit 7. */
#define CAN0_MB_D6_DATA6_MASK                  (0xff)
#define CAN0_MB_D7_SIZE                   32
#define CAN0_MB_D7_OFFSET                 0x020d
#define CAN0_MB_D7(p)                     (CAN0_BASE + CAN0_MB_D7_OFFSET + (p)*0x0010)
#define CAN0_MB_D7_DATA7                  (8 <<  0) /* 01: Data Bytes 7 DATA7 store the transmitted or received CAN message data. Transmission or reception starts from DATA0. The bit order on the CAN bus is MSB first, and transmission or reception starts from bit 7. */
#define CAN0_MB_D7_DATA7_MASK                  (0xff)
#define CAN0_MB_TS_SIZE                   32
#define CAN0_MB_TS_OFFSET                 0x020e
#define CAN0_MB_TS(p)                     (CAN0_BASE + CAN0_MB_TS_OFFSET + (p)*0x0010)
#define CAN0_MB_TS_TSH                    (8 <<  8) /* 100: Time Stamp Lower Byte Bits TSH[7:0] store the counter value of the time stamp when received messages are stored in the mailbox. */
#define CAN0_MB_TS_TSH_MASK                    (0xff)
#define CAN0_MB_TS_TSL                    (8 <<  0) /* 01: Time Stamp Higher Byte Bits TSL[7:0] store the counter value of the time stamp when received messages are stored in the mailbox. */
#define CAN0_MB_TS_TSL_MASK                    (0xff)
#define CAN0_MKR_SIZE                     8
#define CAN0_MKR_OFFSET                   0x0400
#define CAN0_MKR(p)                       (CAN0_BASE + CAN0_MKR_OFFSET + (p)*0x0004)
#define CAN0_MKR_SID                      (11 << 18) /* 40000: Standard ID */
#define CAN0_MKR_SID_MASK                      (0x7ff)
#define CAN0_MKR_EID                      (18 <<  0) /* 01: Extended ID */
#define CAN0_MKR_EID_MASK                      (0x3ffff)
#define CAN0_FIDCR_SIZE                   2
#define CAN0_FIDCR_OFFSET                 0x0420
#define CAN0_FIDCR(p)                     (CAN0_BASE + CAN0_FIDCR_OFFSET + (p)*0x0004)
#define CAN0_FIDCR_IDE                    (1 << 31) /* 80000000: ID Extension */
#define CAN0_FIDCR_RTR                    (1 << 30) /* 40000000: Remote Transmission Request */
#define CAN0_FIDCR_SID                    (11 << 18) /* 40000: Standard ID */
#define CAN0_FIDCR_SID_MASK                    (0x7ff)
#define CAN0_FIDCR_EID                    (18 <<  0) /* 01: Extended ID */
#define CAN0_FIDCR_EID_MASK                    (0x3ffff)
#define CAN0_MKIVLR_OFFSET                0x0428
#define CAN0_MKIVLR                       (CAN0_BASE + CAN0_MKIVLR_OFFSET)
#define CAN0_MKIVLR_MB31                  (1 << 31) /* 80000000: mailbox 31 Mask Invalid */
#define CAN0_MKIVLR_MB30                  (1 << 30) /* 40000000: mailbox 30 Mask Invalid */
#define CAN0_MKIVLR_MB29                  (1 << 29) /* 20000000: mailbox 29 Mask Invalid */
#define CAN0_MKIVLR_MB28                  (1 << 28) /* 10000000: mailbox 28 Mask Invalid */
#define CAN0_MKIVLR_MB27                  (1 << 27) /* 8000000: mailbox 27 Mask Invalid */
#define CAN0_MKIVLR_MB26                  (1 << 26) /* 4000000: mailbox 26 Mask Invalid */
#define CAN0_MKIVLR_MB25                  (1 << 25) /* 2000000: mailbox 25 Mask Invalid */
#define CAN0_MKIVLR_MB24                  (1 << 24) /* 1000000: mailbox 24 Mask Invalid */
#define CAN0_MKIVLR_MB23                  (1 << 23) /* 800000: mailbox 23 Mask Invalid */
#define CAN0_MKIVLR_MB22                  (1 << 22) /* 400000: mailbox 22 Mask Invalid */
#define CAN0_MKIVLR_MB21                  (1 << 21) /* 200000: mailbox 21 Mask Invalid */
#define CAN0_MKIVLR_MB20                  (1 << 20) /* 100000: mailbox 20 Mask Invalid */
#define CAN0_MKIVLR_MB19                  (1 << 19) /* 80000: mailbox 19 Mask Invalid */
#define CAN0_MKIVLR_MB18                  (1 << 18) /* 40000: mailbox 18 Mask Invalid */
#define CAN0_MKIVLR_MB17                  (1 << 17) /* 20000: mailbox 17 Mask Invalid */
#define CAN0_MKIVLR_MB16                  (1 << 16) /* 10000: mailbox 16 Mask Invalid */
#define CAN0_MKIVLR_MB15                  (1 << 15) /* 8000: mailbox 15 Mask Invalid */
#define CAN0_MKIVLR_MB14                  (1 << 14) /* 4000: mailbox 14 Mask Invalid */
#define CAN0_MKIVLR_MB13                  (1 << 13) /* 2000: mailbox 13 Mask Invalid */
#define CAN0_MKIVLR_MB12                  (1 << 12) /* 1000: mailbox 12 Mask Invalid */
#define CAN0_MKIVLR_MB11                  (1 << 11) /* 800: mailbox 11 Mask Invalid */
#define CAN0_MKIVLR_MB10                  (1 << 10) /* 400: mailbox 10 Mask Invalid */
#define CAN0_MKIVLR_MB9                   (1 <<  9) /* 200: mailbox 9 Mask Invalid */
#define CAN0_MKIVLR_MB8                   (1 <<  8) /* 100: mailbox 8 Mask Invalid */
#define CAN0_MKIVLR_MB7                   (1 <<  7) /* 80: mailbox 7 Mask Invalid */
#define CAN0_MKIVLR_MB6                   (1 <<  6) /* 40: mailbox 6 Mask Invalid */
#define CAN0_MKIVLR_MB5                   (1 <<  5) /* 20: mailbox 5 Mask Invalid */
#define CAN0_MKIVLR_MB4                   (1 <<  4) /* 10: mailbox 4 Mask Invalid */
#define CAN0_MKIVLR_MB3                   (1 <<  3) /* 08: mailbox 3 Mask Invalid */
#define CAN0_MKIVLR_MB2                   (1 <<  2) /* 04: mailbox 2 Mask Invalid */
#define CAN0_MKIVLR_MB1                   (1 <<  1) /* 02: mailbox 1 Mask Invalid */
#define CAN0_MKIVLR_MB0                   (1 <<  0) /* 01: mailbox 0 Mask Invalid */
#define CAN0_MIER_OFFSET                  0x042c
#define CAN0_MIER                         (CAN0_BASE + CAN0_MIER_OFFSET)
#define CAN0_MIER_MB31                    (1 << 31) /* 80000000: mailbox 31 Interrupt Enable */
#define CAN0_MIER_MB30                    (1 << 30) /* 40000000: mailbox 30 Interrupt Enable */
#define CAN0_MIER_MB29                    (1 << 29) /* 20000000: mailbox 29 Interrupt Enable */
#define CAN0_MIER_MB28                    (1 << 28) /* 10000000: mailbox 28 Interrupt Enable */
#define CAN0_MIER_MB27                    (1 << 27) /* 8000000: mailbox 27 Interrupt Enable */
#define CAN0_MIER_MB26                    (1 << 26) /* 4000000: mailbox 26 Interrupt Enable */
#define CAN0_MIER_MB25                    (1 << 25) /* 2000000: mailbox 25 Interrupt Enable */
#define CAN0_MIER_MB24                    (1 << 24) /* 1000000: mailbox 24 Interrupt Enable */
#define CAN0_MIER_MB23                    (1 << 23) /* 800000: mailbox 23 Interrupt Enable */
#define CAN0_MIER_MB22                    (1 << 22) /* 400000: mailbox 22 Interrupt Enable */
#define CAN0_MIER_MB21                    (1 << 21) /* 200000: mailbox 21 Interrupt Enable */
#define CAN0_MIER_MB20                    (1 << 20) /* 100000: mailbox 20 Interrupt Enable */
#define CAN0_MIER_MB19                    (1 << 19) /* 80000: mailbox 19 Interrupt Enable */
#define CAN0_MIER_MB18                    (1 << 18) /* 40000: mailbox 18 Interrupt Enable */
#define CAN0_MIER_MB17                    (1 << 17) /* 20000: mailbox 17 Interrupt Enable */
#define CAN0_MIER_MB16                    (1 << 16) /* 10000: mailbox 16 Interrupt Enable */
#define CAN0_MIER_MB15                    (1 << 15) /* 8000: mailbox 15 Interrupt Enable */
#define CAN0_MIER_MB14                    (1 << 14) /* 4000: mailbox 14 Interrupt Enable */
#define CAN0_MIER_MB13                    (1 << 13) /* 2000: mailbox 13 Interrupt Enable */
#define CAN0_MIER_MB12                    (1 << 12) /* 1000: mailbox 12 Interrupt Enable */
#define CAN0_MIER_MB11                    (1 << 11) /* 800: mailbox 11 Interrupt Enable */
#define CAN0_MIER_MB10                    (1 << 10) /* 400: mailbox 10 Interrupt Enable */
#define CAN0_MIER_MB9                     (1 <<  9) /* 200: mailbox 9 Interrupt Enable */
#define CAN0_MIER_MB8                     (1 <<  8) /* 100: mailbox 8 Interrupt Enable */
#define CAN0_MIER_MB7                     (1 <<  7) /* 80: mailbox 7 Interrupt Enable */
#define CAN0_MIER_MB6                     (1 <<  6) /* 40: mailbox 6 Interrupt Enable */
#define CAN0_MIER_MB5                     (1 <<  5) /* 20: mailbox 5 Interrupt Enable */
#define CAN0_MIER_MB4                     (1 <<  4) /* 10: mailbox 4 Interrupt Enable */
#define CAN0_MIER_MB3                     (1 <<  3) /* 08: mailbox 3 Interrupt Enable */
#define CAN0_MIER_MB2                     (1 <<  2) /* 04: mailbox 2 Interrupt Enable */
#define CAN0_MIER_MB1                     (1 <<  1) /* 02: mailbox 1 Interrupt Enable */
#define CAN0_MIER_MB0                     (1 <<  0) /* 01: mailbox 0 Interrupt Enable */
#define CAN0_MIER_FIFO_OFFSET             0x042c
#define CAN0_MIER_FIFO                    (CAN0_BASE + CAN0_MIER_FIFO_OFFSET)
#define CAN0_MIER_FIFO_MB29               (1 << 29) /* 20000000: Receive FIFO Interrupt Generation Timing Control */
#define CAN0_MIER_FIFO_MB28               (1 << 28) /* 10000000: Receive FIFO Interrupt Enable */
#define CAN0_MIER_FIFO_MB25               (1 << 25) /* 2000000: Transmit FIFO Interrupt Generation Timing Control */
#define CAN0_MIER_FIFO_MB24               (1 << 24) /* 1000000: Transmit FIFO Interrupt Enable */
#define CAN0_MIER_FIFO_MB23               (1 << 23) /* 800000: mailbox 23 Interrupt Enable */
#define CAN0_MIER_FIFO_MB22               (1 << 22) /* 400000: mailbox 22 Interrupt Enable */
#define CAN0_MIER_FIFO_MB21               (1 << 21) /* 200000: mailbox 21 Interrupt Enable */
#define CAN0_MIER_FIFO_MB20               (1 << 20) /* 100000: mailbox 20 Interrupt Enable */
#define CAN0_MIER_FIFO_MB19               (1 << 19) /* 80000: mailbox 19 Interrupt Enable */
#define CAN0_MIER_FIFO_MB18               (1 << 18) /* 40000: mailbox 18 Interrupt Enable */
#define CAN0_MIER_FIFO_MB17               (1 << 17) /* 20000: mailbox 17 Interrupt Enable */
#define CAN0_MIER_FIFO_MB16               (1 << 16) /* 10000: mailbox 16 Interrupt Enable */
#define CAN0_MIER_FIFO_MB15               (1 << 15) /* 8000: mailbox 15 Interrupt Enable */
#define CAN0_MIER_FIFO_MB14               (1 << 14) /* 4000: mailbox 14 Interrupt Enable */
#define CAN0_MIER_FIFO_MB13               (1 << 13) /* 2000: mailbox 13 Interrupt Enable */
#define CAN0_MIER_FIFO_MB12               (1 << 12) /* 1000: mailbox 12 Interrupt Enable */
#define CAN0_MIER_FIFO_MB11               (1 << 11) /* 800: mailbox 11 Interrupt Enable */
#define CAN0_MIER_FIFO_MB10               (1 << 10) /* 400: mailbox 10 Interrupt Enable */
#define CAN0_MIER_FIFO_MB9                (1 <<  9) /* 200: mailbox 9 Interrupt Enable */
#define CAN0_MIER_FIFO_MB8                (1 <<  8) /* 100: mailbox 8 Interrupt Enable */
#define CAN0_MIER_FIFO_MB7                (1 <<  7) /* 80: mailbox 7 Interrupt Enable */
#define CAN0_MIER_FIFO_MB6                (1 <<  6) /* 40: mailbox 6 Interrupt Enable */
#define CAN0_MIER_FIFO_MB5                (1 <<  5) /* 20: mailbox 5 Interrupt Enable */
#define CAN0_MIER_FIFO_MB4                (1 <<  4) /* 10: mailbox 4 Interrupt Enable */
#define CAN0_MIER_FIFO_MB3                (1 <<  3) /* 08: mailbox 3 Interrupt Enable */
#define CAN0_MIER_FIFO_MB2                (1 <<  2) /* 04: mailbox 2 Interrupt Enable */
#define CAN0_MIER_FIFO_MB1                (1 <<  1) /* 02: mailbox 1 Interrupt Enable */
#define CAN0_MIER_FIFO_MB0                (1 <<  0) /* 01: mailbox 0 Interrupt Enable */
#define CAN0_MCTL_TX_SIZE                 32
#define CAN0_MCTL_TX_OFFSET               0x0820
#define CAN0_MCTL_TX(p)                   (CAN0_BASE + CAN0_MCTL_TX_OFFSET + (p)*0x0001)
#define CAN0_MCTL_TX_TRMREQ               (1 <<  7) /* 80: Transmit Mailbox Request */
#define CAN0_MCTL_TX_RECREQ               (1 <<  6) /* 40: Receive Mailbox Request */
#define CAN0_MCTL_TX_ONESHOT              (1 <<  4) /* 10: One-Shot Enable */
#define CAN0_MCTL_TX_TRMABT               (1 <<  2) /* 04: Transmission Abort Complete Flag (Transmit mailbox setting enabled) */
#define CAN0_MCTL_TX_TRMACTIVE            (1 <<  1) /* 02: Transmission-in-Progress Status Flag (Transmit mailbox setting enabled) */
#define CAN0_MCTL_TX_SENTDATA             (1 <<  0) /* 01: Transmission Complete Flag */
#define CAN0_MCTL_RX_SIZE                 32
#define CAN0_MCTL_RX_OFFSET               0x0820
#define CAN0_MCTL_RX(p)                   (CAN0_BASE + CAN0_MCTL_RX_OFFSET + (p)*0x0001)
#define CAN0_MCTL_RX_TRMREQ               (1 <<  7) /* 80: Transmit Mailbox Request */
#define CAN0_MCTL_RX_RECREQ               (1 <<  6) /* 40: Receive Mailbox Request */
#define CAN0_MCTL_RX_ONESHOT              (1 <<  4) /* 10: One-Shot Enable */
#define CAN0_MCTL_RX_MSGLOST              (1 <<  2) /* 04: Message Lost Flag (Receive mailbox setting enabled) */
#define CAN0_MCTL_RX_INVALDATA            (1 <<  1) /* 02: Reception-in-Progress Status Flag (Receive mailbox setting enabled) */
#define CAN0_MCTL_RX_NEWDATA              (1 <<  0) /* 01: Reception Complete Flag */
#define CAN0_CTLR_OFFSET                  0x0840
#define CAN0_CTLR                         (CAN0_BASE + CAN0_CTLR_OFFSET)
#define CAN0_CTLR_RBOC                    (1 << 13) /* 2000: Forcible Return From Bus-Off */
#define CAN0_CTLR_BOM                     (2 << 11) /* 800: Bus-Off Recovery Mode by a program request */
#define CAN0_CTLR_BOM_MASK                     (0x03)
#define CAN0_CTLR_SLPM                    (1 << 10) /* 400: CAN Sleep Mode */
#define CAN0_CTLR_CANM                    (2 <<  8) /* 100: CAN Operating Mode Select */
#define CAN0_CTLR_CANM_MASK                    (0x03)
#define CAN0_CTLR_TSPS                    (2 <<  6) /* 40: Time Stamp Prescaler Select */
#define CAN0_CTLR_TSPS_MASK                    (0x03)
#define CAN0_CTLR_TSRC                    (1 <<  5) /* 20: Time Stamp Counter Reset Command */
#define CAN0_CTLR_TPM                     (1 <<  4) /* 10: Transmission Priority Mode Select */
#define CAN0_CTLR_MLM                     (1 <<  3) /* 08: Message Lost Mode Select */
#define CAN0_CTLR_IDFM                    (2 <<  1) /* 02: ID Format Mode Select */
#define CAN0_CTLR_IDFM_MASK                    (0x03)
#define CAN0_CTLR_MBM                     (1 <<  0) /* 01: CAN Mailbox Mode Select */
#define CAN0_STR_OFFSET                   0x0842
#define CAN0_STR                          (CAN0_BASE + CAN0_STR_OFFSET)
#define CAN0_STR_RECST                    (1 << 14) /* 4000: Receive Status Flag (receiver) */
#define CAN0_STR_TRMST                    (1 << 13) /* 2000: Transmit Status Flag (transmitter) */
#define CAN0_STR_BOST                     (1 << 12) /* 1000: Bus-Off Status Flag */
#define CAN0_STR_EPST                     (1 << 11) /* 800: Error-Passive Status Flag */
#define CAN0_STR_SLPST                    (1 << 10) /* 400: CAN Sleep Status Flag */
#define CAN0_STR_HLTST                    (1 <<  9) /* 200: CAN Halt Status Flag */
#define CAN0_STR_RSTST                    (1 <<  8) /* 100: CAN Reset Status Flag */
#define CAN0_STR_EST                      (1 <<  7) /* 80: Error Status Flag */
#define CAN0_STR_TABST                    (1 <<  6) /* 40: Transmission Abort Status Flag */
#define CAN0_STR_FMLST                    (1 <<  5) /* 20: FIFO Mailbox Message Lost Status Flag */
#define CAN0_STR_NMLST                    (1 <<  4) /* 10: Normal Mailbox Message Lost Status Flag */
#define CAN0_STR_TFST                     (1 <<  3) /* 08: Transmit FIFO Status Flag */
#define CAN0_STR_RFST                     (1 <<  2) /* 04: Receive FIFO Status Flag */
#define CAN0_STR_SDST                     (1 <<  1) /* 02: SENTDATA Status Flag */
#define CAN0_STR_NDST                     (1 <<  0) /* 01: NEWDATA Status Flag */
#define CAN0_BCR_OFFSET                   0x0844
#define CAN0_BCR                          (CAN0_BASE + CAN0_BCR_OFFSET)
#define CAN0_BCR_TSEG1                    (4 << 28) /* 10000000: Time Segment 1 Control */
#define CAN0_BCR_TSEG1_MASK                    (0x0f)
#define CAN0_BCR_BRP                      (10 << 16) /* 10000: Prescaler Division Ratio Select . These bits set the frequency of the CAN communication clock (fCANCLK). */
#define CAN0_BCR_BRP_MASK                      (0x3ff)
#define CAN0_BCR_SJW                      (2 << 12) /* 1000: Resynchronization Jump Width Control */
#define CAN0_BCR_SJW_MASK                      (0x03)
#define CAN0_BCR_TSEG2                    (3 <<  8) /* 100: Time Segment 2 Control */
#define CAN0_BCR_TSEG2_MASK                    (0x07)
#define CAN0_BCR_CCLKS                    (1 <<  0) /* 01: CAN Clock Source Selection */
#define CAN0_RFCR_OFFSET                  0x0848
#define CAN0_RFCR                         (CAN0_BASE + CAN0_RFCR_OFFSET)
#define CAN0_RFCR_RFEST                   (1 <<  7) /* 80: Receive FIFO Empty Status Flag */
#define CAN0_RFCR_RFWST                   (1 <<  6) /* 40: Receive FIFO Buffer Warning Status Flag */
#define CAN0_RFCR_RFFST                   (1 <<  5) /* 20: Receive FIFO Full Status Flag */
#define CAN0_RFCR_RFMLF                   (1 <<  4) /* 10: Receive FIFO Message Lost Flag */
#define CAN0_RFCR_RFUST                   (3 <<  1) /* 02: Receive FIFO Unread Message Number Status */
#define CAN0_RFCR_RFUST_MASK                   (0x07)
#define CAN0_RFCR_RFE                     (1 <<  0) /* 01: Receive FIFO Enable */
#define CAN0_RFPCR_OFFSET                 0x0849
#define CAN0_RFPCR                        (CAN0_BASE + CAN0_RFPCR_OFFSET)
#define CAN0_RFPCR_RFPCR                  (8 <<  0) /* 01: The CPU-side pointer for the receive FIFO is incremented by writing FFh to RFPCR. */
#define CAN0_RFPCR_RFPCR_MASK                  (0xff)
#define CAN0_TFCR_OFFSET                  0x084a
#define CAN0_TFCR                         (CAN0_BASE + CAN0_TFCR_OFFSET)
#define CAN0_TFCR_TFEST                   (1 <<  7) /* 80: Transmit FIFO Empty Status */
#define CAN0_TFCR_TFFST                   (1 <<  6) /* 40: Transmit FIFO Full Status */
#define CAN0_TFCR_TFUST                   (3 <<  1) /* 02: Transmit FIFO Unsent Message Number Status */
#define CAN0_TFCR_TFUST_MASK                   (0x07)
#define CAN0_TFCR_TFE                     (1 <<  0) /* 01: Transmit FIFO Enable */
#define CAN0_TFPCR_OFFSET                 0x084b
#define CAN0_TFPCR                        (CAN0_BASE + CAN0_TFPCR_OFFSET)
#define CAN0_TFPCR_TFPCR                  (8 <<  0) /* 01: The CPU-side pointer for the transmit FIFO is incremented by writing FFh to TFPCR. */
#define CAN0_TFPCR_TFPCR_MASK                  (0xff)
#define CAN0_EIER_OFFSET                  0x084c
#define CAN0_EIER                         (CAN0_BASE + CAN0_EIER_OFFSET)
#define CAN0_EIER_BLIE                    (1 <<  7) /* 80: Bus Lock Interrupt Enable */
#define CAN0_EIER_OLIE                    (1 <<  6) /* 40: Overload Frame Transmit Interrupt Enable */
#define CAN0_EIER_ORIE                    (1 <<  5) /* 20: Overrun Interrupt Enable */
#define CAN0_EIER_BORIE                   (1 <<  4) /* 10: Bus-Off Recovery Interrupt Enable */
#define CAN0_EIER_BOEIE                   (1 <<  3) /* 08: Bus-Off Entry Interrupt Enable */
#define CAN0_EIER_EPIE                    (1 <<  2) /* 04: Error-Passive Interrupt Enable */
#define CAN0_EIER_EWIE                    (1 <<  1) /* 02: Error-Warning Interrupt Enable */
#define CAN0_EIER_BEIE                    (1 <<  0) /* 01: Bus Error Interrupt Enable */
#define CAN0_EIFR_OFFSET                  0x084d
#define CAN0_EIFR                         (CAN0_BASE + CAN0_EIFR_OFFSET)
#define CAN0_EIFR_BLIF                    (1 <<  7) /* 80: Bus Lock Detect Flag */
#define CAN0_EIFR_OLIF                    (1 <<  6) /* 40: Overload Frame Transmission Detect Flag */
#define CAN0_EIFR_ORIF                    (1 <<  5) /* 20: Receive Overrun Detect Flag */
#define CAN0_EIFR_BORIF                   (1 <<  4) /* 10: Bus-Off Recovery Detect Flag */
