leocafonso/svdtoheaders/demo/h/ra4m1_reg.h
#define CAN0_EIFR_BOEIF                   (1 <<  3) /* 08: Bus-Off Entry Detect Flag */
#define CAN0_EIFR_EPIF                    (1 <<  2) /* 04: Error-Passive Detect Flag */
#define CAN0_EIFR_EWIF                    (1 <<  1) /* 02: Error-Warning Detect Flag */
#define CAN0_EIFR_BEIF                    (1 <<  0) /* 01: Bus Error Detect Flag */
#define CAN0_RECR_OFFSET                  0x084e
#define CAN0_RECR                         (CAN0_BASE + CAN0_RECR_OFFSET)
#define CAN0_RECR_RECR                    (8 <<  0) /* 01: Receive error count function RECR increments or decrements the counter value according to the error status of the CAN module during reception. */
#define CAN0_RECR_RECR_MASK                    (0xff)
#define CAN0_TECR_OFFSET                  0x084f
#define CAN0_TECR                         (CAN0_BASE + CAN0_TECR_OFFSET)
#define CAN0_TECR_TECR                    (8 <<  0) /* 01: Transmit error count function TECR increments or decrements the counter value according to the error status of the CAN module during transmission. */
#define CAN0_TECR_TECR_MASK                    (0xff)
#define CAN0_ECSR_OFFSET                  0x0850
#define CAN0_ECSR                         (CAN0_BASE + CAN0_ECSR_OFFSET)
#define CAN0_ECSR_EDPM                    (1 <<  7) /* 80: Error Display Mode Select */
#define CAN0_ECSR_ADEF                    (1 <<  6) /* 40: ACK Delimiter Error Flag */
#define CAN0_ECSR_BE0F                    (1 <<  5) /* 20: Bit Error (dominant) Flag */
#define CAN0_ECSR_BE1F                    (1 <<  4) /* 10: Bit Error (recessive) Flag */
#define CAN0_ECSR_CEF                     (1 <<  3) /* 08: CRC Error Flag */
#define CAN0_ECSR_AEF                     (1 <<  2) /* 04: ACK Error Flag */
#define CAN0_ECSR_FEF                     (1 <<  1) /* 02: Form Error Flag */
#define CAN0_ECSR_SEF                     (1 <<  0) /* 01: Stuff Error Flag */
#define CAN0_CSSR_OFFSET                  0x0851
#define CAN0_CSSR                         (CAN0_BASE + CAN0_CSSR_OFFSET)
#define CAN0_CSSR_CSSR                    (8 <<  0) /* 01: When the value for the channel search is input, the channel number is output to MSSR. */
#define CAN0_CSSR_CSSR_MASK                    (0xff)
#define CAN0_MSSR_OFFSET                  0x0852
#define CAN0_MSSR                         (CAN0_BASE + CAN0_MSSR_OFFSET)
#define CAN0_MSSR_SEST                    (1 <<  7) /* 80: Search Result Status */
#define CAN0_MSSR_MBNST                   (5 <<  0) /* 01: Search Result Mailbox Number Status These bits output the smallest mailbox number that is searched in each mode of MSMR. */
#define CAN0_MSSR_MBNST_MASK                   (0x1f)
#define CAN0_MSMR_OFFSET                  0x0853
#define CAN0_MSMR                         (CAN0_BASE + CAN0_MSMR_OFFSET)
#define CAN0_MSMR_MBSM                    (2 <<  0) /* 01: Mailbox Search Mode Select */
#define CAN0_MSMR_MBSM_MASK                    (0x03)
#define CAN0_TSR_OFFSET                   0x0854
#define CAN0_TSR                          (CAN0_BASE + CAN0_TSR_OFFSET)
#define CAN0_TSR_TSR                      (16 <<  0) /* 01: Free-running counter value for the time stamp function */
#define CAN0_TSR_TSR_MASK                      (0xffff)
#define CAN0_AFSR_OFFSET                  0x0856
#define CAN0_AFSR                         (CAN0_BASE + CAN0_AFSR_OFFSET)
#define CAN0_AFSR_AFSR                    (16 <<  0) /* 01: After the standard ID of a received message is written, the value converted for data table search can be read. */
#define CAN0_AFSR_AFSR_MASK                    (0xffff)
#define CAN0_TCR_OFFSET                   0x0858
#define CAN0_TCR                          (CAN0_BASE + CAN0_TCR_OFFSET)
#define CAN0_TCR_TSTM                     (2 <<  1) /* 02: CAN Test Mode Select */
#define CAN0_TCR_TSTM_MASK                     (0x03)
#define CAN0_TCR_TSTE                     (1 <<  0) /* 01: CAN Test Mode Enable */

/* DBG - Debug Function */
#define DBG_BASE                          0x4001b000
#define DBG_DBGSTR_OFFSET                 0x0000
#define DBG_DBGSTR                        (DBG_BASE + DBG_DBGSTR_OFFSET)
#define DBG_DBGSTR_CDBGPWRUPACK           (1 << 29) /* 20000000: Debug power-up acknowledge */
#define DBG_DBGSTR_CDBGPWRUPREQ           (1 << 28) /* 10000000: Debug power-up request */
#define DBG_DBGSTOPCR_OFFSET              0x0010
#define DBG_DBGSTOPCR                     (DBG_BASE + DBG_DBGSTOPCR_OFFSET)
#define DBG_DBGSTOPCR_DBGSTOP_RECCR       (1 << 25) /* 2000000: Mask bit for RAM ECC error reset/interrupt */
#define DBG_DBGSTOPCR_DBGSTOP_RPER        (1 << 24) /* 1000000: Mask bit for RAM parity error reset/interrupt */
#define DBG_DBGSTOPCR_DBGSTOP_LVD         (3 << 16) /* 10000: b18: Mask bit for LVD2 reset/interrupt (0:enable / 1:Mask) b17: Mask bit for LVD1 reset/interrupt (0:enable / 1:Mask) b16: Mask bit for LVD0 reset (0:enable / 1:Mask) */
#define DBG_DBGSTOPCR_DBGSTOP_LVD_MASK         (0x07)
#define DBG_DBGSTOPCR_DBGSTOP_WDT         (1 <<  1) /* 02: Mask bit for WDT reset/interrupt */
#define DBG_DBGSTOPCR_DBGSTOP_IWDT        (1 <<  0) /* 01: Mask bit for IWDT reset/interrupt */
#define DBG_TRACECTR_OFFSET               0x0020
#define DBG_TRACECTR                      (DBG_BASE + DBG_TRACECTR_OFFSET)
#define DBG_TRACECTR_ENETBFULL            (1 << 31) /* 80000000: Enable bit for halt request by ETB full */

/* CRC - CRC Calculator */
#define CRC_BASE                          0x40074000
#define CRC_CRCCR0_OFFSET                 0x0000
#define CRC_CRCCR0                        (CRC_BASE + CRC_CRCCR0_OFFSET)
#define CRC_CRCCR0_DORCLR                 (1 <<  7) /* 80: CRCDOR Register Clear */
#define CRC_CRCCR0_LMS                    (1 <<  6) /* 40: CRC Calculation Switching */
#define CRC_CRCCR0_GPS                    (3 <<  0) /* 01: CRC Generating Polynomial Switching */
#define CRC_CRCCR0_GPS_MASK                    (0x07)
#define CRC_CRCCR1_OFFSET                 0x0001
#define CRC_CRCCR1                        (CRC_BASE + CRC_CRCCR1_OFFSET)
#define CRC_CRCCR1_CRCSEN                 (1 <<  7) /* 80: Snoop enable bit */
#define CRC_CRCCR1_CRCSWR                 (1 <<  6) /* 40: Snoop-on-write/read switch bit */
#define CRC_CRCDIR_OFFSET                 0x0004
#define CRC_CRCDIR                        (CRC_BASE + CRC_CRCDIR_OFFSET)
#define CRC_CRCDIR_CRCDIR                 (32 <<  0) /* 01: Calculation input Data (Case of CRC-32, CRC-32C ) */
#define CRC_CRCDIR_CRCDIR_MASK                 (0xffffffff)
#define CRC_CRCDIR_BY_OFFSET              0x0004
#define CRC_CRCDIR_BY                     (CRC_BASE + CRC_CRCDIR_BY_OFFSET)
#define CRC_CRCDIR_BY_CRCDIR_BY           (8 <<  0) /* 01: Calculation input Data ( Case of CRC-8, CRC-16 or CRC-CCITT ) */
#define CRC_CRCDIR_BY_CRCDIR_BY_MASK           (0xff)
#define CRC_CRCDOR_OFFSET                 0x0008
#define CRC_CRCDOR                        (CRC_BASE + CRC_CRCDOR_OFFSET)
#define CRC_CRCDOR_CRCDOR                 (32 <<  0) /* 01: Calculation output Data (Case of CRC-32, CRC-32C ) */
#define CRC_CRCDOR_CRCDOR_MASK                 (0xffffffff)
#define CRC_CRCDOR_HA_OFFSET              0x0008
#define CRC_CRCDOR_HA                     (CRC_BASE + CRC_CRCDOR_HA_OFFSET)
#define CRC_CRCDOR_HA_CRCDOR_HA           (16 <<  0) /* 01: Calculation output Data (Case of CRC-16 or CRC-CCITT ) */
#define CRC_CRCDOR_HA_CRCDOR_HA_MASK           (0xffff)
#define CRC_CRCDOR_BY_OFFSET              0x0008
#define CRC_CRCDOR_BY                     (CRC_BASE + CRC_CRCDOR_BY_OFFSET)
#define CRC_CRCDOR_BY_CRCDOR_BY           (8 <<  0) /* 01: Calculation output Data (Case of CRC-8 ) */
#define CRC_CRCDOR_BY_CRCDOR_BY_MASK           (0xff)
#define CRC_CRCSAR_OFFSET                 0x000c
#define CRC_CRCSAR                        (CRC_BASE + CRC_CRCSAR_OFFSET)
#define CRC_CRCSAR_CRCSA                  (14 <<  0) /* 01: snoop address bit Set the I/O register address to snoop */
#define CRC_CRCSAR_CRCSA_MASK                  (0x3fff)

