leocafonso/svdtoheaders/demo/h/ra4m1_reg.h
/* CTSU - Capacitive Touch Sensing Unit */
#define CTSU_BASE                         0x40081000
#define CTSU_CTSUCR0_OFFSET               0x0000
#define CTSU_CTSUCR0                      (CTSU_BASE + CTSU_CTSUCR0_OFFSET)
#define CTSU_CTSUCR0_CTSUINIT             (1 <<  4) /* 10: CTSU Control Block Initialization */
#define CTSU_CTSUCR0_CTSUSNZ              (1 <<  2) /* 04: CTSU Wait State Power-Saving Enable */
#define CTSU_CTSUCR0_CTSUCAP              (1 <<  1) /* 02: CTSU Measurement Operation Start Trigger Select */
#define CTSU_CTSUCR0_CTSUSTRT             (1 <<  0) /* 01: CTSU Measurement Operation Start */
#define CTSU_CTSUCR1_OFFSET               0x0001
#define CTSU_CTSUCR1                      (CTSU_BASE + CTSU_CTSUCR1_OFFSET)
#define CTSU_CTSUCR1_CTSUMD               (2 <<  6) /* 40: CTSU Measurement Mode Select */
#define CTSU_CTSUCR1_CTSUMD_MASK               (0x03)
#define CTSU_CTSUCR1_CTSUCLK              (2 <<  4) /* 10: CTSU Operating Clock Select */
#define CTSU_CTSUCR1_CTSUCLK_MASK              (0x03)
#define CTSU_CTSUCR1_CTSUATUNE1           (1 <<  3) /* 08: CTSU Power Supply Capacity Adjustment */
#define CTSU_CTSUCR1_CTSUATUNE0           (1 <<  2) /* 04: CTSU Power Supply Operating Mode Setting */
#define CTSU_CTSUCR1_CTSUCSW              (1 <<  1) /* 02: CTSU LPF Capacitance Charging Control */
#define CTSU_CTSUCR1_CTSUPON              (1 <<  0) /* 01: CTSU Power Supply Enable */
#define CTSU_CTSUSDPRS_OFFSET             0x0002
#define CTSU_CTSUSDPRS                    (CTSU_BASE + CTSU_CTSUSDPRS_OFFSET)
#define CTSU_CTSUSDPRS_CTSUSOFF           (1 <<  6) /* 40: CTSU High-Pass Noise Reduction Function Off Setting */
#define CTSU_CTSUSDPRS_CTSUPRMODE         (2 <<  4) /* 10: CTSU Base Period and Pulse Count Setting */
#define CTSU_CTSUSDPRS_CTSUPRMODE_MASK         (0x03)
#define CTSU_CTSUSDPRS_CTSUPRRATIO        (4 <<  0) /* 01: CTSU Measurement Time and Pulse Count Adjustment Recommended setting: 3 (0011b) */
#define CTSU_CTSUSDPRS_CTSUPRRATIO_MASK        (0x0f)
#define CTSU_CTSUSST_OFFSET               0x0003
#define CTSU_CTSUSST                      (CTSU_BASE + CTSU_CTSUSST_OFFSET)
#define CTSU_CTSUSST_CTSUSST              (8 <<  0) /* 01: CTSU Sensor Stabilization Wait Control NOTE: The value of these bits should be fixed to 00010000b. */
#define CTSU_CTSUSST_CTSUSST_MASK              (0xff)
#define CTSU_CTSUMCH0_OFFSET              0x0004
#define CTSU_CTSUMCH0                     (CTSU_BASE + CTSU_CTSUMCH0_OFFSET)
#define CTSU_CTSUMCH0_CTSUMCH0            (6 <<  0) /* 01: CTSU Measurement Channel 0. Note1: Writing to these bits is only enabled in self-capacitance single-scan mode (CTSUCR1.CTSUMD[1:0] bits = 00b). Note2: If the value of CTSUMCH0 was set to b'111111 in mode other than self-capacitor single scan mode, the measurement is stopped. */
#define CTSU_CTSUMCH0_CTSUMCH0_MASK            (0x3f)
#define CTSU_CTSUMCH1_OFFSET              0x0005
#define CTSU_CTSUMCH1                     (CTSU_BASE + CTSU_CTSUMCH1_OFFSET)
#define CTSU_CTSUMCH1_CTSUMCH1            (6 <<  0) /* 01: CTSU Measurement Channel 1 Note1: If the value of CTSUMCH1 was set to b'111111, the measurement is stopped. */
#define CTSU_CTSUMCH1_CTSUMCH1_MASK            (0x3f)
#define CTSU_CTSUCHAC0_OFFSET             0x0006
#define CTSU_CTSUCHAC0                    (CTSU_BASE + CTSU_CTSUCHAC0_OFFSET)
#define CTSU_CTSUCHAC0_CTSUCHAC0          (8 <<  0) /* 01: CTSU Channel Enable Control 0. 0: Not measurement target 1: Measurement target Note: CTSUCHAC0[0] corresponds to TS00 and CTSUCHAC0[7] corresponds to TS07. but the write value of CTSUCHAC0[2] should be 0. */
#define CTSU_CTSUCHAC0_CTSUCHAC0_MASK          (0xff)
#define CTSU_CTSUCHAC1_OFFSET             0x0007
#define CTSU_CTSUCHAC1                    (CTSU_BASE + CTSU_CTSUCHAC1_OFFSET)
#define CTSU_CTSUCHAC1_CTSUCHAC1          (8 <<  0) /* 01: CTSU Channel Enable Control 1. 0: Not measurement target 1: Measurement target Note: CTSUCHAC1[0] corresponds to TS08 and CTSUCHAC1[7] corresponds to TS15. */
#define CTSU_CTSUCHAC1_CTSUCHAC1_MASK          (0xff)
#define CTSU_CTSUCHAC2_OFFSET             0x0008
#define CTSU_CTSUCHAC2                    (CTSU_BASE + CTSU_CTSUCHAC2_OFFSET)
#define CTSU_CTSUCHAC2_CTSUCHAC2          (8 <<  0) /* 01: CTSU Channel Enable Control 2. 0: Not measurement target 1: Measurement target Note: CTSUCHAC2[0] corresponds to TS16 and CTSUCHAC2[7] corresponds to TS23. */
#define CTSU_CTSUCHAC2_CTSUCHAC2_MASK          (0xff)
#define CTSU_CTSUCHAC3_OFFSET             0x0009
#define CTSU_CTSUCHAC3                    (CTSU_BASE + CTSU_CTSUCHAC3_OFFSET)
#define CTSU_CTSUCHAC3_CTSUCHAC3          (8 <<  0) /* 01: CTSU Channel Enable Control 3. 0: Not measurement target 1: Measurement target Note: CTSUCHAC3[0] corresponds to TS24 and CTSUCHAC3[7] corresponds to TS31. */
#define CTSU_CTSUCHAC3_CTSUCHAC3_MASK          (0xff)
#define CTSU_CTSUCHAC4_OFFSET             0x000a
#define CTSU_CTSUCHAC4                    (CTSU_BASE + CTSU_CTSUCHAC4_OFFSET)
#define CTSU_CTSUCHAC4_CTSUCHAC4          (4 <<  0) /* 01: CTSU Channel Enable Control 4. 0: Not measurement target 1: Measurement target Note: CTSUCHAC4[0] corresponds to TS32 and CTSUCHAC4[3] corresponds to TS35. but the write value of CTSUCHAC0[4],CTSUCHAC4[5],CTSUCHAC4[6],CTSUCHAC4[7] should be 0. */
#define CTSU_CTSUCHAC4_CTSUCHAC4_MASK          (0x0f)
#define CTSU_CTSUCHTRC0_OFFSET            0x000b
#define CTSU_CTSUCHTRC0                   (CTSU_BASE + CTSU_CTSUCHTRC0_OFFSET)
#define CTSU_CTSUCHTRC0_CTSUCHTRC0        (8 <<  0) /* 01: CTSU Channel Transmit/Receive Control 0 */
#define CTSU_CTSUCHTRC0_CTSUCHTRC0_MASK        (0xff)
#define CTSU_CTSUCHTRC1_OFFSET            0x000c
#define CTSU_CTSUCHTRC1                   (CTSU_BASE + CTSU_CTSUCHTRC1_OFFSET)
#define CTSU_CTSUCHTRC1_CTSUCHTRC1        (8 <<  0) /* 01: CTSU Channel Transmit/Receive Control 1 */
#define CTSU_CTSUCHTRC1_CTSUCHTRC1_MASK        (0xff)
#define CTSU_CTSUCHTRC2_OFFSET            0x000d
#define CTSU_CTSUCHTRC2                   (CTSU_BASE + CTSU_CTSUCHTRC2_OFFSET)
#define CTSU_CTSUCHTRC2_CTSUCHTRC2        (8 <<  0) /* 01: CTSU Channel Transmit/Receive Control 2 */
#define CTSU_CTSUCHTRC2_CTSUCHTRC2_MASK        (0xff)
#define CTSU_CTSUCHTRC3_OFFSET            0x000e
#define CTSU_CTSUCHTRC3                   (CTSU_BASE + CTSU_CTSUCHTRC3_OFFSET)
#define CTSU_CTSUCHTRC3_CTSUCHTRC3        (8 <<  0) /* 01: CTSU Channel Transmit/Receive Control 3 */
#define CTSU_CTSUCHTRC3_CTSUCHTRC3_MASK        (0xff)
#define CTSU_CTSUCHTRC4_OFFSET            0x000f
#define CTSU_CTSUCHTRC4                   (CTSU_BASE + CTSU_CTSUCHTRC4_OFFSET)
#define CTSU_CTSUCHTRC4_CTSUCHAC4         (4 <<  0) /* 01: CTSU Channel Transmit/Receive Control 4 */
#define CTSU_CTSUCHTRC4_CTSUCHAC4_MASK         (0x0f)
#define CTSU_CTSUDCLKC_OFFSET             0x0010
#define CTSU_CTSUDCLKC                    (CTSU_BASE + CTSU_CTSUDCLKC_OFFSET)
#define CTSU_CTSUDCLKC_CTSUSSCNT          (2 <<  4) /* 10: CTSU Diffusion Clock Mode Control NOTE: This bit should be set to 11b. */
#define CTSU_CTSUDCLKC_CTSUSSCNT_MASK          (0x03)
#define CTSU_CTSUDCLKC_CTSUSSMOD          (2 <<  0) /* 01: CTSU Diffusion Clock Mode Select NOTE: This bit should be set to 00b. */
#define CTSU_CTSUDCLKC_CTSUSSMOD_MASK          (0x03)
#define CTSU_CTSUST_OFFSET                0x0011
#define CTSU_CTSUST                       (CTSU_BASE + CTSU_CTSUST_OFFSET)
#define CTSU_CTSUST_CTSUPS                (1 <<  7) /* 80: CTSU Mutual Capacitance Status Flag */
#define CTSU_CTSUST_CTSUROVF              (1 <<  6) /* 40: CTSU Reference Counter Overflow Flag */
#define CTSU_CTSUST_CTSUSOVF              (1 <<  5) /* 20: CTSU Sensor Counter Overflow Flag */
#define CTSU_CTSUST_CTSUDTSR              (1 <<  4) /* 10: CTSU Data Transfer Status Flag */
#define CTSU_CTSUST_CTSUSTC               (3 <<  0) /* 01: CTSU Measurement Status Counter */
#define CTSU_CTSUST_CTSUSTC_MASK               (0x07)
#define CTSU_CTSUSSC_OFFSET               0x0012
#define CTSU_CTSUSSC                      (CTSU_BASE + CTSU_CTSUSSC_OFFSET)
#define CTSU_CTSUSSC_CTSUSSDIV            (4 <<  8) /* 100: CTSU Spectrum Diffusion Frequency Division Setting */
#define CTSU_CTSUSSC_CTSUSSDIV_MASK            (0x0f)
#define CTSU_CTSUSO0_OFFSET               0x0014
#define CTSU_CTSUSO0                      (CTSU_BASE + CTSU_CTSUSO0_OFFSET)
#define CTSU_CTSUSO0_CTSUSNUM             (6 << 10) /* 400: CTSU Measurement Count Setting */
#define CTSU_CTSUSO0_CTSUSNUM_MASK             (0x3f)
#define CTSU_CTSUSO0_CTSUSO               (10 <<  0) /* 01: CTSU Sensor Offset Adjustment Current offset amount is CTSUSO ( 0 to 1023 ) */
#define CTSU_CTSUSO0_CTSUSO_MASK               (0x3ff)
#define CTSU_CTSUSO1_OFFSET               0x0016
#define CTSU_CTSUSO1                      (CTSU_BASE + CTSU_CTSUSO1_OFFSET)
#define CTSU_CTSUSO1_CTSUICOG             (2 << 13) /* 2000: CTSU ICO Gain Adjustment */
#define CTSU_CTSUSO1_CTSUICOG_MASK             (0x03)
#define CTSU_CTSUSO1_CTSUSDPA             (5 <<  8) /* 100: CTSU Base Clock Setting Operating clock divided by ( CTSUSDPA + 1 ) x 2 */
#define CTSU_CTSUSO1_CTSUSDPA_MASK             (0x1f)
#define CTSU_CTSUSO1_CTSURICOA            (8 <<  0) /* 01: CTSU Reference ICO Current Adjustment Current offset amount is CTSUSO ( 0 to 255 ) */
#define CTSU_CTSUSO1_CTSURICOA_MASK            (0xff)
#define CTSU_CTSUSC_OFFSET                0x0018
#define CTSU_CTSUSC                       (CTSU_BASE + CTSU_CTSUSC_OFFSET)
#define CTSU_CTSUSC_CTSUSC                (16 <<  0) /* 01: CTSU Sensor Counter These bits indicate the measurement result of the CTSU. These bits indicate FFFFh when an overflow occurs. */
#define CTSU_CTSUSC_CTSUSC_MASK                (0xffff)
#define CTSU_CTSURC_OFFSET                0x001a
#define CTSU_CTSURC                       (CTSU_BASE + CTSU_CTSURC_OFFSET)
#define CTSU_CTSURC_CTSURC                (16 <<  0) /* 01: CTSU Reference Counter These bits indicate the measurement result of the reference ICO. These bits indicate FFFFh when an overflow occurs. */
#define CTSU_CTSURC_CTSURC_MASK                (0xffff)
#define CTSU_CTSUERRS_OFFSET              0x001c
#define CTSU_CTSUERRS                     (CTSU_BASE + CTSU_CTSUERRS_OFFSET)
#define CTSU_CTSUERRS_CTSUICOMP           (1 << 15) /* 8000: TSCAP Voltage Error Monitor */

