leocafonso/svdtoheaders/demo/h/ra4m1_reg.h
/* DAC12 - 12-bit D/A converter */
#define DAC12_BASE                        0x4005e000
#define DAC12_DADR0_OFFSET                0x0000
#define DAC12_DADR0                       (DAC12_BASE + DAC12_DADR0_OFFSET)
#define DAC12_DADR0_DADR                  (16 <<  0) /* 01: D/A Data Register NOTE: When DADPR.DPSEL = 0, the high-order 4 bits are fixed to 0: right justified format. When DADPR.DPSEL = 1, the low-order 4 bits are fixed to 0: left justified format. */
#define DAC12_DADR0_DADR_MASK                  (0xffff)
#define DAC12_DACR_OFFSET                 0x0004
#define DAC12_DACR                        (DAC12_BASE + DAC12_DACR_OFFSET)
#define DAC12_DACR_DAOE0                  (1 <<  6) /* 40: D/A Output Enable 0 */
#define DAC12_DADPR_OFFSET                0x0005
#define DAC12_DADPR                       (DAC12_BASE + DAC12_DADPR_OFFSET)
#define DAC12_DADPR_DPSEL                 (1 <<  7) /* 80: DADRm Format Select */
#define DAC12_DAADSCR_OFFSET              0x0006
#define DAC12_DAADSCR                     (DAC12_BASE + DAC12_DAADSCR_OFFSET)
#define DAC12_DAADSCR_DAADST              (1 <<  7) /* 80: D/A-A/D Synchronous Conversion */
#define DAC12_DAVREFCR_OFFSET             0x0007
#define DAC12_DAVREFCR                    (DAC12_BASE + DAC12_DAVREFCR_OFFSET)
#define DAC12_DAVREFCR_REF                (3 <<  0) /* 01: D/A Reference Voltage Select */
#define DAC12_DAVREFCR_REF_MASK                (0x07)

/* DAC8 - 8-bit D/A converter */
#define DAC8_BASE                         0x4009e000
#define DAC8_DACS_SIZE                    2
#define DAC8_DACS_OFFSET                  0x0000
#define DAC8_DACS(p)                      (DAC8_BASE + DAC8_DACS_OFFSET + (p)*0x0001)
#define DAC8_DACS_DACS                    (8 <<  0) /* 01: DACS D/A conversion store data note: When 8-bit D/A Converter output is selected as the reference input for the ACMPLP in the COMPSEL1 register, and ACMPLP operation is enabled (COMPMDR.CnENB = 1), changing the DACS[7:0] bits for the channel in use is prohibited. */
#define DAC8_DACS_DACS_MASK                    (0xff)
#define DAC8_DAM_OFFSET                   0x0003
#define DAC8_DAM                          (DAC8_BASE + DAC8_DAM_OFFSET)
#define DAC8_DAM_DACE1                    (1 <<  5) /* 20: D/A Operation Enable 1 */
#define DAC8_DAM_DACE0                    (1 <<  4) /* 10: D/A Operation Enable 0 */

/* DMAC0 - Direct memory access controller 0 */
#define DMAC0_BASE                        0x40005000
#define DMAC0_DMSAR_OFFSET                0x0000
#define DMAC0_DMSAR                       (DMAC0_BASE + DMAC0_DMSAR_OFFSET)
#define DMAC0_DMSAR_DMSAR                 (32 <<  0) /* 01: Specifies the transfer source start address. */
#define DMAC0_DMSAR_DMSAR_MASK                 (0xffffffff)
#define DMAC0_DMDAR_OFFSET                0x0004
#define DMAC0_DMDAR                       (DMAC0_BASE + DMAC0_DMDAR_OFFSET)
#define DMAC0_DMDAR_DMDAR                 (32 <<  0) /* 01: Specifies the transfer destination start address. */
#define DMAC0_DMDAR_DMDAR_MASK                 (0xffffffff)
#define DMAC0_DMCRA_OFFSET                0x0008
#define DMAC0_DMCRA                       (DMAC0_BASE + DMAC0_DMCRA_OFFSET)
#define DMAC0_DMCRA_DMCRAH                (10 << 16) /* 10000: Upper bits of transfer count */
#define DMAC0_DMCRA_DMCRAH_MASK                (0x3ff)
#define DMAC0_DMCRA_DMCRAL                (16 <<  0) /* 01: Lower bits of transfer count */
#define DMAC0_DMCRA_DMCRAL_MASK                (0xffff)
#define DMAC0_DMCRB_OFFSET                0x000c
#define DMAC0_DMCRB                       (DMAC0_BASE + DMAC0_DMCRB_OFFSET)
#define DMAC0_DMCRB_DMCRB                 (16 <<  0) /* 01: Specifies the number of block transfer operations or repeat transfer operations. */
#define DMAC0_DMCRB_DMCRB_MASK                 (0xffff)
#define DMAC0_DMTMD_OFFSET                0x0010
#define DMAC0_DMTMD                       (DMAC0_BASE + DMAC0_DMTMD_OFFSET)
#define DMAC0_DMTMD_MD                    (2 << 14) /* 4000: Transfer Mode Select */
#define DMAC0_DMTMD_MD_MASK                    (0x03)
#define DMAC0_DMTMD_DTS                   (2 << 12) /* 1000: Repeat Area Select */
#define DMAC0_DMTMD_DTS_MASK                   (0x03)
#define DMAC0_DMTMD_SZ                    (2 <<  8) /* 100: Transfer Data Size Select */
#define DMAC0_DMTMD_SZ_MASK                    (0x03)
#define DMAC0_DMTMD_DCTG                  (2 <<  0) /* 01: Transfer Request Source Select */
#define DMAC0_DMTMD_DCTG_MASK                  (0x03)
#define DMAC0_DMINT_OFFSET                0x0013
#define DMAC0_DMINT                       (DMAC0_BASE + DMAC0_DMINT_OFFSET)
#define DMAC0_DMINT_DTIE                  (1 <<  4) /* 10: Transfer End Interrupt Enable */
#define DMAC0_DMINT_ESIE                  (1 <<  3) /* 08: Transfer Escape End Interrupt Enable */
#define DMAC0_DMINT_RPTIE                 (1 <<  2) /* 04: Repeat Size End Interrupt Enable */
#define DMAC0_DMINT_SARIE                 (1 <<  1) /* 02: Source Address Extended Repeat Area Overflow Interrupt Enable */
#define DMAC0_DMINT_DARIE                 (1 <<  0) /* 01: Destination Address Extended Repeat Area Overflow Interrupt Enable */
#define DMAC0_DMAMD_OFFSET                0x0014
#define DMAC0_DMAMD                       (DMAC0_BASE + DMAC0_DMAMD_OFFSET)
#define DMAC0_DMAMD_SM                    (2 << 14) /* 4000: Source Address Update Mode */
#define DMAC0_DMAMD_SM_MASK                    (0x03)
#define DMAC0_DMAMD_SARA                  (5 <<  8) /* 100: Source Address Extended Repeat Area Specifies the extended repeat area on the source address. For details on the settings. */
#define DMAC0_DMAMD_SARA_MASK                  (0x1f)
#define DMAC0_DMAMD_DM                    (2 <<  6) /* 40: Destination Address Update Mode */
#define DMAC0_DMAMD_DM_MASK                    (0x03)
#define DMAC0_DMAMD_DARA                  (5 <<  0) /* 01: Destination Address Extended Repeat Area Specifies the extended repeat area on the destination address. For details on the settings. */
#define DMAC0_DMAMD_DARA_MASK                  (0x1f)
#define DMAC0_DMOFR_OFFSET                0x0018
#define DMAC0_DMOFR                       (DMAC0_BASE + DMAC0_DMOFR_OFFSET)
#define DMAC0_DMOFR_DMOFR                 (32 <<  0) /* 01: Specifies the offset when offset addition is selected as the address update mode for transfer source or destination. */
#define DMAC0_DMOFR_DMOFR_MASK                 (0xffffffff)
#define DMAC0_DMCNT_OFFSET                0x001c
#define DMAC0_DMCNT                       (DMAC0_BASE + DMAC0_DMCNT_OFFSET)
#define DMAC0_DMCNT_DTE                   (1 <<  0) /* 01: DMA Transfer Enable */
#define DMAC0_DMREQ_OFFSET                0x001d
#define DMAC0_DMREQ                       (DMAC0_BASE + DMAC0_DMREQ_OFFSET)
#define DMAC0_DMREQ_CLRS                  (1 <<  4) /* 10: DMA Software Start Bit Auto Clear Select */
#define DMAC0_DMREQ_SWREQ                 (1 <<  0) /* 01: DMA Software Start */
#define DMAC0_DMSTS_OFFSET                0x001e
#define DMAC0_DMSTS                       (DMAC0_BASE + DMAC0_DMSTS_OFFSET)
#define DMAC0_DMSTS_ACT                   (1 <<  7) /* 80: DMA Active Flag */
#define DMAC0_DMSTS_DTIF                  (1 <<  4) /* 10: Transfer End Interrupt Flag */
#define DMAC0_DMSTS_ESIF                  (1 <<  0) /* 01: Transfer Escape End Interrupt Flag */

/* No registers defined for peripheral DMAC1. Using those of DMAC0. */
#define DMAC1_BASE                        0x40005040
#define DMAC1_DMSAR_OFFSET                DMAC0_DMSAR_OFFSET
#define DMAC1_DMSAR                       DMAC0_DMSAR
#define DMAC1_DMSAR_DMSAR                 DMAC0_DMSAR_DMSAR
#define DMAC1_DMSAR_DMSAR_MASK            DMAC0_DMSAR_DMSAR_MASK
#define DMAC1_DMDAR_OFFSET                DMAC0_DMDAR_OFFSET
#define DMAC1_DMDAR                       DMAC0_DMDAR
#define DMAC1_DMDAR_DMDAR                 DMAC0_DMDAR_DMDAR
#define DMAC1_DMDAR_DMDAR_MASK            DMAC0_DMDAR_DMDAR_MASK
#define DMAC1_DMCRA_OFFSET                DMAC0_DMCRA_OFFSET
#define DMAC1_DMCRA                       DMAC0_DMCRA
#define DMAC1_DMCRA_DMCRAH                DMAC0_DMCRA_DMCRAH
#define DMAC1_DMCRA_DMCRAH_MASK           DMAC0_DMCRA_DMCRAH_MASK
#define DMAC1_DMCRA_DMCRAL                DMAC0_DMCRA_DMCRAL
#define DMAC1_DMCRA_DMCRAL_MASK           DMAC0_DMCRA_DMCRAL_MASK
#define DMAC1_DMCRB_OFFSET                DMAC0_DMCRB_OFFSET
#define DMAC1_DMCRB                       DMAC0_DMCRB
#define DMAC1_DMCRB_DMCRB                 DMAC0_DMCRB_DMCRB
#define DMAC1_DMCRB_DMCRB_MASK            DMAC0_DMCRB_DMCRB_MASK
#define DMAC1_DMTMD_OFFSET                DMAC0_DMTMD_OFFSET
#define DMAC1_DMTMD                       DMAC0_DMTMD
#define DMAC1_DMTMD_MD                    DMAC0_DMTMD_MD
#define DMAC1_DMTMD_MD_MASK               DMAC0_DMTMD_MD_MASK
#define DMAC1_DMTMD_DTS                   DMAC0_DMTMD_DTS
#define DMAC1_DMTMD_DTS_MASK              DMAC0_DMTMD_DTS_MASK
#define DMAC1_DMTMD_SZ                    DMAC0_DMTMD_SZ
#define DMAC1_DMTMD_SZ_MASK               DMAC0_DMTMD_SZ_MASK
#define DMAC1_DMTMD_DCTG                  DMAC0_DMTMD_DCTG
#define DMAC1_DMTMD_DCTG_MASK             DMAC0_DMTMD_DCTG_MASK
#define DMAC1_DMINT_OFFSET                DMAC0_DMINT_OFFSET
#define DMAC1_DMINT                       DMAC0_DMINT
#define DMAC1_DMINT_DTIE                  DMAC0_DMINT_DTIE
#define DMAC1_DMINT_ESIE                  DMAC0_DMINT_ESIE
#define DMAC1_DMINT_RPTIE                 DMAC0_DMINT_RPTIE
#define DMAC1_DMINT_SARIE                 DMAC0_DMINT_SARIE
#define DMAC1_DMINT_DARIE                 DMAC0_DMINT_DARIE
#define DMAC1_DMAMD_OFFSET                DMAC0_DMAMD_OFFSET
#define DMAC1_DMAMD                       DMAC0_DMAMD
#define DMAC1_DMAMD_SM                    DMAC0_DMAMD_SM
#define DMAC1_DMAMD_SM_MASK               DMAC0_DMAMD_SM_MASK
#define DMAC1_DMAMD_SARA                  DMAC0_DMAMD_SARA
#define DMAC1_DMAMD_SARA_MASK             DMAC0_DMAMD_SARA_MASK
#define DMAC1_DMAMD_DM                    DMAC0_DMAMD_DM
#define DMAC1_DMAMD_DM_MASK               DMAC0_DMAMD_DM_MASK
#define DMAC1_DMAMD_DARA                  DMAC0_DMAMD_DARA
#define DMAC1_DMAMD_DARA_MASK             DMAC0_DMAMD_DARA_MASK
#define DMAC1_DMOFR_OFFSET                DMAC0_DMOFR_OFFSET
#define DMAC1_DMOFR                       DMAC0_DMOFR
#define DMAC1_DMOFR_DMOFR                 DMAC0_DMOFR_DMOFR
#define DMAC1_DMOFR_DMOFR_MASK            DMAC0_DMOFR_DMOFR_MASK
#define DMAC1_DMCNT_OFFSET                DMAC0_DMCNT_OFFSET
#define DMAC1_DMCNT                       DMAC0_DMCNT
#define DMAC1_DMCNT_DTE                   DMAC0_DMCNT_DTE
#define DMAC1_DMREQ_OFFSET                DMAC0_DMREQ_OFFSET
#define DMAC1_DMREQ                       DMAC0_DMREQ
#define DMAC1_DMREQ_CLRS                  DMAC0_DMREQ_CLRS
#define DMAC1_DMREQ_SWREQ                 DMAC0_DMREQ_SWREQ
#define DMAC1_DMSTS_OFFSET                DMAC0_DMSTS_OFFSET
#define DMAC1_DMSTS                       DMAC0_DMSTS
#define DMAC1_DMSTS_ACT                   DMAC0_DMSTS_ACT
#define DMAC1_DMSTS_DTIF                  DMAC0_DMSTS_DTIF
#define DMAC1_DMSTS_ESIF                  DMAC0_DMSTS_ESIF

