leocafonso/svdtoheaders/demo/h/ra4m1_reg.h
/* No registers defined for peripheral DMAC2. Using those of DMAC0. */
#define DMAC2_BASE                        0x40005080
#define DMAC2_DMSAR_OFFSET                DMAC0_DMSAR_OFFSET
#define DMAC2_DMSAR                       DMAC0_DMSAR
#define DMAC2_DMSAR_DMSAR                 DMAC0_DMSAR_DMSAR
#define DMAC2_DMSAR_DMSAR_MASK            DMAC0_DMSAR_DMSAR_MASK
#define DMAC2_DMDAR_OFFSET                DMAC0_DMDAR_OFFSET
#define DMAC2_DMDAR                       DMAC0_DMDAR
#define DMAC2_DMDAR_DMDAR                 DMAC0_DMDAR_DMDAR
#define DMAC2_DMDAR_DMDAR_MASK            DMAC0_DMDAR_DMDAR_MASK
#define DMAC2_DMCRA_OFFSET                DMAC0_DMCRA_OFFSET
#define DMAC2_DMCRA                       DMAC0_DMCRA
#define DMAC2_DMCRA_DMCRAH                DMAC0_DMCRA_DMCRAH
#define DMAC2_DMCRA_DMCRAH_MASK           DMAC0_DMCRA_DMCRAH_MASK
#define DMAC2_DMCRA_DMCRAL                DMAC0_DMCRA_DMCRAL
#define DMAC2_DMCRA_DMCRAL_MASK           DMAC0_DMCRA_DMCRAL_MASK
#define DMAC2_DMCRB_OFFSET                DMAC0_DMCRB_OFFSET
#define DMAC2_DMCRB                       DMAC0_DMCRB
#define DMAC2_DMCRB_DMCRB                 DMAC0_DMCRB_DMCRB
#define DMAC2_DMCRB_DMCRB_MASK            DMAC0_DMCRB_DMCRB_MASK
#define DMAC2_DMTMD_OFFSET                DMAC0_DMTMD_OFFSET
#define DMAC2_DMTMD                       DMAC0_DMTMD
#define DMAC2_DMTMD_MD                    DMAC0_DMTMD_MD
#define DMAC2_DMTMD_MD_MASK               DMAC0_DMTMD_MD_MASK
#define DMAC2_DMTMD_DTS                   DMAC0_DMTMD_DTS
#define DMAC2_DMTMD_DTS_MASK              DMAC0_DMTMD_DTS_MASK
#define DMAC2_DMTMD_SZ                    DMAC0_DMTMD_SZ
#define DMAC2_DMTMD_SZ_MASK               DMAC0_DMTMD_SZ_MASK
#define DMAC2_DMTMD_DCTG                  DMAC0_DMTMD_DCTG
#define DMAC2_DMTMD_DCTG_MASK             DMAC0_DMTMD_DCTG_MASK
#define DMAC2_DMINT_OFFSET                DMAC0_DMINT_OFFSET
#define DMAC2_DMINT                       DMAC0_DMINT
#define DMAC2_DMINT_DTIE                  DMAC0_DMINT_DTIE
#define DMAC2_DMINT_ESIE                  DMAC0_DMINT_ESIE
#define DMAC2_DMINT_RPTIE                 DMAC0_DMINT_RPTIE
#define DMAC2_DMINT_SARIE                 DMAC0_DMINT_SARIE
#define DMAC2_DMINT_DARIE                 DMAC0_DMINT_DARIE
#define DMAC2_DMAMD_OFFSET                DMAC0_DMAMD_OFFSET
#define DMAC2_DMAMD                       DMAC0_DMAMD
#define DMAC2_DMAMD_SM                    DMAC0_DMAMD_SM
#define DMAC2_DMAMD_SM_MASK               DMAC0_DMAMD_SM_MASK
#define DMAC2_DMAMD_SARA                  DMAC0_DMAMD_SARA
#define DMAC2_DMAMD_SARA_MASK             DMAC0_DMAMD_SARA_MASK
#define DMAC2_DMAMD_DM                    DMAC0_DMAMD_DM
#define DMAC2_DMAMD_DM_MASK               DMAC0_DMAMD_DM_MASK
#define DMAC2_DMAMD_DARA                  DMAC0_DMAMD_DARA
#define DMAC2_DMAMD_DARA_MASK             DMAC0_DMAMD_DARA_MASK
#define DMAC2_DMOFR_OFFSET                DMAC0_DMOFR_OFFSET
#define DMAC2_DMOFR                       DMAC0_DMOFR
#define DMAC2_DMOFR_DMOFR                 DMAC0_DMOFR_DMOFR
#define DMAC2_DMOFR_DMOFR_MASK            DMAC0_DMOFR_DMOFR_MASK
#define DMAC2_DMCNT_OFFSET                DMAC0_DMCNT_OFFSET
#define DMAC2_DMCNT                       DMAC0_DMCNT
#define DMAC2_DMCNT_DTE                   DMAC0_DMCNT_DTE
#define DMAC2_DMREQ_OFFSET                DMAC0_DMREQ_OFFSET
#define DMAC2_DMREQ                       DMAC0_DMREQ
#define DMAC2_DMREQ_CLRS                  DMAC0_DMREQ_CLRS
#define DMAC2_DMREQ_SWREQ                 DMAC0_DMREQ_SWREQ
#define DMAC2_DMSTS_OFFSET                DMAC0_DMSTS_OFFSET
#define DMAC2_DMSTS                       DMAC0_DMSTS
#define DMAC2_DMSTS_ACT                   DMAC0_DMSTS_ACT
#define DMAC2_DMSTS_DTIF                  DMAC0_DMSTS_DTIF
#define DMAC2_DMSTS_ESIF                  DMAC0_DMSTS_ESIF

/* No registers defined for peripheral DMAC3. Using those of DMAC0. */
#define DMAC3_BASE                        0x400050c0
#define DMAC3_DMSAR_OFFSET                DMAC0_DMSAR_OFFSET
#define DMAC3_DMSAR                       DMAC0_DMSAR
#define DMAC3_DMSAR_DMSAR                 DMAC0_DMSAR_DMSAR
#define DMAC3_DMSAR_DMSAR_MASK            DMAC0_DMSAR_DMSAR_MASK
#define DMAC3_DMDAR_OFFSET                DMAC0_DMDAR_OFFSET
#define DMAC3_DMDAR                       DMAC0_DMDAR
#define DMAC3_DMDAR_DMDAR                 DMAC0_DMDAR_DMDAR
#define DMAC3_DMDAR_DMDAR_MASK            DMAC0_DMDAR_DMDAR_MASK
#define DMAC3_DMCRA_OFFSET                DMAC0_DMCRA_OFFSET
#define DMAC3_DMCRA                       DMAC0_DMCRA
#define DMAC3_DMCRA_DMCRAH                DMAC0_DMCRA_DMCRAH
#define DMAC3_DMCRA_DMCRAH_MASK           DMAC0_DMCRA_DMCRAH_MASK
#define DMAC3_DMCRA_DMCRAL                DMAC0_DMCRA_DMCRAL
#define DMAC3_DMCRA_DMCRAL_MASK           DMAC0_DMCRA_DMCRAL_MASK
#define DMAC3_DMCRB_OFFSET                DMAC0_DMCRB_OFFSET
#define DMAC3_DMCRB                       DMAC0_DMCRB
#define DMAC3_DMCRB_DMCRB                 DMAC0_DMCRB_DMCRB
#define DMAC3_DMCRB_DMCRB_MASK            DMAC0_DMCRB_DMCRB_MASK
#define DMAC3_DMTMD_OFFSET                DMAC0_DMTMD_OFFSET
#define DMAC3_DMTMD                       DMAC0_DMTMD
#define DMAC3_DMTMD_MD                    DMAC0_DMTMD_MD
#define DMAC3_DMTMD_MD_MASK               DMAC0_DMTMD_MD_MASK
#define DMAC3_DMTMD_DTS                   DMAC0_DMTMD_DTS
#define DMAC3_DMTMD_DTS_MASK              DMAC0_DMTMD_DTS_MASK
#define DMAC3_DMTMD_SZ                    DMAC0_DMTMD_SZ
#define DMAC3_DMTMD_SZ_MASK               DMAC0_DMTMD_SZ_MASK
#define DMAC3_DMTMD_DCTG                  DMAC0_DMTMD_DCTG
#define DMAC3_DMTMD_DCTG_MASK             DMAC0_DMTMD_DCTG_MASK
#define DMAC3_DMINT_OFFSET                DMAC0_DMINT_OFFSET
#define DMAC3_DMINT                       DMAC0_DMINT
#define DMAC3_DMINT_DTIE                  DMAC0_DMINT_DTIE
#define DMAC3_DMINT_ESIE                  DMAC0_DMINT_ESIE
#define DMAC3_DMINT_RPTIE                 DMAC0_DMINT_RPTIE
#define DMAC3_DMINT_SARIE                 DMAC0_DMINT_SARIE
#define DMAC3_DMINT_DARIE                 DMAC0_DMINT_DARIE
#define DMAC3_DMAMD_OFFSET                DMAC0_DMAMD_OFFSET
#define DMAC3_DMAMD                       DMAC0_DMAMD
#define DMAC3_DMAMD_SM                    DMAC0_DMAMD_SM
#define DMAC3_DMAMD_SM_MASK               DMAC0_DMAMD_SM_MASK
#define DMAC3_DMAMD_SARA                  DMAC0_DMAMD_SARA
#define DMAC3_DMAMD_SARA_MASK             DMAC0_DMAMD_SARA_MASK
#define DMAC3_DMAMD_DM                    DMAC0_DMAMD_DM
#define DMAC3_DMAMD_DM_MASK               DMAC0_DMAMD_DM_MASK
#define DMAC3_DMAMD_DARA                  DMAC0_DMAMD_DARA
#define DMAC3_DMAMD_DARA_MASK             DMAC0_DMAMD_DARA_MASK
#define DMAC3_DMOFR_OFFSET                DMAC0_DMOFR_OFFSET
#define DMAC3_DMOFR                       DMAC0_DMOFR
#define DMAC3_DMOFR_DMOFR                 DMAC0_DMOFR_DMOFR
#define DMAC3_DMOFR_DMOFR_MASK            DMAC0_DMOFR_DMOFR_MASK
#define DMAC3_DMCNT_OFFSET                DMAC0_DMCNT_OFFSET
#define DMAC3_DMCNT                       DMAC0_DMCNT
#define DMAC3_DMCNT_DTE                   DMAC0_DMCNT_DTE
#define DMAC3_DMREQ_OFFSET                DMAC0_DMREQ_OFFSET
#define DMAC3_DMREQ                       DMAC0_DMREQ
#define DMAC3_DMREQ_CLRS                  DMAC0_DMREQ_CLRS
#define DMAC3_DMREQ_SWREQ                 DMAC0_DMREQ_SWREQ
#define DMAC3_DMSTS_OFFSET                DMAC0_DMSTS_OFFSET
#define DMAC3_DMSTS                       DMAC0_DMSTS
#define DMAC3_DMSTS_ACT                   DMAC0_DMSTS_ACT
#define DMAC3_DMSTS_DTIF                  DMAC0_DMSTS_DTIF
#define DMAC3_DMSTS_ESIF                  DMAC0_DMSTS_ESIF

/* DMA - DMAC Module Activation */
#define DMA_BASE                          0x40005200
#define DMA_DMAST_OFFSET                  0x0000
#define DMA_DMAST                         (DMA_BASE + DMA_DMAST_OFFSET)
#define DMA_DMAST_DMST                    (1 <<  0) /* 01: DMAC Operation Enable */

/* DOC - Data Operation Circuit */
#define DOC_BASE                          0x40054100
#define DOC_DOCR_OFFSET                   0x0000
#define DOC_DOCR                          (DOC_BASE + DOC_DOCR_OFFSET)
#define DOC_DOCR_DOPCFCL                  (1 <<  6) /* 40: DOPCF Clear */
#define DOC_DOCR_DOPCF                    (1 <<  5) /* 20: Data Operation Circuit Flag Indicates the result of an operation. */
#define DOC_DOCR_DCSEL                    (1 <<  2) /* 04: Detection Condition Select */
#define DOC_DOCR_OMS                      (2 <<  0) /* 01: Operating Mode Select */
#define DOC_DOCR_OMS_MASK                      (0x03)
#define DOC_DODIR_OFFSET                  0x0002
#define DOC_DODIR                         (DOC_BASE + DOC_DODIR_OFFSET)
#define DOC_DODIR_DODIR                   (16 <<  0) /* 01: 16-bit read-write register in which 16-bit data for use in the operations are stored. */
#define DOC_DODIR_DODIR_MASK                   (0xffff)
#define DOC_DODSR_OFFSET                  0x0004
#define DOC_DODSR                         (DOC_BASE + DOC_DODSR_OFFSET)
#define DOC_DODSR_DODSR                   (16 <<  0) /* 01: This register stores 16-bit data for use as a reference in data comparison mode. This register also stores the results of operations in data addition and data subtraction modes. */
#define DOC_DODSR_DODSR_MASK                   (0xffff)

/* DTC - Data Transfer Controller */
#define DTC_BASE                          0x40005400
#define DTC_DTCCR_OFFSET                  0x0000
#define DTC_DTCCR                         (DTC_BASE + DTC_DTCCR_OFFSET)
#define DTC_DTCCR_RRS                     (1 <<  4) /* 10: DTC Transfer Information Read Skip Enable. */
#define DTC_DTCVBR_OFFSET                 0x0004
#define DTC_DTCVBR                        (DTC_BASE + DTC_DTCVBR_OFFSET)
#define DTC_DTCVBR_DTCVBR                 (32 <<  0) /* 01: DTC Vector Base Address. Note: A value cannot be set in the lower-order 10 bits. These bits are fixed to 0. */
#define DTC_DTCVBR_DTCVBR_MASK                 (0xffffffff)
#define DTC_DTCST_OFFSET                  0x000c
#define DTC_DTCST                         (DTC_BASE + DTC_DTCST_OFFSET)
#define DTC_DTCST_DTCST                   (1 <<  0) /* 01: DTC Module Start */
#define DTC_DTCSTS_OFFSET                 0x000e
#define DTC_DTCSTS                        (DTC_BASE + DTC_DTCSTS_OFFSET)
#define DTC_DTCSTS_ACT                    (1 << 15) /* 8000: DTC Active Flag */
#define DTC_DTCSTS_VECN                   (8 <<  0) /* 01: DTC-Activating Vector Number Monitoring These bits indicate the vector number for the activating source when DTC transfer is in progress. The value is only valid if DTC transfer is in progress (the value of the ACT flag is 1) */
#define DTC_DTCSTS_VECN_MASK                   (0xff)

/* ELC - Event Link Controller */
#define ELC_BASE                          0x40041000
#define ELC_ELCR_OFFSET                   0x0000
#define ELC_ELCR                          (ELC_BASE + ELC_ELCR_OFFSET)
#define ELC_ELCR_ELCON                    (1 <<  7) /* 80: All Event Link Enable */
#define ELC_ELSEGR_SIZE                   2
#define ELC_ELSEGR_OFFSET                 0x0002
#define ELC_ELSEGR(p)                     (ELC_BASE + ELC_ELSEGR_OFFSET + (p)*0x0002)
#define ELC_ELSEGR_WI                     (1 <<  7) /* 80: ELSEGR Register Write Disable */
#define ELC_ELSEGR_WE                     (1 <<  6) /* 40: SEG Bit Write Enable */
#define ELC_ELSEGR_SEG                    (1 <<  0) /* 01: Software Event Generation */
#define ELC_ELSR_SIZE                     10
#define ELC_ELSR_OFFSET                   0x0010
#define ELC_ELSR(p)                       (ELC_BASE + ELC_ELSR_OFFSET + (p)*0x0004)
#define ELC_ELSR_ELS                      (8 <<  0) /* 01: Event Link Select */
#define ELC_ELSR_ELS_MASK                      (0xff)
#define ELC_ELSR12_OFFSET                 0x0040
#define ELC_ELSR12                        (ELC_BASE + ELC_ELSR12_OFFSET)
#define ELC_ELSR12_ELS                    (8 <<  0) /* 01: Event Link Select */
#define ELC_ELSR12_ELS_MASK                    (0xff)
#define ELC_ELSR_SIZE                     5
#define ELC_ELSR_OFFSET                   0x0048
#define ELC_ELSR(p)                       (ELC_BASE + ELC_ELSR_OFFSET + (p)*0x0004)
#define ELC_ELSR_ELS                      (8 <<  0) /* 01: Event Link Select */
#define ELC_ELSR_ELS_MASK                      (0xff)

/* FCACHE - Flash Cache */
#define FCACHE_BASE                       0x4001c000
#define FCACHE_FCACHEE_OFFSET             0x0100
#define FCACHE_FCACHEE                    (FCACHE_BASE + FCACHE_FCACHEE_OFFSET)
#define FCACHE_FCACHEE_FCACHEEN           (1 <<  0) /* 01: FCACHE Enable */
#define FCACHE_FCACHEIV_OFFSET            0x0104
#define FCACHE_FCACHEIV                   (FCACHE_BASE + FCACHE_FCACHEIV_OFFSET)
#define FCACHE_FCACHEIV_FCACHEIV          (1 <<  0) /* 01: FCACHE Invalidation */
#define FCACHE_FLWT_OFFSET                0x011c
#define FCACHE_FLWT                       (FCACHE_BASE + FCACHE_FLWT_OFFSET)
#define FCACHE_FLWT_FLWT                  (3 <<  0) /* 01: These bits represent the ratio of the CPU clock period to the Flash memory access time. */
#define FCACHE_FLWT_FLWT_MASK                  (0x07)

/* PORT0 - Port 0 Control Registers */
#define PORT0_BASE                        0x40040000
#define PORT0_PCNTR1_OFFSET               0x0000
#define PORT0_PCNTR1                      (PORT0_BASE + PORT0_PCNTR1_OFFSET)
#define PORT0_PCNTR1_PODR                 (16 << 16) /* 10000: Pmn Output Data */
#define PORT0_PCNTR1_PODR_MASK                 (0xffff)
#define PORT0_PCNTR1_PDR                  (16 <<  0) /* 01: Pmn Direction */
#define PORT0_PCNTR1_PDR_MASK                  (0xffff)
#define PORT0_PODR_OFFSET                 0x0000
#define PORT0_PODR                        (PORT0_BASE + PORT0_PODR_OFFSET)
#define PORT0_PODR_PODR                   (16 <<  0) /* 01: Pmn Output Data */
#define PORT0_PODR_PODR_MASK                   (0xffff)
#define PORT0_PDR_OFFSET                  0x0002
#define PORT0_PDR                         (PORT0_BASE + PORT0_PDR_OFFSET)
#define PORT0_PDR_PDR                     (16 <<  0) /* 01: Pmn Direction */
#define PORT0_PDR_PDR_MASK                     (0xffff)
#define PORT0_PCNTR2_OFFSET               0x0004
#define PORT0_PCNTR2                      (PORT0_BASE + PORT0_PCNTR2_OFFSET)
#define PORT0_PCNTR2_PIDR                 (16 <<  0) /* 01: Pmn Input Data */
#define PORT0_PCNTR2_PIDR_MASK                 (0xffff)
#define PORT0_PIDR_OFFSET                 0x0006
#define PORT0_PIDR                        (PORT0_BASE + PORT0_PIDR_OFFSET)
#define PORT0_PIDR_PIDR                   (16 <<  0) /* 01: Pmn Input Data */
#define PORT0_PIDR_PIDR_MASK                   (0xffff)
#define PORT0_PCNTR3_OFFSET               0x0008
#define PORT0_PCNTR3                      (PORT0_BASE + PORT0_PCNTR3_OFFSET)
#define PORT0_PCNTR3_PORR                 (16 << 16) /* 10000: Pmn Output Reset */
#define PORT0_PCNTR3_PORR_MASK                 (0xffff)
#define PORT0_PCNTR3_POSR                 (16 <<  0) /* 01: Pmn Output Set */
#define PORT0_PCNTR3_POSR_MASK                 (0xffff)
#define PORT0_PORR_OFFSET                 0x0008
#define PORT0_PORR                        (PORT0_BASE + PORT0_PORR_OFFSET)
#define PORT0_PORR_PORR                   (16 <<  0) /* 01: Pmn Output Reset */
#define PORT0_PORR_PORR_MASK                   (0xffff)
#define PORT0_POSR_OFFSET                 0x000a
#define PORT0_POSR                        (PORT0_BASE + PORT0_POSR_OFFSET)
#define PORT0_POSR_POSR                   (16 <<  0) /* 01: Pmn Output Set */
#define PORT0_POSR_POSR_MASK                   (0xffff)

/* PORT1 - Port 1 Control Registers */
#define PORT1_BASE                        0x40040020
#define PORT1_PCNTR1_OFFSET               0x0000
#define PORT1_PCNTR1                      (PORT1_BASE + PORT1_PCNTR1_OFFSET)
#define PORT1_PCNTR1_PODR                 (16 << 16) /* 10000: Pmn Output Data */
#define PORT1_PCNTR1_PODR_MASK                 (0xffff)
#define PORT1_PCNTR1_PDR                  (16 <<  0) /* 01: Pmn Direction */
#define PORT1_PCNTR1_PDR_MASK                  (0xffff)
#define PORT1_PODR_OFFSET                 0x0000
#define PORT1_PODR                        (PORT1_BASE + PORT1_PODR_OFFSET)
#define PORT1_PODR_PODR                   (16 <<  0) /* 01: Pmn Output Data */
#define PORT1_PODR_PODR_MASK                   (0xffff)
#define PORT1_PDR_OFFSET                  0x0002
#define PORT1_PDR                         (PORT1_BASE + PORT1_PDR_OFFSET)
#define PORT1_PDR_PDR                     (16 <<  0) /* 01: Pmn Direction */
#define PORT1_PDR_PDR_MASK                     (0xffff)
#define PORT1_PCNTR2_OFFSET               0x0004
#define PORT1_PCNTR2                      (PORT1_BASE + PORT1_PCNTR2_OFFSET)
#define PORT1_PCNTR2_EIDR                 (16 << 16) /* 10000: Pmn Event Input Data */
#define PORT1_PCNTR2_EIDR_MASK                 (0xffff)
#define PORT1_PCNTR2_PIDR                 (16 <<  0) /* 01: Pmn Input Data */
#define PORT1_PCNTR2_PIDR_MASK                 (0xffff)
#define PORT1_EIDR_OFFSET                 0x0004
#define PORT1_EIDR                        (PORT1_BASE + PORT1_EIDR_OFFSET)
#define PORT1_EIDR_EIDR                   (16 <<  0) /* 01: Pmn Event Input Data */
#define PORT1_EIDR_EIDR_MASK                   (0xffff)
#define PORT1_PIDR_OFFSET                 0x0006
#define PORT1_PIDR                        (PORT1_BASE + PORT1_PIDR_OFFSET)
#define PORT1_PIDR_PIDR                   (16 <<  0) /* 01: Pmn Input Data */
#define PORT1_PIDR_PIDR_MASK                   (0xffff)
#define PORT1_PCNTR3_OFFSET               0x0008
#define PORT1_PCNTR3                      (PORT1_BASE + PORT1_PCNTR3_OFFSET)
#define PORT1_PCNTR3_PORR                 (16 << 16) /* 10000: Pmn Output Reset */
#define PORT1_PCNTR3_PORR_MASK                 (0xffff)
#define PORT1_PCNTR3_POSR                 (16 <<  0) /* 01: Pmn Output Set */
#define PORT1_PCNTR3_POSR_MASK                 (0xffff)
#define PORT1_PORR_OFFSET                 0x0008
#define PORT1_PORR                        (PORT1_BASE + PORT1_PORR_OFFSET)
#define PORT1_PORR_PORR                   (16 <<  0) /* 01: Pmn Output Reset */
#define PORT1_PORR_PORR_MASK                   (0xffff)
#define PORT1_POSR_OFFSET                 0x000a
#define PORT1_POSR                        (PORT1_BASE + PORT1_POSR_OFFSET)
#define PORT1_POSR_POSR                   (16 <<  0) /* 01: Pmn Output Set */
#define PORT1_POSR_POSR_MASK                   (0xffff)
#define PORT1_PCNTR4_OFFSET               0x000c
#define PORT1_PCNTR4                      (PORT1_BASE + PORT1_PCNTR4_OFFSET)
#define PORT1_PCNTR4_EORR                 (16 << 16) /* 10000: Pmn Event Output Reset */
#define PORT1_PCNTR4_EORR_MASK                 (0xffff)
#define PORT1_PCNTR4_EOSR                 (16 <<  0) /* 01: Pmn Event Output Set */
#define PORT1_PCNTR4_EOSR_MASK                 (0xffff)
#define PORT1_EORR_OFFSET                 0x000c
#define PORT1_EORR                        (PORT1_BASE + PORT1_EORR_OFFSET)
#define PORT1_EORR_EORR                   (16 <<  0) /* 01: Pmn Event Output Reset */
#define PORT1_EORR_EORR_MASK                   (0xffff)
#define PORT1_EOSR_OFFSET                 0x000e
#define PORT1_EOSR                        (PORT1_BASE + PORT1_EOSR_OFFSET)
#define PORT1_EOSR_EOSR                   (16 <<  0) /* 01: Pmn Event Output Set */
#define PORT1_EOSR_EOSR_MASK                   (0xffff)

/* No registers defined for peripheral PORT2. Using those of PORT1. */
#define PORT2_BASE                        0x40040040
#define PORT2_PCNTR1_OFFSET               PORT1_PCNTR1_OFFSET
#define PORT2_PCNTR1                      PORT1_PCNTR1
#define PORT2_PCNTR1_PODR                 PORT1_PCNTR1_PODR
#define PORT2_PCNTR1_PODR_MASK            PORT1_PCNTR1_PODR_MASK
#define PORT2_PCNTR1_PDR                  PORT1_PCNTR1_PDR
#define PORT2_PCNTR1_PDR_MASK             PORT1_PCNTR1_PDR_MASK
#define PORT2_PODR_OFFSET                 PORT1_PODR_OFFSET
#define PORT2_PODR                        PORT1_PODR
#define PORT2_PODR_PODR                   PORT1_PODR_PODR
#define PORT2_PODR_PODR_MASK              PORT1_PODR_PODR_MASK
#define PORT2_PDR_OFFSET                  PORT1_PDR_OFFSET
#define PORT2_PDR                         PORT1_PDR
#define PORT2_PDR_PDR                     PORT1_PDR_PDR
#define PORT2_PDR_PDR_MASK                PORT1_PDR_PDR_MASK
#define PORT2_PCNTR2_OFFSET               PORT1_PCNTR2_OFFSET
#define PORT2_PCNTR2                      PORT1_PCNTR2
#define PORT2_PCNTR2_EIDR                 PORT1_PCNTR2_EIDR
#define PORT2_PCNTR2_EIDR_MASK            PORT1_PCNTR2_EIDR_MASK
#define PORT2_PCNTR2_PIDR                 PORT1_PCNTR2_PIDR
#define PORT2_PCNTR2_PIDR_MASK            PORT1_PCNTR2_PIDR_MASK
#define PORT2_EIDR_OFFSET                 PORT1_EIDR_OFFSET
#define PORT2_EIDR                        PORT1_EIDR
#define PORT2_EIDR_EIDR                   PORT1_EIDR_EIDR
#define PORT2_EIDR_EIDR_MASK              PORT1_EIDR_EIDR_MASK
#define PORT2_PIDR_OFFSET                 PORT1_PIDR_OFFSET
#define PORT2_PIDR                        PORT1_PIDR
#define PORT2_PIDR_PIDR                   PORT1_PIDR_PIDR
#define PORT2_PIDR_PIDR_MASK              PORT1_PIDR_PIDR_MASK
#define PORT2_PCNTR3_OFFSET               PORT1_PCNTR3_OFFSET
#define PORT2_PCNTR3                      PORT1_PCNTR3
#define PORT2_PCNTR3_PORR                 PORT1_PCNTR3_PORR
#define PORT2_PCNTR3_PORR_MASK            PORT1_PCNTR3_PORR_MASK
#define PORT2_PCNTR3_POSR                 PORT1_PCNTR3_POSR
#define PORT2_PCNTR3_POSR_MASK            PORT1_PCNTR3_POSR_MASK
#define PORT2_PORR_OFFSET                 PORT1_PORR_OFFSET
#define PORT2_PORR                        PORT1_PORR
#define PORT2_PORR_PORR                   PORT1_PORR_PORR
#define PORT2_PORR_PORR_MASK              PORT1_PORR_PORR_MASK
#define PORT2_POSR_OFFSET                 PORT1_POSR_OFFSET
#define PORT2_POSR                        PORT1_POSR
#define PORT2_POSR_POSR                   PORT1_POSR_POSR
#define PORT2_POSR_POSR_MASK              PORT1_POSR_POSR_MASK
#define PORT2_PCNTR4_OFFSET               PORT1_PCNTR4_OFFSET
#define PORT2_PCNTR4                      PORT1_PCNTR4
#define PORT2_PCNTR4_EORR                 PORT1_PCNTR4_EORR
#define PORT2_PCNTR4_EORR_MASK            PORT1_PCNTR4_EORR_MASK
#define PORT2_PCNTR4_EOSR                 PORT1_PCNTR4_EOSR
#define PORT2_PCNTR4_EOSR_MASK            PORT1_PCNTR4_EOSR_MASK
#define PORT2_EORR_OFFSET                 PORT1_EORR_OFFSET
#define PORT2_EORR                        PORT1_EORR
#define PORT2_EORR_EORR                   PORT1_EORR_EORR
#define PORT2_EORR_EORR_MASK              PORT1_EORR_EORR_MASK
#define PORT2_EOSR_OFFSET                 PORT1_EOSR_OFFSET
#define PORT2_EOSR                        PORT1_EOSR
#define PORT2_EOSR_EOSR                   PORT1_EOSR_EOSR
#define PORT2_EOSR_EOSR_MASK              PORT1_EOSR_EOSR_MASK

