leocafonso/svdtoheaders/demo/h/ra4m1_reg.h
/* No registers defined for peripheral PORT3. Using those of PORT1. */
#define PORT3_BASE                        0x40040060
#define PORT3_PCNTR1_OFFSET               PORT1_PCNTR1_OFFSET
#define PORT3_PCNTR1                      PORT1_PCNTR1
#define PORT3_PCNTR1_PODR                 PORT1_PCNTR1_PODR
#define PORT3_PCNTR1_PODR_MASK            PORT1_PCNTR1_PODR_MASK
#define PORT3_PCNTR1_PDR                  PORT1_PCNTR1_PDR
#define PORT3_PCNTR1_PDR_MASK             PORT1_PCNTR1_PDR_MASK
#define PORT3_PODR_OFFSET                 PORT1_PODR_OFFSET
#define PORT3_PODR                        PORT1_PODR
#define PORT3_PODR_PODR                   PORT1_PODR_PODR
#define PORT3_PODR_PODR_MASK              PORT1_PODR_PODR_MASK
#define PORT3_PDR_OFFSET                  PORT1_PDR_OFFSET
#define PORT3_PDR                         PORT1_PDR
#define PORT3_PDR_PDR                     PORT1_PDR_PDR
#define PORT3_PDR_PDR_MASK                PORT1_PDR_PDR_MASK
#define PORT3_PCNTR2_OFFSET               PORT1_PCNTR2_OFFSET
#define PORT3_PCNTR2                      PORT1_PCNTR2
#define PORT3_PCNTR2_EIDR                 PORT1_PCNTR2_EIDR
#define PORT3_PCNTR2_EIDR_MASK            PORT1_PCNTR2_EIDR_MASK
#define PORT3_PCNTR2_PIDR                 PORT1_PCNTR2_PIDR
#define PORT3_PCNTR2_PIDR_MASK            PORT1_PCNTR2_PIDR_MASK
#define PORT3_EIDR_OFFSET                 PORT1_EIDR_OFFSET
#define PORT3_EIDR                        PORT1_EIDR
#define PORT3_EIDR_EIDR                   PORT1_EIDR_EIDR
#define PORT3_EIDR_EIDR_MASK              PORT1_EIDR_EIDR_MASK
#define PORT3_PIDR_OFFSET                 PORT1_PIDR_OFFSET
#define PORT3_PIDR                        PORT1_PIDR
#define PORT3_PIDR_PIDR                   PORT1_PIDR_PIDR
#define PORT3_PIDR_PIDR_MASK              PORT1_PIDR_PIDR_MASK
#define PORT3_PCNTR3_OFFSET               PORT1_PCNTR3_OFFSET
#define PORT3_PCNTR3                      PORT1_PCNTR3
#define PORT3_PCNTR3_PORR                 PORT1_PCNTR3_PORR
#define PORT3_PCNTR3_PORR_MASK            PORT1_PCNTR3_PORR_MASK
#define PORT3_PCNTR3_POSR                 PORT1_PCNTR3_POSR
#define PORT3_PCNTR3_POSR_MASK            PORT1_PCNTR3_POSR_MASK
#define PORT3_PORR_OFFSET                 PORT1_PORR_OFFSET
#define PORT3_PORR                        PORT1_PORR
#define PORT3_PORR_PORR                   PORT1_PORR_PORR
#define PORT3_PORR_PORR_MASK              PORT1_PORR_PORR_MASK
#define PORT3_POSR_OFFSET                 PORT1_POSR_OFFSET
#define PORT3_POSR                        PORT1_POSR
#define PORT3_POSR_POSR                   PORT1_POSR_POSR
#define PORT3_POSR_POSR_MASK              PORT1_POSR_POSR_MASK
#define PORT3_PCNTR4_OFFSET               PORT1_PCNTR4_OFFSET
#define PORT3_PCNTR4                      PORT1_PCNTR4
#define PORT3_PCNTR4_EORR                 PORT1_PCNTR4_EORR
#define PORT3_PCNTR4_EORR_MASK            PORT1_PCNTR4_EORR_MASK
#define PORT3_PCNTR4_EOSR                 PORT1_PCNTR4_EOSR
#define PORT3_PCNTR4_EOSR_MASK            PORT1_PCNTR4_EOSR_MASK
#define PORT3_EORR_OFFSET                 PORT1_EORR_OFFSET
#define PORT3_EORR                        PORT1_EORR
#define PORT3_EORR_EORR                   PORT1_EORR_EORR
#define PORT3_EORR_EORR_MASK              PORT1_EORR_EORR_MASK
#define PORT3_EOSR_OFFSET                 PORT1_EOSR_OFFSET
#define PORT3_EOSR                        PORT1_EOSR
#define PORT3_EOSR_EOSR                   PORT1_EOSR_EOSR
#define PORT3_EOSR_EOSR_MASK              PORT1_EOSR_EOSR_MASK

/* No registers defined for peripheral PORT4. Using those of PORT1. */
#define PORT4_BASE                        0x40040080
#define PORT4_PCNTR1_OFFSET               PORT1_PCNTR1_OFFSET
#define PORT4_PCNTR1                      PORT1_PCNTR1
#define PORT4_PCNTR1_PODR                 PORT1_PCNTR1_PODR
#define PORT4_PCNTR1_PODR_MASK            PORT1_PCNTR1_PODR_MASK
#define PORT4_PCNTR1_PDR                  PORT1_PCNTR1_PDR
#define PORT4_PCNTR1_PDR_MASK             PORT1_PCNTR1_PDR_MASK
#define PORT4_PODR_OFFSET                 PORT1_PODR_OFFSET
#define PORT4_PODR                        PORT1_PODR
#define PORT4_PODR_PODR                   PORT1_PODR_PODR
#define PORT4_PODR_PODR_MASK              PORT1_PODR_PODR_MASK
#define PORT4_PDR_OFFSET                  PORT1_PDR_OFFSET
#define PORT4_PDR                         PORT1_PDR
#define PORT4_PDR_PDR                     PORT1_PDR_PDR
#define PORT4_PDR_PDR_MASK                PORT1_PDR_PDR_MASK
#define PORT4_PCNTR2_OFFSET               PORT1_PCNTR2_OFFSET
#define PORT4_PCNTR2                      PORT1_PCNTR2
#define PORT4_PCNTR2_EIDR                 PORT1_PCNTR2_EIDR
#define PORT4_PCNTR2_EIDR_MASK            PORT1_PCNTR2_EIDR_MASK
#define PORT4_PCNTR2_PIDR                 PORT1_PCNTR2_PIDR
#define PORT4_PCNTR2_PIDR_MASK            PORT1_PCNTR2_PIDR_MASK
#define PORT4_EIDR_OFFSET                 PORT1_EIDR_OFFSET
#define PORT4_EIDR                        PORT1_EIDR
#define PORT4_EIDR_EIDR                   PORT1_EIDR_EIDR
#define PORT4_EIDR_EIDR_MASK              PORT1_EIDR_EIDR_MASK
#define PORT4_PIDR_OFFSET                 PORT1_PIDR_OFFSET
#define PORT4_PIDR                        PORT1_PIDR
#define PORT4_PIDR_PIDR                   PORT1_PIDR_PIDR
#define PORT4_PIDR_PIDR_MASK              PORT1_PIDR_PIDR_MASK
#define PORT4_PCNTR3_OFFSET               PORT1_PCNTR3_OFFSET
#define PORT4_PCNTR3                      PORT1_PCNTR3
#define PORT4_PCNTR3_PORR                 PORT1_PCNTR3_PORR
#define PORT4_PCNTR3_PORR_MASK            PORT1_PCNTR3_PORR_MASK
#define PORT4_PCNTR3_POSR                 PORT1_PCNTR3_POSR
#define PORT4_PCNTR3_POSR_MASK            PORT1_PCNTR3_POSR_MASK
#define PORT4_PORR_OFFSET                 PORT1_PORR_OFFSET
#define PORT4_PORR                        PORT1_PORR
#define PORT4_PORR_PORR                   PORT1_PORR_PORR
#define PORT4_PORR_PORR_MASK              PORT1_PORR_PORR_MASK
#define PORT4_POSR_OFFSET                 PORT1_POSR_OFFSET
#define PORT4_POSR                        PORT1_POSR
#define PORT4_POSR_POSR                   PORT1_POSR_POSR
#define PORT4_POSR_POSR_MASK              PORT1_POSR_POSR_MASK
#define PORT4_PCNTR4_OFFSET               PORT1_PCNTR4_OFFSET
#define PORT4_PCNTR4                      PORT1_PCNTR4
#define PORT4_PCNTR4_EORR                 PORT1_PCNTR4_EORR
#define PORT4_PCNTR4_EORR_MASK            PORT1_PCNTR4_EORR_MASK
#define PORT4_PCNTR4_EOSR                 PORT1_PCNTR4_EOSR
#define PORT4_PCNTR4_EOSR_MASK            PORT1_PCNTR4_EOSR_MASK
#define PORT4_EORR_OFFSET                 PORT1_EORR_OFFSET
#define PORT4_EORR                        PORT1_EORR
#define PORT4_EORR_EORR                   PORT1_EORR_EORR
#define PORT4_EORR_EORR_MASK              PORT1_EORR_EORR_MASK
#define PORT4_EOSR_OFFSET                 PORT1_EOSR_OFFSET
#define PORT4_EOSR                        PORT1_EOSR
#define PORT4_EOSR_EOSR                   PORT1_EOSR_EOSR
#define PORT4_EOSR_EOSR_MASK              PORT1_EOSR_EOSR_MASK

