leocafonso/svdtoheaders/demo/h/ra4m1_reg.h
/* No registers defined for peripheral PORT5. Using those of PORT0. */
#define PORT5_BASE                        0x400400a0
#define PORT5_PCNTR1_OFFSET               PORT0_PCNTR1_OFFSET
#define PORT5_PCNTR1                      PORT0_PCNTR1
#define PORT5_PCNTR1_PODR                 PORT0_PCNTR1_PODR
#define PORT5_PCNTR1_PODR_MASK            PORT0_PCNTR1_PODR_MASK
#define PORT5_PCNTR1_PDR                  PORT0_PCNTR1_PDR
#define PORT5_PCNTR1_PDR_MASK             PORT0_PCNTR1_PDR_MASK
#define PORT5_PODR_OFFSET                 PORT0_PODR_OFFSET
#define PORT5_PODR                        PORT0_PODR
#define PORT5_PODR_PODR                   PORT0_PODR_PODR
#define PORT5_PODR_PODR_MASK              PORT0_PODR_PODR_MASK
#define PORT5_PDR_OFFSET                  PORT0_PDR_OFFSET
#define PORT5_PDR                         PORT0_PDR
#define PORT5_PDR_PDR                     PORT0_PDR_PDR
#define PORT5_PDR_PDR_MASK                PORT0_PDR_PDR_MASK
#define PORT5_PCNTR2_OFFSET               PORT0_PCNTR2_OFFSET
#define PORT5_PCNTR2                      PORT0_PCNTR2
#define PORT5_PCNTR2_PIDR                 PORT0_PCNTR2_PIDR
#define PORT5_PCNTR2_PIDR_MASK            PORT0_PCNTR2_PIDR_MASK
#define PORT5_PIDR_OFFSET                 PORT0_PIDR_OFFSET
#define PORT5_PIDR                        PORT0_PIDR
#define PORT5_PIDR_PIDR                   PORT0_PIDR_PIDR
#define PORT5_PIDR_PIDR_MASK              PORT0_PIDR_PIDR_MASK
#define PORT5_PCNTR3_OFFSET               PORT0_PCNTR3_OFFSET
#define PORT5_PCNTR3                      PORT0_PCNTR3
#define PORT5_PCNTR3_PORR                 PORT0_PCNTR3_PORR
#define PORT5_PCNTR3_PORR_MASK            PORT0_PCNTR3_PORR_MASK
#define PORT5_PCNTR3_POSR                 PORT0_PCNTR3_POSR
#define PORT5_PCNTR3_POSR_MASK            PORT0_PCNTR3_POSR_MASK
#define PORT5_PORR_OFFSET                 PORT0_PORR_OFFSET
#define PORT5_PORR                        PORT0_PORR
#define PORT5_PORR_PORR                   PORT0_PORR_PORR
#define PORT5_PORR_PORR_MASK              PORT0_PORR_PORR_MASK
#define PORT5_POSR_OFFSET                 PORT0_POSR_OFFSET
#define PORT5_POSR                        PORT0_POSR
#define PORT5_POSR_POSR                   PORT0_POSR_POSR
#define PORT5_POSR_POSR_MASK              PORT0_POSR_POSR_MASK

/* No registers defined for peripheral PORT6. Using those of PORT0. */
#define PORT6_BASE                        0x400400c0
#define PORT6_PCNTR1_OFFSET               PORT0_PCNTR1_OFFSET
#define PORT6_PCNTR1                      PORT0_PCNTR1
#define PORT6_PCNTR1_PODR                 PORT0_PCNTR1_PODR
#define PORT6_PCNTR1_PODR_MASK            PORT0_PCNTR1_PODR_MASK
#define PORT6_PCNTR1_PDR                  PORT0_PCNTR1_PDR
#define PORT6_PCNTR1_PDR_MASK             PORT0_PCNTR1_PDR_MASK
#define PORT6_PODR_OFFSET                 PORT0_PODR_OFFSET
#define PORT6_PODR                        PORT0_PODR
#define PORT6_PODR_PODR                   PORT0_PODR_PODR
#define PORT6_PODR_PODR_MASK              PORT0_PODR_PODR_MASK
#define PORT6_PDR_OFFSET                  PORT0_PDR_OFFSET
#define PORT6_PDR                         PORT0_PDR
#define PORT6_PDR_PDR                     PORT0_PDR_PDR
#define PORT6_PDR_PDR_MASK                PORT0_PDR_PDR_MASK
#define PORT6_PCNTR2_OFFSET               PORT0_PCNTR2_OFFSET
#define PORT6_PCNTR2                      PORT0_PCNTR2
#define PORT6_PCNTR2_PIDR                 PORT0_PCNTR2_PIDR
#define PORT6_PCNTR2_PIDR_MASK            PORT0_PCNTR2_PIDR_MASK
#define PORT6_PIDR_OFFSET                 PORT0_PIDR_OFFSET
#define PORT6_PIDR                        PORT0_PIDR
#define PORT6_PIDR_PIDR                   PORT0_PIDR_PIDR
#define PORT6_PIDR_PIDR_MASK              PORT0_PIDR_PIDR_MASK
#define PORT6_PCNTR3_OFFSET               PORT0_PCNTR3_OFFSET
#define PORT6_PCNTR3                      PORT0_PCNTR3
#define PORT6_PCNTR3_PORR                 PORT0_PCNTR3_PORR
#define PORT6_PCNTR3_PORR_MASK            PORT0_PCNTR3_PORR_MASK
#define PORT6_PCNTR3_POSR                 PORT0_PCNTR3_POSR
#define PORT6_PCNTR3_POSR_MASK            PORT0_PCNTR3_POSR_MASK
#define PORT6_PORR_OFFSET                 PORT0_PORR_OFFSET
#define PORT6_PORR                        PORT0_PORR
#define PORT6_PORR_PORR                   PORT0_PORR_PORR
#define PORT6_PORR_PORR_MASK              PORT0_PORR_PORR_MASK
#define PORT6_POSR_OFFSET                 PORT0_POSR_OFFSET
#define PORT6_POSR                        PORT0_POSR
#define PORT6_POSR_POSR                   PORT0_POSR_POSR
#define PORT6_POSR_POSR_MASK              PORT0_POSR_POSR_MASK

/* No registers defined for peripheral PORT7. Using those of PORT0. */
#define PORT7_BASE                        0x400400e0
#define PORT7_PCNTR1_OFFSET               PORT0_PCNTR1_OFFSET
#define PORT7_PCNTR1                      PORT0_PCNTR1
#define PORT7_PCNTR1_PODR                 PORT0_PCNTR1_PODR
#define PORT7_PCNTR1_PODR_MASK            PORT0_PCNTR1_PODR_MASK
#define PORT7_PCNTR1_PDR                  PORT0_PCNTR1_PDR
#define PORT7_PCNTR1_PDR_MASK             PORT0_PCNTR1_PDR_MASK
#define PORT7_PODR_OFFSET                 PORT0_PODR_OFFSET
#define PORT7_PODR                        PORT0_PODR
#define PORT7_PODR_PODR                   PORT0_PODR_PODR
#define PORT7_PODR_PODR_MASK              PORT0_PODR_PODR_MASK
#define PORT7_PDR_OFFSET                  PORT0_PDR_OFFSET
#define PORT7_PDR                         PORT0_PDR
#define PORT7_PDR_PDR                     PORT0_PDR_PDR
#define PORT7_PDR_PDR_MASK                PORT0_PDR_PDR_MASK
#define PORT7_PCNTR2_OFFSET               PORT0_PCNTR2_OFFSET
#define PORT7_PCNTR2                      PORT0_PCNTR2
#define PORT7_PCNTR2_PIDR                 PORT0_PCNTR2_PIDR
#define PORT7_PCNTR2_PIDR_MASK            PORT0_PCNTR2_PIDR_MASK
#define PORT7_PIDR_OFFSET                 PORT0_PIDR_OFFSET
#define PORT7_PIDR                        PORT0_PIDR
#define PORT7_PIDR_PIDR                   PORT0_PIDR_PIDR
#define PORT7_PIDR_PIDR_MASK              PORT0_PIDR_PIDR_MASK
#define PORT7_PCNTR3_OFFSET               PORT0_PCNTR3_OFFSET
#define PORT7_PCNTR3                      PORT0_PCNTR3
#define PORT7_PCNTR3_PORR                 PORT0_PCNTR3_PORR
#define PORT7_PCNTR3_PORR_MASK            PORT0_PCNTR3_PORR_MASK
#define PORT7_PCNTR3_POSR                 PORT0_PCNTR3_POSR
#define PORT7_PCNTR3_POSR_MASK            PORT0_PCNTR3_POSR_MASK
#define PORT7_PORR_OFFSET                 PORT0_PORR_OFFSET
#define PORT7_PORR                        PORT0_PORR
#define PORT7_PORR_PORR                   PORT0_PORR_PORR
#define PORT7_PORR_PORR_MASK              PORT0_PORR_PORR_MASK
#define PORT7_POSR_OFFSET                 PORT0_POSR_OFFSET
#define PORT7_POSR                        PORT0_POSR
#define PORT7_POSR_POSR                   PORT0_POSR_POSR
#define PORT7_POSR_POSR_MASK              PORT0_POSR_POSR_MASK

/* No registers defined for peripheral PORT8. Using those of PORT0. */
#define PORT8_BASE                        0x40040100
#define PORT8_PCNTR1_OFFSET               PORT0_PCNTR1_OFFSET
#define PORT8_PCNTR1                      PORT0_PCNTR1
#define PORT8_PCNTR1_PODR                 PORT0_PCNTR1_PODR
#define PORT8_PCNTR1_PODR_MASK            PORT0_PCNTR1_PODR_MASK
#define PORT8_PCNTR1_PDR                  PORT0_PCNTR1_PDR
#define PORT8_PCNTR1_PDR_MASK             PORT0_PCNTR1_PDR_MASK
#define PORT8_PODR_OFFSET                 PORT0_PODR_OFFSET
#define PORT8_PODR                        PORT0_PODR
#define PORT8_PODR_PODR                   PORT0_PODR_PODR
#define PORT8_PODR_PODR_MASK              PORT0_PODR_PODR_MASK
#define PORT8_PDR_OFFSET                  PORT0_PDR_OFFSET
#define PORT8_PDR                         PORT0_PDR
#define PORT8_PDR_PDR                     PORT0_PDR_PDR
#define PORT8_PDR_PDR_MASK                PORT0_PDR_PDR_MASK
#define PORT8_PCNTR2_OFFSET               PORT0_PCNTR2_OFFSET
#define PORT8_PCNTR2                      PORT0_PCNTR2
#define PORT8_PCNTR2_PIDR                 PORT0_PCNTR2_PIDR
#define PORT8_PCNTR2_PIDR_MASK            PORT0_PCNTR2_PIDR_MASK
#define PORT8_PIDR_OFFSET                 PORT0_PIDR_OFFSET
#define PORT8_PIDR                        PORT0_PIDR
#define PORT8_PIDR_PIDR                   PORT0_PIDR_PIDR
#define PORT8_PIDR_PIDR_MASK              PORT0_PIDR_PIDR_MASK
#define PORT8_PCNTR3_OFFSET               PORT0_PCNTR3_OFFSET
#define PORT8_PCNTR3                      PORT0_PCNTR3
#define PORT8_PCNTR3_PORR                 PORT0_PCNTR3_PORR
#define PORT8_PCNTR3_PORR_MASK            PORT0_PCNTR3_PORR_MASK
#define PORT8_PCNTR3_POSR                 PORT0_PCNTR3_POSR
#define PORT8_PCNTR3_POSR_MASK            PORT0_PCNTR3_POSR_MASK
#define PORT8_PORR_OFFSET                 PORT0_PORR_OFFSET
#define PORT8_PORR                        PORT0_PORR
#define PORT8_PORR_PORR                   PORT0_PORR_PORR
#define PORT8_PORR_PORR_MASK              PORT0_PORR_PORR_MASK
#define PORT8_POSR_OFFSET                 PORT0_POSR_OFFSET
#define PORT8_POSR                        PORT0_POSR
#define PORT8_POSR_POSR                   PORT0_POSR_POSR
#define PORT8_POSR_POSR_MASK              PORT0_POSR_POSR_MASK

/* No registers defined for peripheral PORT9. Using those of PORT0. */
#define PORT9_BASE                        0x40040120
#define PORT9_PCNTR1_OFFSET               PORT0_PCNTR1_OFFSET
#define PORT9_PCNTR1                      PORT0_PCNTR1
#define PORT9_PCNTR1_PODR                 PORT0_PCNTR1_PODR
#define PORT9_PCNTR1_PODR_MASK            PORT0_PCNTR1_PODR_MASK
#define PORT9_PCNTR1_PDR                  PORT0_PCNTR1_PDR
#define PORT9_PCNTR1_PDR_MASK             PORT0_PCNTR1_PDR_MASK
#define PORT9_PODR_OFFSET                 PORT0_PODR_OFFSET
#define PORT9_PODR                        PORT0_PODR
#define PORT9_PODR_PODR                   PORT0_PODR_PODR
#define PORT9_PODR_PODR_MASK              PORT0_PODR_PODR_MASK
#define PORT9_PDR_OFFSET                  PORT0_PDR_OFFSET
#define PORT9_PDR                         PORT0_PDR
#define PORT9_PDR_PDR                     PORT0_PDR_PDR
#define PORT9_PDR_PDR_MASK                PORT0_PDR_PDR_MASK
#define PORT9_PCNTR2_OFFSET               PORT0_PCNTR2_OFFSET
#define PORT9_PCNTR2                      PORT0_PCNTR2
#define PORT9_PCNTR2_PIDR                 PORT0_PCNTR2_PIDR
#define PORT9_PCNTR2_PIDR_MASK            PORT0_PCNTR2_PIDR_MASK
#define PORT9_PIDR_OFFSET                 PORT0_PIDR_OFFSET
#define PORT9_PIDR                        PORT0_PIDR
#define PORT9_PIDR_PIDR                   PORT0_PIDR_PIDR
#define PORT9_PIDR_PIDR_MASK              PORT0_PIDR_PIDR_MASK
#define PORT9_PCNTR3_OFFSET               PORT0_PCNTR3_OFFSET
#define PORT9_PCNTR3                      PORT0_PCNTR3
#define PORT9_PCNTR3_PORR                 PORT0_PCNTR3_PORR
#define PORT9_PCNTR3_PORR_MASK            PORT0_PCNTR3_PORR_MASK
#define PORT9_PCNTR3_POSR                 PORT0_PCNTR3_POSR
#define PORT9_PCNTR3_POSR_MASK            PORT0_PCNTR3_POSR_MASK
#define PORT9_PORR_OFFSET                 PORT0_PORR_OFFSET
#define PORT9_PORR                        PORT0_PORR
#define PORT9_PORR_PORR                   PORT0_PORR_PORR
#define PORT9_PORR_PORR_MASK              PORT0_PORR_PORR_MASK
#define PORT9_POSR_OFFSET                 PORT0_POSR_OFFSET
#define PORT9_POSR                        PORT0_POSR
#define PORT9_POSR_POSR                   PORT0_POSR_POSR
#define PORT9_POSR_POSR_MASK              PORT0_POSR_POSR_MASK

