leocafonso/svdtoheaders/demo/h/ra4m1_reg.h
/* PFS - Pmn Pin Function Control Register */
#define PFS_BASE                          0x40040800
#define PFS_P000PFS_OFFSET                0x0000
#define PFS_P000PFS                       (PFS_BASE + PFS_P000PFS_OFFSET)
#define PFS_P000PFS_PSEL                  (5 << 24) /* 1000000: Port Function Select These bits select the peripheral function. For individual pin functions, see the MPC table */
#define PFS_P000PFS_PSEL_MASK                  (0x1f)
#define PFS_P000PFS_PMR                   (1 << 16) /* 10000: Port Mode Control */
#define PFS_P000PFS_ASEL                  (1 << 15) /* 8000: Analog Input enable */
#define PFS_P000PFS_ISEL                  (1 << 14) /* 4000: IRQ input enable */
#define PFS_P000PFS_DSCR                  (1 << 10) /* 400: Port Drive Capability */
#define PFS_P000PFS_NCODR                 (1 <<  6) /* 40: N-Channel Open Drain Control */
#define PFS_P000PFS_PCR                   (1 <<  4) /* 10: Pull-up Control */
#define PFS_P000PFS_PDR                   (1 <<  2) /* 04: Port Direction */
#define PFS_P000PFS_PIDR                  (1 <<  1) /* 02: Port Input Data */
#define PFS_P000PFS_PODR                  (1 <<  0) /* 01: Port Output Data */
#define PFS_P000PFS_HA_OFFSET             0x0002
#define PFS_P000PFS_HA                    (PFS_BASE + PFS_P000PFS_HA_OFFSET)
#define PFS_P000PFS_HA_ASEL               (1 << 15) /* 8000: Analog Input enable */
#define PFS_P000PFS_HA_ISEL               (1 << 14) /* 4000: IRQ input enable */
#define PFS_P000PFS_HA_DSCR               (1 << 10) /* 400: Port Drive Capability */
#define PFS_P000PFS_HA_NCODR              (1 <<  6) /* 40: N-Channel Open Drain Control */
#define PFS_P000PFS_HA_PCR                (1 <<  4) /* 10: Pull-up Control */
#define PFS_P000PFS_HA_PDR                (1 <<  2) /* 04: Port Direction */
#define PFS_P000PFS_HA_PIDR               (1 <<  1) /* 02: Port Input Data */
#define PFS_P000PFS_HA_PODR               (1 <<  0) /* 01: Port Output Data */
#define PFS_P000PFS_BY_OFFSET             0x0003
#define PFS_P000PFS_BY                    (PFS_BASE + PFS_P000PFS_BY_OFFSET)
#define PFS_P000PFS_BY_NCODR              (1 <<  6) /* 40: N-Channel Open Drain Control */
#define PFS_P000PFS_BY_PCR                (1 <<  4) /* 10: Pull-up Control */
#define PFS_P000PFS_BY_PDR                (1 <<  2) /* 04: Port Direction */
#define PFS_P000PFS_BY_PIDR               (1 <<  1) /* 02: Port Input Data */
#define PFS_P000PFS_BY_PODR               (1 <<  0) /* 01: Port Output Data */
#define PFS_P00PFS_SIZE                   8
#define PFS_P00PFS_OFFSET                 0x0004
#define PFS_P00PFS(p)                     (PFS_BASE + PFS_P00PFS_OFFSET + (p)*0x0004)
#define PFS_P00PFS_HA_SIZE                8
#define PFS_P00PFS_HA_OFFSET              0x0006
#define PFS_P00PFS_HA(p)                  (PFS_BASE + PFS_P00PFS_HA_OFFSET + (p)*0x0004)
#define PFS_P00PFS_BY_SIZE                8
#define PFS_P00PFS_BY_OFFSET              0x0007
#define PFS_P00PFS_BY(p)                  (PFS_BASE + PFS_P00PFS_BY_OFFSET + (p)*0x0004)
#define PFS_P0PFS_SIZE                    6
#define PFS_P0PFS_OFFSET                  0x0028
#define PFS_P0PFS(p)                      (PFS_BASE + PFS_P0PFS_OFFSET + (p)*0x0004)
#define PFS_P0PFS_HA_SIZE                 6
#define PFS_P0PFS_HA_OFFSET               0x002a
#define PFS_P0PFS_HA(p)                   (PFS_BASE + PFS_P0PFS_HA_OFFSET + (p)*0x0004)
#define PFS_P0PFS_BY_SIZE                 6
#define PFS_P0PFS_BY_OFFSET               0x002b
#define PFS_P0PFS_BY(p)                   (PFS_BASE + PFS_P0PFS_BY_OFFSET + (p)*0x0004)
#define PFS_P10PFS_SIZE                   8
#define PFS_P10PFS_OFFSET                 0x0040
#define PFS_P10PFS(p)                     (PFS_BASE + PFS_P10PFS_OFFSET + (p)*0x0004)
#define PFS_P10PFS_HA_SIZE                8
#define PFS_P10PFS_HA_OFFSET              0x0042
#define PFS_P10PFS_HA(p)                  (PFS_BASE + PFS_P10PFS_HA_OFFSET + (p)*0x0004)
#define PFS_P10PFS_BY_SIZE                8
#define PFS_P10PFS_BY_OFFSET              0x0043
#define PFS_P10PFS_BY(p)                  (PFS_BASE + PFS_P10PFS_BY_OFFSET + (p)*0x0004)
#define PFS_P108PFS_OFFSET                0x0060
#define PFS_P108PFS                       (PFS_BASE + PFS_P108PFS_OFFSET)
#define PFS_P108PFS_PSEL                  (5 << 24) /* 1000000: Port Function Select These bits select the peripheral function. For individual pin functions, see the setting table. */
#define PFS_P108PFS_PSEL_MASK                  (0x1f)
#define PFS_P108PFS_PMR                   (1 << 16) /* 10000: Port Mode Control */
#define PFS_P108PFS_ASEL                  (1 << 15) /* 8000: Analog Input enable */
#define PFS_P108PFS_ISEL                  (1 << 14) /* 4000: IRQ input enable */
#define PFS_P108PFS_EOF                   (1 << 13) /* 2000: Event on Failing */
#define PFS_P108PFS_EOR                   (1 << 12) /* 1000: Event on Rising */
#define PFS_P108PFS_DSCR                  (1 << 10) /* 400: Port Drive Capability */
#define PFS_P108PFS_NCODR                 (1 <<  6) /* 40: N-Channel Open Drain Control */
#define PFS_P108PFS_PCR                   (1 <<  4) /* 10: Pull-up Control */
#define PFS_P108PFS_PDR                   (1 <<  2) /* 04: Port Direction */
#define PFS_P108PFS_PIDR                  (1 <<  1) /* 02: Port Input Data */
#define PFS_P108PFS_PODR                  (1 <<  0) /* 01: Port Output Data */
#define PFS_P108PFS_HA_OFFSET             0x0062
#define PFS_P108PFS_HA                    (PFS_BASE + PFS_P108PFS_HA_OFFSET)
#define PFS_P108PFS_HA_ASEL               (1 << 15) /* 8000: Analog Input enable */
#define PFS_P108PFS_HA_ISEL               (1 << 14) /* 4000: IRQ input enable */
#define PFS_P108PFS_HA_EOF                (1 << 13) /* 2000: Event on Failing */
#define PFS_P108PFS_HA_EOR                (1 << 12) /* 1000: Event on Rising */
#define PFS_P108PFS_HA_DSCR               (1 << 10) /* 400: Port Drive Capability */
#define PFS_P108PFS_HA_NCODR              (1 <<  6) /* 40: N-Channel Open Drain Control */
#define PFS_P108PFS_HA_PCR                (1 <<  4) /* 10: Pull-up Control */
#define PFS_P108PFS_HA_PDR                (1 <<  2) /* 04: Port Direction */
#define PFS_P108PFS_HA_PIDR               (1 <<  1) /* 02: Port Input Data */
#define PFS_P108PFS_HA_PODR               (1 <<  0) /* 01: Port Output Data */
#define PFS_P108PFS_BY_OFFSET             0x0063
#define PFS_P108PFS_BY                    (PFS_BASE + PFS_P108PFS_BY_OFFSET)
#define PFS_P108PFS_BY_NCODR              (1 <<  6) /* 40: N-Channel Open Drain Control */
#define PFS_P108PFS_BY_PCR                (1 <<  4) /* 10: Pull-up Control */
#define PFS_P108PFS_BY_PDR                (1 <<  2) /* 04: Port Direction */
#define PFS_P108PFS_BY_PIDR               (1 <<  1) /* 02: Port Input Data */
#define PFS_P108PFS_BY_PODR               (1 <<  0) /* 01: Port Output Data */
#define PFS_P109PFS_OFFSET                0x0064
#define PFS_P109PFS                       (PFS_BASE + PFS_P109PFS_OFFSET)
#define PFS_P109PFS_PSEL                  (5 << 24) /* 1000000: Port Function Select These bits select the peripheral function. For individual pin functions, see the setting table. */
#define PFS_P109PFS_PSEL_MASK                  (0x1f)
#define PFS_P109PFS_PMR                   (1 << 16) /* 10000: Port Mode Control */
#define PFS_P109PFS_ASEL                  (1 << 15) /* 8000: Analog Input enable */
#define PFS_P109PFS_ISEL                  (1 << 14) /* 4000: IRQ input enable */
#define PFS_P109PFS_EOF                   (1 << 13) /* 2000: Event on Failing */
#define PFS_P109PFS_EOR                   (1 << 12) /* 1000: Event on Rising */
#define PFS_P109PFS_DSCR                  (1 << 10) /* 400: Port Drive Capability */
#define PFS_P109PFS_NCODR                 (1 <<  6) /* 40: N-Channel Open Drain Control */
#define PFS_P109PFS_PCR                   (1 <<  4) /* 10: Pull-up Control */
#define PFS_P109PFS_PDR                   (1 <<  2) /* 04: Port Direction */
#define PFS_P109PFS_PIDR                  (1 <<  1) /* 02: Port Input Data */
#define PFS_P109PFS_PODR                  (1 <<  0) /* 01: Port Output Data */
#define PFS_P109PFS_HA_OFFSET             0x0066
#define PFS_P109PFS_HA                    (PFS_BASE + PFS_P109PFS_HA_OFFSET)
#define PFS_P109PFS_HA_ASEL               (1 << 15) /* 8000: Analog Input enable */
#define PFS_P109PFS_HA_ISEL               (1 << 14) /* 4000: IRQ input enable */
#define PFS_P109PFS_HA_EOF                (1 << 13) /* 2000: Event on Failing */
#define PFS_P109PFS_HA_EOR                (1 << 12) /* 1000: Event on Rising */
#define PFS_P109PFS_HA_DSCR               (1 << 10) /* 400: Port Drive Capability */
#define PFS_P109PFS_HA_NCODR              (1 <<  6) /* 40: N-Channel Open Drain Control */
#define PFS_P109PFS_HA_PCR                (1 <<  4) /* 10: Pull-up Control */
#define PFS_P109PFS_HA_PDR                (1 <<  2) /* 04: Port Direction */
#define PFS_P109PFS_HA_PIDR               (1 <<  1) /* 02: Port Input Data */
#define PFS_P109PFS_HA_PODR               (1 <<  0) /* 01: Port Output Data */
#define PFS_P109PFS_BY_OFFSET             0x0067
#define PFS_P109PFS_BY                    (PFS_BASE + PFS_P109PFS_BY_OFFSET)
#define PFS_P109PFS_BY_NCODR              (1 <<  6) /* 40: N-Channel Open Drain Control */
#define PFS_P109PFS_BY_PCR                (1 <<  4) /* 10: Pull-up Control */
#define PFS_P109PFS_BY_PDR                (1 <<  2) /* 04: Port Direction */
#define PFS_P109PFS_BY_PIDR               (1 <<  1) /* 02: Port Input Data */
#define PFS_P109PFS_BY_PODR               (1 <<  0) /* 01: Port Output Data */
#define PFS_P110PFS_OFFSET                0x0068
#define PFS_P110PFS                       (PFS_BASE + PFS_P110PFS_OFFSET)
#define PFS_P110PFS_HA_OFFSET             0x006a
#define PFS_P110PFS_HA                    (PFS_BASE + PFS_P110PFS_HA_OFFSET)
#define PFS_P110PFS_BY_OFFSET             0x006b
#define PFS_P110PFS_BY                    (PFS_BASE + PFS_P110PFS_BY_OFFSET)
#define PFS_P1PFS_SIZE                    5
#define PFS_P1PFS_OFFSET                  0x006c
#define PFS_P1PFS(p)                      (PFS_BASE + PFS_P1PFS_OFFSET + (p)*0x0004)
#define PFS_P1PFS_HA_SIZE                 5
#define PFS_P1PFS_HA_OFFSET               0x006e
#define PFS_P1PFS_HA(p)                   (PFS_BASE + PFS_P1PFS_HA_OFFSET + (p)*0x0004)
#define PFS_P1PFS_BY_SIZE                 5
#define PFS_P1PFS_BY_OFFSET               0x006f
#define PFS_P1PFS_BY(p)                   (PFS_BASE + PFS_P1PFS_BY_OFFSET + (p)*0x0004)
#define PFS_P200PFS_OFFSET                0x0080
#define PFS_P200PFS                       (PFS_BASE + PFS_P200PFS_OFFSET)
#define PFS_P200PFS_HA_OFFSET             0x0082
#define PFS_P200PFS_HA                    (PFS_BASE + PFS_P200PFS_HA_OFFSET)
#define PFS_P200PFS_BY_OFFSET             0x0083
#define PFS_P200PFS_BY                    (PFS_BASE + PFS_P200PFS_BY_OFFSET)
#define PFS_P201PFS_OFFSET                0x0084
#define PFS_P201PFS                       (PFS_BASE + PFS_P201PFS_OFFSET)
#define PFS_P201PFS_PSEL                  (5 << 24) /* 1000000: Port Function Select These bits select the peripheral function. For individual pin functions, see the setting table. */
#define PFS_P201PFS_PSEL_MASK                  (0x1f)
#define PFS_P201PFS_PMR                   (1 << 16) /* 10000: Port Mode Control */
#define PFS_P201PFS_ASEL                  (1 << 15) /* 8000: Analog Input enable */
#define PFS_P201PFS_ISEL                  (1 << 14) /* 4000: IRQ input enable */
#define PFS_P201PFS_EOF                   (1 << 13) /* 2000: Event on Falling */
#define PFS_P201PFS_EOR                   (1 << 12) /* 1000: Event on Rising */
#define PFS_P201PFS_DSCR                  (1 << 10) /* 400: Drive Strength Control Register */
#define PFS_P201PFS_NCODR                 (1 <<  6) /* 40: N-Channel Open Drain Control */
#define PFS_P201PFS_PCR                   (1 <<  4) /* 10: Pull-up Control */
#define PFS_P201PFS_PDR                   (1 <<  2) /* 04: Port Direction */
#define PFS_P201PFS_PIDR                  (1 <<  1) /* 02: Port Input Data */
#define PFS_P201PFS_PODR                  (1 <<  0) /* 01: Port Output Data */
#define PFS_P201PFS_HA_OFFSET             0x0086
#define PFS_P201PFS_HA                    (PFS_BASE + PFS_P201PFS_HA_OFFSET)
#define PFS_P201PFS_HA_ASEL               (1 << 15) /* 8000: Analog Input enable */
#define PFS_P201PFS_HA_ISEL               (1 << 14) /* 4000: IRQ input enable */
#define PFS_P201PFS_HA_EOF                (1 << 13) /* 2000: Event on Falling */
#define PFS_P201PFS_HA_EOR                (1 << 12) /* 1000: Event on Rising */
#define PFS_P201PFS_HA_DSCR               (1 << 10) /* 400: Drive Strength Control Register */
#define PFS_P201PFS_HA_NCODR              (1 <<  6) /* 40: N-Channel Open Drain Control */
#define PFS_P201PFS_HA_PCR                (1 <<  4) /* 10: Pull-up Control */
#define PFS_P201PFS_HA_PDR                (1 <<  2) /* 04: Port Direction */
#define PFS_P201PFS_HA_PIDR               (1 <<  1) /* 02: Port Input Data */
#define PFS_P201PFS_HA_PODR               (1 <<  0) /* 01: Port Output Data */
#define PFS_P201PFS_BY_OFFSET             0x0087
#define PFS_P201PFS_BY                    (PFS_BASE + PFS_P201PFS_BY_OFFSET)
#define PFS_P201PFS_BY_NCODR              (1 <<  6) /* 40: N-Channel Open Drain Control */
#define PFS_P201PFS_BY_PCR                (1 <<  4) /* 10: Pull-up Control */
#define PFS_P201PFS_BY_PDR                (1 <<  2) /* 04: Port Direction */
#define PFS_P201PFS_BY_PIDR               (1 <<  1) /* 02: Port Input Data */
#define PFS_P201PFS_BY_PODR               (1 <<  0) /* 01: Port Output Data */
#define PFS_P20PFS_SIZE                   5
#define PFS_P20PFS_OFFSET                 0x0088
#define PFS_P20PFS(p)                     (PFS_BASE + PFS_P20PFS_OFFSET + (p)*0x0004)
#define PFS_P20PFS_HA_SIZE                5
#define PFS_P20PFS_HA_OFFSET              0x008a
#define PFS_P20PFS_HA(p)                  (PFS_BASE + PFS_P20PFS_HA_OFFSET + (p)*0x0004)
#define PFS_P20PFS_BY_SIZE                5
#define PFS_P20PFS_BY_OFFSET              0x008b
#define PFS_P20PFS_BY(p)                  (PFS_BASE + PFS_P20PFS_BY_OFFSET + (p)*0x0004)
#define PFS_P2PFS_SIZE                    4
#define PFS_P2PFS_OFFSET                  0x00b0
#define PFS_P2PFS(p)                      (PFS_BASE + PFS_P2PFS_OFFSET + (p)*0x0004)
#define PFS_P2PFS_HA_SIZE                 4
#define PFS_P2PFS_HA_OFFSET               0x00b2
#define PFS_P2PFS_HA(p)                   (PFS_BASE + PFS_P2PFS_HA_OFFSET + (p)*0x0004)
#define PFS_P2PFS_BY_SIZE                 4
#define PFS_P2PFS_BY_OFFSET               0x00b3
#define PFS_P2PFS_BY(p)                   (PFS_BASE + PFS_P2PFS_BY_OFFSET + (p)*0x0004)
#define PFS_P300PFS_OFFSET                0x00c0
#define PFS_P300PFS                       (PFS_BASE + PFS_P300PFS_OFFSET)
#define PFS_P300PFS_HA_OFFSET             0x00c2
#define PFS_P300PFS_HA                    (PFS_BASE + PFS_P300PFS_HA_OFFSET)
#define PFS_P300PFS_BY_OFFSET             0x00c3
#define PFS_P300PFS_BY                    (PFS_BASE + PFS_P300PFS_BY_OFFSET)
#define PFS_P30PFS_SIZE                   7
#define PFS_P30PFS_OFFSET                 0x00c4
#define PFS_P30PFS(p)                     (PFS_BASE + PFS_P30PFS_OFFSET + (p)*0x0004)
#define PFS_P30PFS_HA_SIZE                7
#define PFS_P30PFS_HA_OFFSET              0x00c6
#define PFS_P30PFS_HA(p)                  (PFS_BASE + PFS_P30PFS_HA_OFFSET + (p)*0x0004)
#define PFS_P30PFS_BY_SIZE                7
#define PFS_P30PFS_BY_OFFSET              0x00c7
#define PFS_P30PFS_BY(p)                  (PFS_BASE + PFS_P30PFS_BY_OFFSET + (p)*0x0004)
#define PFS_P40PFS_SIZE                   8
#define PFS_P40PFS_OFFSET                 0x0100
#define PFS_P40PFS(p)                     (PFS_BASE + PFS_P40PFS_OFFSET + (p)*0x0004)
#define PFS_P40PFS_HA_SIZE                8
#define PFS_P40PFS_HA_OFFSET              0x0102
#define PFS_P40PFS_HA(p)                  (PFS_BASE + PFS_P40PFS_HA_OFFSET + (p)*0x0004)
#define PFS_P40PFS_BY_SIZE                8
#define PFS_P40PFS_BY_OFFSET              0x0103
#define PFS_P40PFS_BY(p)                  (PFS_BASE + PFS_P40PFS_BY_OFFSET + (p)*0x0004)
#define PFS_P408PFS_OFFSET                0x0120
#define PFS_P408PFS                       (PFS_BASE + PFS_P408PFS_OFFSET)
#define PFS_P408PFS_PSEL                  (5 << 24) /* 1000000: Port Function Select These bits select the peripheral function. For individual pin functions, see the setting table. */
#define PFS_P408PFS_PSEL_MASK                  (0x1f)
#define PFS_P408PFS_PMR                   (1 << 16) /* 10000: Port Mode Control */
#define PFS_P408PFS_ASEL                  (1 << 15) /* 8000: Analog Input enable */
#define PFS_P408PFS_ISEL                  (1 << 14) /* 4000: IRQ input enable */
#define PFS_P408PFS_EOF                   (1 << 13) /* 2000: Event on Falling */
#define PFS_P408PFS_EOR                   (1 << 12) /* 1000: Event on Rising */
#define PFS_P408PFS_DSCR1                 (1 << 11) /* 800: Drive Strength Control Register */
#define PFS_P408PFS_DSCR                  (1 << 10) /* 400: Drive Strength Control Register */
#define PFS_P408PFS_NCODR                 (1 <<  6) /* 40: N-Channel Open Drain Control */
#define PFS_P408PFS_PCR                   (1 <<  4) /* 10: Pull-up Control */
#define PFS_P408PFS_PDR                   (1 <<  2) /* 04: Port Direction */
#define PFS_P408PFS_PIDR                  (1 <<  1) /* 02: Port Input Data */
#define PFS_P408PFS_PODR                  (1 <<  0) /* 01: Port Output Data */
#define PFS_P408PFS_HA_OFFSET             0x0122
#define PFS_P408PFS_HA                    (PFS_BASE + PFS_P408PFS_HA_OFFSET)
#define PFS_P408PFS_HA_ASEL               (1 << 15) /* 8000: Analog Input enable */
#define PFS_P408PFS_HA_ISEL               (1 << 14) /* 4000: IRQ input enable */
#define PFS_P408PFS_HA_EOF                (1 << 13) /* 2000: Event on Falling */
#define PFS_P408PFS_HA_EOR                (1 << 12) /* 1000: Event on Rising */
#define PFS_P408PFS_HA_DSCR1              (1 << 11) /* 800: Drive Strength Control Register */
#define PFS_P408PFS_HA_DSCR               (1 << 10) /* 400: Drive Strength Control Register */
#define PFS_P408PFS_HA_NCODR              (1 <<  6) /* 40: N-Channel Open Drain Control */
#define PFS_P408PFS_HA_PCR                (1 <<  4) /* 10: Pull-up Control */
#define PFS_P408PFS_HA_PDR                (1 <<  2) /* 04: Port Direction */
#define PFS_P408PFS_HA_PIDR               (1 <<  1) /* 02: Port Input Data */
#define PFS_P408PFS_HA_PODR               (1 <<  0) /* 01: Port Output Data */
#define PFS_P408PFS_BY_OFFSET             0x0123
#define PFS_P408PFS_BY                    (PFS_BASE + PFS_P408PFS_BY_OFFSET)
#define PFS_P408PFS_BY_NCODR              (1 <<  6) /* 40: N-Channel Open Drain Control */
#define PFS_P408PFS_BY_PCR                (1 <<  4) /* 10: Pull-up Control */
#define PFS_P408PFS_BY_PDR                (1 <<  2) /* 04: Port Direction */
#define PFS_P408PFS_BY_PIDR               (1 <<  1) /* 02: Port Input Data */
#define PFS_P408PFS_BY_PODR               (1 <<  0) /* 01: Port Output Data */
#define PFS_P409PFS_OFFSET                0x0124
#define PFS_P409PFS                       (PFS_BASE + PFS_P409PFS_OFFSET)
#define PFS_P409PFS_HA_OFFSET             0x0126
#define PFS_P409PFS_HA                    (PFS_BASE + PFS_P409PFS_HA_OFFSET)
#define PFS_P409PFS_BY_OFFSET             0x0127
#define PFS_P409PFS_BY                    (PFS_BASE + PFS_P409PFS_BY_OFFSET)
#define PFS_P4PFS_SIZE                    6
#define PFS_P4PFS_OFFSET                  0x0128
#define PFS_P4PFS(p)                      (PFS_BASE + PFS_P4PFS_OFFSET + (p)*0x0004)
#define PFS_P4PFS_HA_SIZE                 6
#define PFS_P4PFS_HA_OFFSET               0x012a
#define PFS_P4PFS_HA(p)                   (PFS_BASE + PFS_P4PFS_HA_OFFSET + (p)*0x0004)
#define PFS_P4PFS_BY_SIZE                 6
#define PFS_P4PFS_BY_OFFSET               0x012b
#define PFS_P4PFS_BY(p)                   (PFS_BASE + PFS_P4PFS_BY_OFFSET + (p)*0x0004)
#define PFS_P50PFS_SIZE                   6
#define PFS_P50PFS_OFFSET                 0x0140
#define PFS_P50PFS(p)                     (PFS_BASE + PFS_P50PFS_OFFSET + (p)*0x0004)
#define PFS_P50PFS_HA_SIZE                6
#define PFS_P50PFS_HA_OFFSET              0x0142
#define PFS_P50PFS_HA(p)                  (PFS_BASE + PFS_P50PFS_HA_OFFSET + (p)*0x0004)
#define PFS_P50PFS_BY_SIZE                6
#define PFS_P50PFS_BY_OFFSET              0x0143
#define PFS_P50PFS_BY(p)                  (PFS_BASE + PFS_P50PFS_BY_OFFSET + (p)*0x0004)
#define PFS_P60PFS_SIZE                   4
#define PFS_P60PFS_OFFSET                 0x0180
#define PFS_P60PFS(p)                     (PFS_BASE + PFS_P60PFS_OFFSET + (p)*0x0004)
#define PFS_P60PFS_HA_SIZE                4
#define PFS_P60PFS_HA_OFFSET              0x0182
#define PFS_P60PFS_HA(p)                  (PFS_BASE + PFS_P60PFS_HA_OFFSET + (p)*0x0004)
#define PFS_P60PFS_BY_SIZE                4
#define PFS_P60PFS_BY_OFFSET              0x0183
#define PFS_P60PFS_BY(p)                  (PFS_BASE + PFS_P60PFS_BY_OFFSET + (p)*0x0004)
#define PFS_P60PFS_SIZE                   2
#define PFS_P60PFS_OFFSET                 0x01a0
#define PFS_P60PFS(p)                     (PFS_BASE + PFS_P60PFS_OFFSET + (p)*0x0004)
#define PFS_P60PFS_HA_SIZE                2
#define PFS_P60PFS_HA_OFFSET              0x01a2
#define PFS_P60PFS_HA(p)                  (PFS_BASE + PFS_P60PFS_HA_OFFSET + (p)*0x0004)
#define PFS_P60PFS_BY_SIZE                2
#define PFS_P60PFS_BY_OFFSET              0x01a3
#define PFS_P60PFS_BY(p)                  (PFS_BASE + PFS_P60PFS_BY_OFFSET + (p)*0x0004)
#define PFS_P610PFS_OFFSET                0x01a8
#define PFS_P610PFS                       (PFS_BASE + PFS_P610PFS_OFFSET)
#define PFS_P610PFS_HA_OFFSET             0x01aa
#define PFS_P610PFS_HA                    (PFS_BASE + PFS_P610PFS_HA_OFFSET)
#define PFS_P610PFS_BY_OFFSET             0x01ab
#define PFS_P610PFS_BY                    (PFS_BASE + PFS_P610PFS_BY_OFFSET)
#define PFS_P708PFS_OFFSET                0x01e0
#define PFS_P708PFS                       (PFS_BASE + PFS_P708PFS_OFFSET)
#define PFS_P708PFS_HA_OFFSET             0x01e2
#define PFS_P708PFS_HA                    (PFS_BASE + PFS_P708PFS_HA_OFFSET)
#define PFS_P708PFS_BY_OFFSET             0x01e3
#define PFS_P708PFS_BY                    (PFS_BASE + PFS_P708PFS_BY_OFFSET)
#define PFS_P80PFS_SIZE                   2
#define PFS_P80PFS_OFFSET                 0x0220
#define PFS_P80PFS(p)                     (PFS_BASE + PFS_P80PFS_OFFSET + (p)*0x0004)
#define PFS_P80PFS_HA_SIZE                2
#define PFS_P80PFS_HA_OFFSET              0x0222
#define PFS_P80PFS_HA(p)                  (PFS_BASE + PFS_P80PFS_HA_OFFSET + (p)*0x0004)
#define PFS_P80PFS_BY_SIZE                2
#define PFS_P80PFS_BY_OFFSET              0x0223
#define PFS_P80PFS_BY(p)                  (PFS_BASE + PFS_P80PFS_BY_OFFSET + (p)*0x0004)
#define PFS_P9PFS_SIZE                    2
#define PFS_P9PFS_OFFSET                  0x0278
#define PFS_P9PFS(p)                      (PFS_BASE + PFS_P9PFS_OFFSET + (p)*0x0004)
#define PFS_P9PFS_HA_SIZE                 2
#define PFS_P9PFS_HA_OFFSET               0x027a
#define PFS_P9PFS_HA(p)                   (PFS_BASE + PFS_P9PFS_HA_OFFSET + (p)*0x0004)
#define PFS_P9PFS_BY_SIZE                 2
#define PFS_P9PFS_BY_OFFSET               0x027b
#define PFS_P9PFS_BY(p)                   (PFS_BASE + PFS_P9PFS_BY_OFFSET + (p)*0x0004)

/* PMISC - Miscellaneous Port Control Register */
#define PMISC_BASE                        0x40040d00
#define PMISC_PWPR_OFFSET                 0x0003
#define PMISC_PWPR                        (PMISC_BASE + PMISC_PWPR_OFFSET)
#define PMISC_PWPR_B0WI                   (1 <<  7) /* 80: PFSWE Bit Write Disable */
#define PMISC_PWPR_PFSWE                  (1 <<  6) /* 40: PFS Register Write Enable */

