leocafonso/svdtoheaders/demo/h/ra4m1_reg.h
/* ICU - Interrupt Controller */
#define ICU_BASE                          0x40006000
#define ICU_IRQCR_SIZE                    13
#define ICU_IRQCR_OFFSET                  0x0000
#define ICU_IRQCR(p)                      (ICU_BASE + ICU_IRQCR_OFFSET + (p)*0x0001)
#define ICU_IRQCR_FLTEN                   (1 <<  7) /* 80: IRQ Digital Filter Enable */
#define ICU_IRQCR_FCLKSEL                 (2 <<  4) /* 10: IRQ Digital Filter Sampling Clock Select */
#define ICU_IRQCR_FCLKSEL_MASK                 (0x03)
#define ICU_IRQCR_IRQMD                   (2 <<  0) /* 01: IRQ Detection Sense Select */
#define ICU_IRQCR_IRQMD_MASK                   (0x03)
#define ICU_IRQCR_SIZE                    2
#define ICU_IRQCR_OFFSET                  0x000e
#define ICU_IRQCR(p)                      (ICU_BASE + ICU_IRQCR_OFFSET + (p)*0x0001)
#define ICU_IRQCR_FLTEN                   (1 <<  7) /* 80: IRQ Digital Filter Enable */
#define ICU_IRQCR_FCLKSEL                 (2 <<  4) /* 10: IRQ Digital Filter Sampling Clock Select */
#define ICU_IRQCR_FCLKSEL_MASK                 (0x03)
#define ICU_IRQCR_IRQMD                   (2 <<  0) /* 01: IRQ Detection Sense Select */
#define ICU_IRQCR_IRQMD_MASK                   (0x03)
#define ICU_NMISR_OFFSET                  0x0140
#define ICU_NMISR                         (ICU_BASE + ICU_NMISR_OFFSET)
#define ICU_NMISR_SPEST                   (1 << 12) /* 1000: CPU Stack pointer monitor Interrupt Status Flag */
#define ICU_NMISR_BUSMST                  (1 << 11) /* 800: MPU Bus Master Error Interrupt Status Flag */
#define ICU_NMISR_BUSSST                  (1 << 10) /* 400: MPU Bus Slave Error Interrupt Status Flag */
#define ICU_NMISR_RECCST                  (1 <<  9) /* 200: RAM ECC Error Interrupt Status Flag */
#define ICU_NMISR_RPEST                   (1 <<  8) /* 100: RAM Parity Error Interrupt Status Flag */
#define ICU_NMISR_NMIST                   (1 <<  7) /* 80: NMI Status Flag */
#define ICU_NMISR_OSTST                   (1 <<  6) /* 40: Oscillation Stop Detection Interrupt Status Flag */
#define ICU_NMISR_VBATTST                 (1 <<  4) /* 10: VBATT monitor Interrupt Status Flag */
#define ICU_NMISR_LVD2ST                  (1 <<  3) /* 08: Voltage-Monitoring 2 Interrupt Status Flag */
#define ICU_NMISR_LVD1ST                  (1 <<  2) /* 04: Voltage-Monitoring 1 Interrupt Status Flag */
#define ICU_NMISR_WDTST                   (1 <<  1) /* 02: WDT Underflow/Refresh Error Status Flag */
#define ICU_NMISR_IWDTST                  (1 <<  0) /* 01: IWDT Underflow/Refresh Error Status Flag */
#define ICU_NMIER_OFFSET                  0x0120
#define ICU_NMIER                         (ICU_BASE + ICU_NMIER_OFFSET)
#define ICU_NMIER_SPEEN                   (1 << 12) /* 1000: CPU Stack pointer monitor Interrupt Enable */
#define ICU_NMIER_BUSMEN                  (1 << 11) /* 800: MPU Bus Master Error Interrupt Enable */
#define ICU_NMIER_BUSSEN                  (1 << 10) /* 400: MPU Bus Slave Error Interrupt Enable */
#define ICU_NMIER_RECCEN                  (1 <<  9) /* 200: RAM ECC Error Interrupt Enable */
#define ICU_NMIER_RPEEN                   (1 <<  8) /* 100: RAM Parity Error Interrupt Enable */
#define ICU_NMIER_NMIEN                   (1 <<  7) /* 80: NMI Pin Interrupt Enable */
#define ICU_NMIER_OSTEN                   (1 <<  6) /* 40: Oscillation Stop Detection Interrupt Enable */
#define ICU_NMIER_VBATTEN                 (1 <<  4) /* 10: VBATT monitor Interrupt Enable */
#define ICU_NMIER_LVD2EN                  (1 <<  3) /* 08: Voltage-Monitoring 2 Interrupt Enable */
#define ICU_NMIER_LVD1EN                  (1 <<  2) /* 04: Voltage-Monitoring 1 Interrupt Enable */
#define ICU_NMIER_WDTEN                   (1 <<  1) /* 02: WDT Underflow/Refresh Error Interrupt Enable */
#define ICU_NMIER_IWDTEN                  (1 <<  0) /* 01: IWDT Underflow/Refresh Error Interrupt Enable */
#define ICU_NMICLR_OFFSET                 0x0130
#define ICU_NMICLR                        (ICU_BASE + ICU_NMICLR_OFFSET)
#define ICU_NMICLR_SPECLR                 (1 << 12) /* 1000: CPU Stack Pointer Monitor Interrupt Clear */
#define ICU_NMICLR_BUSMCLR                (1 << 11) /* 800: Bus Master Error Clear */
#define ICU_NMICLR_BUSSCLR                (1 << 10) /* 400: Bus Slave Error Clear */
#define ICU_NMICLR_RECCCLR                (1 <<  9) /* 200: SRAM ECC Error Clear */
#define ICU_NMICLR_RPECLR                 (1 <<  8) /* 100: SRAM Parity Error Clear */
#define ICU_NMICLR_NMICLR                 (1 <<  7) /* 80: NMI Clear */
#define ICU_NMICLR_OSTCLR                 (1 <<  6) /* 40: OST Clear */
#define ICU_NMICLR_VBATTCLR               (1 <<  4) /* 10: VBATT Clear */
#define ICU_NMICLR_LVD2CLR                (1 <<  3) /* 08: LVD2 Clear */
#define ICU_NMICLR_LVD1CLR                (1 <<  2) /* 04: LVD1 Clear */
#define ICU_NMICLR_WDTCLR                 (1 <<  1) /* 02: WDT Clear */
#define ICU_NMICLR_IWDTCLR                (1 <<  0) /* 01: IWDT Clear */
#define ICU_NMICR_OFFSET                  0x0100
#define ICU_NMICR                         (ICU_BASE + ICU_NMICR_OFFSET)
#define ICU_NMICR_NFLTEN                  (1 <<  7) /* 80: NMI Digital Filter Enable */
#define ICU_NMICR_NFCLKSEL                (2 <<  4) /* 10: NMI Digital Filter Sampling Clock Select */
#define ICU_NMICR_NFCLKSEL_MASK                (0x03)
#define ICU_NMICR_NMIMD                   (1 <<  0) /* 01: NMI Detection Set */
#define ICU_IELSR_SIZE                    32
#define ICU_IELSR_OFFSET                  0x0300
#define ICU_IELSR(p)                      (ICU_BASE + ICU_IELSR_OFFSET + (p)*0x0004)
#define ICU_IELSR_DTCE                    (1 << 24) /* 1000000: DTC Activation Enable */
#define ICU_IELSR_IR                      (1 << 16) /* 10000: Interrupt Status Flag */
#define ICU_IELSR_IELS                    (8 <<  0) /* 01: ICU Event selection to NVIC Set the number for the event signal to be linked . */
#define ICU_IELSR_IELS_MASK                    (0xff)
#define ICU_DELSR_SIZE                    4
#define ICU_DELSR_OFFSET                  0x0280
#define ICU_DELSR(p)                      (ICU_BASE + ICU_DELSR_OFFSET + (p)*0x0004)
#define ICU_DELSR_DELS                    (8 <<  0) /* 01: Event selection to DMAC Start request */
#define ICU_DELSR_DELS_MASK                    (0xff)
#define ICU_SELSR0_OFFSET                 0x0200
#define ICU_SELSR0                        (ICU_BASE + ICU_SELSR0_OFFSET)
#define ICU_SELSR0_SELS                   (8 <<  0) /* 01: SYS Event Link Select */
#define ICU_SELSR0_SELS_MASK                   (0xff)
#define ICU_WUPEN_OFFSET                  0x01a0
#define ICU_WUPEN                         (ICU_BASE + ICU_WUPEN_OFFSET)
#define ICU_WUPEN_IIC0WUPEN               (1 << 31) /* 80000000: IIC0 address match interrupt S/W standby returns enable */
#define ICU_WUPEN_AGT1CBWUPEN             (1 << 30) /* 40000000: AGT1 compare match B interrupt S/W standby returns enable */
#define ICU_WUPEN_AGT1CAWUPEN             (1 << 29) /* 20000000: AGT1 compare match A interrupt S/W standby returns enable */
#define ICU_WUPEN_AGT1UDWUPEN             (1 << 28) /* 10000000: AGT1 underflow interrupt S/W standby returns enable */
#define ICU_WUPEN_USBFSWUPEN              (1 << 27) /* 8000000: USBFS interrupt S/W standby returns enable */
#define ICU_WUPEN_RTCPRDWUPEN             (1 << 25) /* 2000000: RCT period interrupt S/W standby returns enable */
#define ICU_WUPEN_RTCALMWUPEN             (1 << 24) /* 1000000: RTC alarm interrupt S/W standby returns enable */
#define ICU_WUPEN_ACMPLP0WUPEN            (1 << 23) /* 800000: ACMPLP0 interrupt S/W standby returns enable */
#define ICU_WUPEN_VBATTWUPEN              (1 << 20) /* 100000: VBATT monitor interrupt S/W standby returns enable */
#define ICU_WUPEN_LVD2WUPEN               (1 << 19) /* 80000: LVD2 interrupt S/W standby returns enable */
#define ICU_WUPEN_LVD1WUPEN               (1 << 18) /* 40000: LVD1 interrupt S/W standby returns enable */
#define ICU_WUPEN_KEYWUPEN                (1 << 17) /* 20000: Key interrupt S/W standby returns enable */
#define ICU_WUPEN_IWDTWUPEN               (1 << 16) /* 10000: IWDT interrupt S/W standby returns enable */
#define ICU_WUPEN_IRQWUPEN15              (1 << 15) /* 8000: IRQ15 interrupt S/W standby returns enable */
#define ICU_WUPEN_IRQWUPEN14              (1 << 14) /* 4000: IRQ14 interrupt S/W standby returns enable */
#define ICU_WUPEN_IRQWUPEN12              (1 << 12) /* 1000: IRQ12 interrupt S/W standby returns enable */
#define ICU_WUPEN_IRQWUPEN11              (1 << 11) /* 800: IRQ11 interrupt S/W standby returns enable */
#define ICU_WUPEN_IRQWUPEN10              (1 << 10) /* 400: IRQ10 interrupt S/W standby returns enable */
#define ICU_WUPEN_IRQWUPEN9               (1 <<  9) /* 200: IRQ9 interrupt S/W standby returns enable */
#define ICU_WUPEN_IRQWUPEN8               (1 <<  8) /* 100: IRQ8 interrupt S/W standby returns enable */
#define ICU_WUPEN_IRQWUPEN7               (1 <<  7) /* 80: IRQ7 interrupt S/W standby returns enable */
#define ICU_WUPEN_IRQWUPEN6               (1 <<  6) /* 40: IRQ6 interrupt S/W standby returns enable */
#define ICU_WUPEN_IRQWUPEN5               (1 <<  5) /* 20: IRQ5 interrupt S/W standby returns enable */
#define ICU_WUPEN_IRQWUPEN4               (1 <<  4) /* 10: IRQ4 interrupt S/W standby returns enable */
#define ICU_WUPEN_IRQWUPEN3               (1 <<  3) /* 08: IRQ3 interrupt S/W standby returns enable */
#define ICU_WUPEN_IRQWUPEN2               (1 <<  2) /* 04: IRQ2 interrupt S/W standby returns enable */
#define ICU_WUPEN_IRQWUPEN1               (1 <<  1) /* 02: IRQ1 interrupt S/W standby returns enable */
#define ICU_WUPEN_IRQWUPEN0               (1 <<  0) /* 01: IRQ0 interrupt S/W standby returns enable */

/* IIC0 - Inter-Integrated Circuit 0 */
#define IIC0_BASE                         0x40053000
#define IIC0_ICCR1_OFFSET                 0x0000
#define IIC0_ICCR1                        (IIC0_BASE + IIC0_ICCR1_OFFSET)
#define IIC0_ICCR1_ICE                    (1 <<  7) /* 80: I2C Bus Interface Enable */
#define IIC0_ICCR1_IICRST                 (1 <<  6) /* 40: I2C Bus Interface Internal Reset Note:If an internal reset is initiated using the IICRST bit for a bus hang-up occurred during communication with the master device in slave mode, the states may become different between the slave device and the master device (due to the difference in the bit counter information). */
#define IIC0_ICCR1_CLO                    (1 <<  5) /* 20: Extra SCL Clock Cycle Output */
#define IIC0_ICCR1_SOWP                   (1 <<  4) /* 10: SCLO/SDAO Write Protect */
#define IIC0_ICCR1_SCLO                   (1 <<  3) /* 08: SCL Output Control/Monitor */
#define IIC0_ICCR1_SDAO                   (1 <<  2) /* 04: SDA Output Control/Monitor */
#define IIC0_ICCR1_SCLI                   (1 <<  1) /* 02: SCL Line Monitor */
#define IIC0_ICCR1_SDAI                   (1 <<  0) /* 01: SDA Line Monitor */
#define IIC0_ICCR2_OFFSET                 0x0001
#define IIC0_ICCR2                        (IIC0_BASE + IIC0_ICCR2_OFFSET)
#define IIC0_ICCR2_BBSY                   (1 <<  7) /* 80: Bus Busy Detection Flag */
#define IIC0_ICCR2_MST                    (1 <<  6) /* 40: Master/Slave Mode */
#define IIC0_ICCR2_TRS                    (1 <<  5) /* 20: Transmit/Receive Mode */
#define IIC0_ICCR2_SP                     (1 <<  3) /* 08: Stop Condition Issuance Request Note: Writing to the SP bit is not possible while the setting of the BBSY flag is 0 (bus free state). Note: Do not set the SP bit to 1 while a restart condition is being issued. */
#define IIC0_ICCR2_RS                     (1 <<  2) /* 04: Restart Condition Issuance Request Note: Do not set the RS bit to 1 while issuing a stop condition. */
#define IIC0_ICCR2_ST                     (1 <<  1) /* 02: Start Condition Issuance Request Set the ST bit to 1 (start condition issuance request) when the BBSY flag is set to 0 (bus free state). */
#define IIC0_ICMR1_OFFSET                 0x0002
#define IIC0_ICMR1                        (IIC0_BASE + IIC0_ICMR1_OFFSET)
#define IIC0_ICMR1_MTWP                   (1 <<  7) /* 80: MST/TRS Write Protect */
#define IIC0_ICMR1_CKS                    (3 <<  4) /* 10: Internal Reference Clock (fIIC) Selection ( fIIC = PCLKB / 2^CKS ) */
#define IIC0_ICMR1_CKS_MASK                    (0x07)
#define IIC0_ICMR1_BCWP                   (1 <<  3) /* 08: BC Write Protect (This bit is read as 1.) */
#define IIC0_ICMR1_BC                     (3 <<  0) /* 01: Bit Counter */
#define IIC0_ICMR1_BC_MASK                     (0x07)
#define IIC0_ICMR2_OFFSET                 0x0003
#define IIC0_ICMR2                        (IIC0_BASE + IIC0_ICMR2_OFFSET)
#define IIC0_ICMR2_DLCS                   (1 <<  7) /* 80: SDA Output Delay Clock Source Select */
#define IIC0_ICMR2_SDDL                   (3 <<  4) /* 10: SDA Output Delay Counter */
#define IIC0_ICMR2_SDDL_MASK                   (0x07)
#define IIC0_ICMR2_TMOH                   (1 <<  2) /* 04: Timeout H Count Control */
#define IIC0_ICMR2_TMOL                   (1 <<  1) /* 02: Timeout L Count Control */
#define IIC0_ICMR2_TMOS                   (1 <<  0) /* 01: Timeout Detection Time Select */
#define IIC0_ICMR3_OFFSET                 0x0004
#define IIC0_ICMR3                        (IIC0_BASE + IIC0_ICMR3_OFFSET)
#define IIC0_ICMR3_SMBS                   (1 <<  7) /* 80: SMBus/I2C Bus Selection */
#define IIC0_ICMR3_WAIT                   (1 <<  6) /* 40: WAIT Note: When the value of the WAIT bit is to be read, be sure to read the ICDRR beforehand. */
#define IIC0_ICMR3_RDRFS                  (1 <<  5) /* 20: RDRF Flag Set Timing Selection */
#define IIC0_ICMR3_ACKWP                  (1 <<  4) /* 10: ACKBT Write Protect */
#define IIC0_ICMR3_ACKBT                  (1 <<  3) /* 08: Transmit Acknowledge */
#define IIC0_ICMR3_ACKBR                  (1 <<  2) /* 04: Receive Acknowledge */
#define IIC0_ICMR3_NF                     (2 <<  0) /* 01: Noise Filter Stage Selection */
#define IIC0_ICMR3_NF_MASK                     (0x03)
#define IIC0_ICFER_OFFSET                 0x0005
#define IIC0_ICFER                        (IIC0_BASE + IIC0_ICFER_OFFSET)
#define IIC0_ICFER_SCLE                   (1 <<  6) /* 40: SCL Synchronous Circuit Enable */
#define IIC0_ICFER_NFE                    (1 <<  5) /* 20: Digital Noise Filter Circuit Enable */
#define IIC0_ICFER_NACKE                  (1 <<  4) /* 10: NACK Reception Transfer Suspension Enable */
#define IIC0_ICFER_SALE                   (1 <<  3) /* 08: Slave Arbitration-Lost Detection Enable */
#define IIC0_ICFER_NALE                   (1 <<  2) /* 04: NACK Transmission Arbitration-Lost Detection Enable */
#define IIC0_ICFER_MALE                   (1 <<  1) /* 02: Master Arbitration-Lost Detection Enable */
#define IIC0_ICFER_TMOE                   (1 <<  0) /* 01: Timeout Function Enable */
#define IIC0_ICSER_OFFSET                 0x0006
#define IIC0_ICSER                        (IIC0_BASE + IIC0_ICSER_OFFSET)
#define IIC0_ICSER_HOAE                   (1 <<  7) /* 80: Host Address Enable */
#define IIC0_ICSER_DIDE                   (1 <<  5) /* 20: Device-ID Address Detection Enable */
#define IIC0_ICSER_GCAE                   (1 <<  3) /* 08: General Call Address Enable */
#define IIC0_ICSER_SAR2E                  (1 <<  2) /* 04: Slave Address Register 2 Enable */
#define IIC0_ICSER_SAR1E                  (1 <<  1) /* 02: Slave Address Register 1 Enable */
#define IIC0_ICSER_SAR0E                  (1 <<  0) /* 01: Slave Address Register 0 Enable */
#define IIC0_ICIER_OFFSET                 0x0007
#define IIC0_ICIER                        (IIC0_BASE + IIC0_ICIER_OFFSET)
#define IIC0_ICIER_TIE                    (1 <<  7) /* 80: Transmit Data Empty Interrupt Request Enable */
#define IIC0_ICIER_TEIE                   (1 <<  6) /* 40: Transmit End Interrupt Request Enable */
#define IIC0_ICIER_RIE                    (1 <<  5) /* 20: Receive Data Full Interrupt Request Enable */
#define IIC0_ICIER_NAKIE                  (1 <<  4) /* 10: NACK Reception Interrupt Request Enable */
#define IIC0_ICIER_SPIE                   (1 <<  3) /* 08: Stop Condition Detection Interrupt Request Enable */
#define IIC0_ICIER_STIE                   (1 <<  2) /* 04: Start Condition Detection Interrupt Request Enable */
#define IIC0_ICIER_ALIE                   (1 <<  1) /* 02: Arbitration-Lost Interrupt Request Enable */
#define IIC0_ICIER_TMOIE                  (1 <<  0) /* 01: Timeout Interrupt Request Enable */
#define IIC0_ICSR1_OFFSET                 0x0008
#define IIC0_ICSR1                        (IIC0_BASE + IIC0_ICSR1_OFFSET)
#define IIC0_ICSR1_HOA                    (1 <<  7) /* 80: Host Address Detection Flag */
#define IIC0_ICSR1_DID                    (1 <<  5) /* 20: Device-ID Address Detection Flag */
#define IIC0_ICSR1_GCA                    (1 <<  3) /* 08: General Call Address Detection Flag */
#define IIC0_ICSR1_AAS2                   (1 <<  2) /* 04: Slave Address 2 Detection Flag */
#define IIC0_ICSR1_AAS1                   (1 <<  1) /* 02: Slave Address 1 Detection Flag */
#define IIC0_ICSR1_AAS0                   (1 <<  0) /* 01: Slave Address 0 Detection Flag */
#define IIC0_ICSR2_OFFSET                 0x0009
#define IIC0_ICSR2                        (IIC0_BASE + IIC0_ICSR2_OFFSET)
#define IIC0_ICSR2_TDRE                   (1 <<  7) /* 80: Transmit Data Empty Flag */
#define IIC0_ICSR2_TEND                   (1 <<  6) /* 40: Transmit End Flag */
#define IIC0_ICSR2_RDRF                   (1 <<  5) /* 20: Receive Data Full Flag */
#define IIC0_ICSR2_NACKF                  (1 <<  4) /* 10: NACK Detection Flag */
#define IIC0_ICSR2_STOP                   (1 <<  3) /* 08: Stop Condition Detection Flag */
#define IIC0_ICSR2_START                  (1 <<  2) /* 04: Start Condition Detection Flag */
#define IIC0_ICSR2_AL                     (1 <<  1) /* 02: Arbitration-Lost Flag */
#define IIC0_ICSR2_TMOF                   (1 <<  0) /* 01: Timeout Detection Flag */
#define IIC0_SARL_SIZE                    3
#define IIC0_SARL_OFFSET                  0x000a
#define IIC0_SARL(p)                      (IIC0_BASE + IIC0_SARL_OFFSET + (p)*0x0002)
#define IIC0_SARL_SVA                     (8 <<  0) /* 01: A slave address is set. 7-Bit Address = SVA[7:1] 10-Bit Address = { SVA9,SVA8,SVA[7:0] } */
#define IIC0_SARL_SVA_MASK                     (0xff)
#define IIC0_SARU_SIZE                    3
#define IIC0_SARU_OFFSET                  0x000b
#define IIC0_SARU(p)                      (IIC0_BASE + IIC0_SARU_OFFSET + (p)*0x0002)
#define IIC0_SARU_SVA9                    (1 <<  2) /* 04: 10-Bit Address(bit9) */
#define IIC0_SARU_SVA8                    (1 <<  1) /* 02: 10-Bit Address(bit8) */
#define IIC0_SARU_FS                      (1 <<  0) /* 01: 7-Bit/10-Bit Address Format Selection */
#define IIC0_ICBRL_OFFSET                 0x0010
#define IIC0_ICBRL                        (IIC0_BASE + IIC0_ICBRL_OFFSET)
#define IIC0_ICBRL_BRL                    (5 <<  0) /* 01: Bit Rate Low-Level Period (Low-level period of SCL clock) */
#define IIC0_ICBRL_BRL_MASK                    (0x1f)
#define IIC0_ICBRH_OFFSET                 0x0011
#define IIC0_ICBRH                        (IIC0_BASE + IIC0_ICBRH_OFFSET)
#define IIC0_ICBRH_BRH                    (5 <<  0) /* 01: Bit Rate High-Level Period (High-level period of SCL clock) */
#define IIC0_ICBRH_BRH_MASK                    (0x1f)
#define IIC0_ICDRT_OFFSET                 0x0012
#define IIC0_ICDRT                        (IIC0_BASE + IIC0_ICDRT_OFFSET)
#define IIC0_ICDRT_ICDRT                  (8 <<  0) /* 01: 8-bit read-write register that stores transmit data. */
#define IIC0_ICDRT_ICDRT_MASK                  (0xff)
#define IIC0_ICDRR_OFFSET                 0x0013
#define IIC0_ICDRR                        (IIC0_BASE + IIC0_ICDRR_OFFSET)
#define IIC0_ICDRR_ICDRR                  (8 <<  0) /* 01: 8-bit register that stores the received data */
#define IIC0_ICDRR_ICDRR_MASK                  (0xff)
#define IIC0_ICWUR_OFFSET                 0x0016
#define IIC0_ICWUR                        (IIC0_BASE + IIC0_ICWUR_OFFSET)
#define IIC0_ICWUR_WUE                    (1 <<  7) /* 80: Wakeup Function Enable */
#define IIC0_ICWUR_WUIE                   (1 <<  6) /* 40: Wakeup Interrupt Request Enable */
#define IIC0_ICWUR_WUF                    (1 <<  5) /* 20: Wakeup Event Occurrence Flag */
#define IIC0_ICWUR_WUACK                  (1 <<  4) /* 10: ACK bit for Wakeup Mode */
#define IIC0_ICWUR_WUAFA                  (1 <<  0) /* 01: Wakeup Analog Filter Additional Selection */
#define IIC0_ICWUR2_OFFSET                0x0017
#define IIC0_ICWUR2                       (IIC0_BASE + IIC0_ICWUR2_OFFSET)
#define IIC0_ICWUR2_WUSYF                 (1 <<  2) /* 04: Wake-up Function Synchronous Operation Status Flag */
#define IIC0_ICWUR2_WUASYF                (1 <<  1) /* 02: Wake-up Function Asynchronous Operation Status Flag */
#define IIC0_ICWUR2_WUSEN                 (1 <<  0) /* 01: Wake-up Function Synchronous Enable */

