leocafonso/svdtoheaders/demo/h/ra4m1_reg.h
/* IIC1 - Inter-Integrated Circuit 1 */
#define IIC1_BASE                         0x40053100
#define IIC1_ICCR1_OFFSET                 0x0000
#define IIC1_ICCR1                        (IIC1_BASE + IIC1_ICCR1_OFFSET)
#define IIC1_ICCR1_ICE                    (1 <<  7) /* 80: I2C Bus Interface Enable */
#define IIC1_ICCR1_IICRST                 (1 <<  6) /* 40: I2C Bus Interface Internal Reset Note:If an internal reset is initiated using the IICRST bit for a bus hang-up occurred during communication with the master device in slave mode, the states may become different between the slave device and the master device (due to the difference in the bit counter information). */
#define IIC1_ICCR1_CLO                    (1 <<  5) /* 20: Extra SCL Clock Cycle Output */
#define IIC1_ICCR1_SOWP                   (1 <<  4) /* 10: SCLO/SDAO Write Protect */
#define IIC1_ICCR1_SCLO                   (1 <<  3) /* 08: SCL Output Control/Monitor */
#define IIC1_ICCR1_SDAO                   (1 <<  2) /* 04: SDA Output Control/Monitor */
#define IIC1_ICCR1_SCLI                   (1 <<  1) /* 02: SCL Line Monitor */
#define IIC1_ICCR1_SDAI                   (1 <<  0) /* 01: SDA Line Monitor */
#define IIC1_ICCR2_OFFSET                 0x0001
#define IIC1_ICCR2                        (IIC1_BASE + IIC1_ICCR2_OFFSET)
#define IIC1_ICCR2_BBSY                   (1 <<  7) /* 80: Bus Busy Detection Flag */
#define IIC1_ICCR2_MST                    (1 <<  6) /* 40: Master/Slave Mode */
#define IIC1_ICCR2_TRS                    (1 <<  5) /* 20: Transmit/Receive Mode */
#define IIC1_ICCR2_SP                     (1 <<  3) /* 08: Stop Condition Issuance Request Note: Writing to the SP bit is not possible while the setting of the BBSY flag is 0 (bus free state). Note: Do not set the SP bit to 1 while a restart condition is being issued. */
#define IIC1_ICCR2_RS                     (1 <<  2) /* 04: Restart Condition Issuance Request Note: Do not set the RS bit to 1 while issuing a stop condition. */
#define IIC1_ICCR2_ST                     (1 <<  1) /* 02: Start Condition Issuance Request Set the ST bit to 1 (start condition issuance request) when the BBSY flag is set to 0 (bus free state). */
#define IIC1_ICMR1_OFFSET                 0x0002
#define IIC1_ICMR1                        (IIC1_BASE + IIC1_ICMR1_OFFSET)
#define IIC1_ICMR1_MTWP                   (1 <<  7) /* 80: MST/TRS Write Protect */
#define IIC1_ICMR1_CKS                    (3 <<  4) /* 10: Internal Reference Clock (fIIC) Selection ( fIIC = PCLKB / 2^CKS ) */
#define IIC1_ICMR1_CKS_MASK                    (0x07)
#define IIC1_ICMR1_BCWP                   (1 <<  3) /* 08: BC Write Protect (This bit is read as 1.) */
#define IIC1_ICMR1_BC                     (3 <<  0) /* 01: Bit Counter */
#define IIC1_ICMR1_BC_MASK                     (0x07)
#define IIC1_ICMR2_OFFSET                 0x0003
#define IIC1_ICMR2                        (IIC1_BASE + IIC1_ICMR2_OFFSET)
#define IIC1_ICMR2_DLCS                   (1 <<  7) /* 80: SDA Output Delay Clock Source Select */
#define IIC1_ICMR2_SDDL                   (3 <<  4) /* 10: SDA Output Delay Counter */
#define IIC1_ICMR2_SDDL_MASK                   (0x07)
#define IIC1_ICMR2_TMOH                   (1 <<  2) /* 04: Timeout H Count Control */
#define IIC1_ICMR2_TMOL                   (1 <<  1) /* 02: Timeout L Count Control */
#define IIC1_ICMR2_TMOS                   (1 <<  0) /* 01: Timeout Detection Time Select */
#define IIC1_ICMR3_OFFSET                 0x0004
#define IIC1_ICMR3                        (IIC1_BASE + IIC1_ICMR3_OFFSET)
#define IIC1_ICMR3_SMBS                   (1 <<  7) /* 80: SMBus/I2C Bus Selection */
#define IIC1_ICMR3_WAIT                   (1 <<  6) /* 40: WAIT Note: When the value of the WAIT bit is to be read, be sure to read the ICDRR beforehand. */
#define IIC1_ICMR3_RDRFS                  (1 <<  5) /* 20: RDRF Flag Set Timing Selection */
#define IIC1_ICMR3_ACKWP                  (1 <<  4) /* 10: ACKBT Write Protect */
#define IIC1_ICMR3_ACKBT                  (1 <<  3) /* 08: Transmit Acknowledge */
#define IIC1_ICMR3_ACKBR                  (1 <<  2) /* 04: Receive Acknowledge */
#define IIC1_ICMR3_NF                     (2 <<  0) /* 01: Noise Filter Stage Selection */
#define IIC1_ICMR3_NF_MASK                     (0x03)
#define IIC1_ICFER_OFFSET                 0x0005
#define IIC1_ICFER                        (IIC1_BASE + IIC1_ICFER_OFFSET)
#define IIC1_ICFER_SCLE                   (1 <<  6) /* 40: SCL Synchronous Circuit Enable */
#define IIC1_ICFER_NFE                    (1 <<  5) /* 20: Digital Noise Filter Circuit Enable */
#define IIC1_ICFER_NACKE                  (1 <<  4) /* 10: NACK Reception Transfer Suspension Enable */
#define IIC1_ICFER_SALE                   (1 <<  3) /* 08: Slave Arbitration-Lost Detection Enable */
#define IIC1_ICFER_NALE                   (1 <<  2) /* 04: NACK Transmission Arbitration-Lost Detection Enable */
#define IIC1_ICFER_MALE                   (1 <<  1) /* 02: Master Arbitration-Lost Detection Enable */
#define IIC1_ICFER_TMOE                   (1 <<  0) /* 01: Timeout Function Enable */
#define IIC1_ICSER_OFFSET                 0x0006
#define IIC1_ICSER                        (IIC1_BASE + IIC1_ICSER_OFFSET)
#define IIC1_ICSER_HOAE                   (1 <<  7) /* 80: Host Address Enable */
#define IIC1_ICSER_DIDE                   (1 <<  5) /* 20: Device-ID Address Detection Enable */
#define IIC1_ICSER_GCAE                   (1 <<  3) /* 08: General Call Address Enable */
#define IIC1_ICSER_SAR2E                  (1 <<  2) /* 04: Slave Address Register 2 Enable */
#define IIC1_ICSER_SAR1E                  (1 <<  1) /* 02: Slave Address Register 1 Enable */
#define IIC1_ICSER_SAR0E                  (1 <<  0) /* 01: Slave Address Register 0 Enable */
#define IIC1_ICIER_OFFSET                 0x0007
#define IIC1_ICIER                        (IIC1_BASE + IIC1_ICIER_OFFSET)
#define IIC1_ICIER_TIE                    (1 <<  7) /* 80: Transmit Data Empty Interrupt Request Enable */
#define IIC1_ICIER_TEIE                   (1 <<  6) /* 40: Transmit End Interrupt Request Enable */
#define IIC1_ICIER_RIE                    (1 <<  5) /* 20: Receive Data Full Interrupt Request Enable */
#define IIC1_ICIER_NAKIE                  (1 <<  4) /* 10: NACK Reception Interrupt Request Enable */
#define IIC1_ICIER_SPIE                   (1 <<  3) /* 08: Stop Condition Detection Interrupt Request Enable */
#define IIC1_ICIER_STIE                   (1 <<  2) /* 04: Start Condition Detection Interrupt Request Enable */
#define IIC1_ICIER_ALIE                   (1 <<  1) /* 02: Arbitration-Lost Interrupt Request Enable */
#define IIC1_ICIER_TMOIE                  (1 <<  0) /* 01: Timeout Interrupt Request Enable */
#define IIC1_ICSR1_OFFSET                 0x0008
#define IIC1_ICSR1                        (IIC1_BASE + IIC1_ICSR1_OFFSET)
#define IIC1_ICSR1_HOA                    (1 <<  7) /* 80: Host Address Detection Flag */
#define IIC1_ICSR1_DID                    (1 <<  5) /* 20: Device-ID Address Detection Flag */
#define IIC1_ICSR1_GCA                    (1 <<  3) /* 08: General Call Address Detection Flag */
#define IIC1_ICSR1_AAS2                   (1 <<  2) /* 04: Slave Address 2 Detection Flag */
#define IIC1_ICSR1_AAS1                   (1 <<  1) /* 02: Slave Address 1 Detection Flag */
#define IIC1_ICSR1_AAS0                   (1 <<  0) /* 01: Slave Address 0 Detection Flag */
#define IIC1_ICSR2_OFFSET                 0x0009
#define IIC1_ICSR2                        (IIC1_BASE + IIC1_ICSR2_OFFSET)
#define IIC1_ICSR2_TDRE                   (1 <<  7) /* 80: Transmit Data Empty Flag */
#define IIC1_ICSR2_TEND                   (1 <<  6) /* 40: Transmit End Flag */
#define IIC1_ICSR2_RDRF                   (1 <<  5) /* 20: Receive Data Full Flag */
#define IIC1_ICSR2_NACKF                  (1 <<  4) /* 10: NACK Detection Flag */
#define IIC1_ICSR2_STOP                   (1 <<  3) /* 08: Stop Condition Detection Flag */
#define IIC1_ICSR2_START                  (1 <<  2) /* 04: Start Condition Detection Flag */
#define IIC1_ICSR2_AL                     (1 <<  1) /* 02: Arbitration-Lost Flag */
#define IIC1_ICSR2_TMOF                   (1 <<  0) /* 01: Timeout Detection Flag */
#define IIC1_SARL_SIZE                    3
#define IIC1_SARL_OFFSET                  0x000a
#define IIC1_SARL(p)                      (IIC1_BASE + IIC1_SARL_OFFSET + (p)*0x0002)
#define IIC1_SARL_SVA                     (8 <<  0) /* 01: A slave address is set. 7-Bit Address = SVA[7:1] 10-Bit Address = { SVA9,SVA8,SVA[7:0] } */
#define IIC1_SARL_SVA_MASK                     (0xff)
#define IIC1_SARU_SIZE                    3
#define IIC1_SARU_OFFSET                  0x000b
#define IIC1_SARU(p)                      (IIC1_BASE + IIC1_SARU_OFFSET + (p)*0x0002)
#define IIC1_SARU_SVA9                    (1 <<  2) /* 04: 10-Bit Address(bit9) */
#define IIC1_SARU_SVA8                    (1 <<  1) /* 02: 10-Bit Address(bit8) */
#define IIC1_SARU_FS                      (1 <<  0) /* 01: 7-Bit/10-Bit Address Format Selection */
#define IIC1_ICBRL_OFFSET                 0x0010
#define IIC1_ICBRL                        (IIC1_BASE + IIC1_ICBRL_OFFSET)
#define IIC1_ICBRL_BRL                    (5 <<  0) /* 01: Bit Rate Low-Level Period (Low-level period of SCL clock) */
#define IIC1_ICBRL_BRL_MASK                    (0x1f)
#define IIC1_ICBRH_OFFSET                 0x0011
#define IIC1_ICBRH                        (IIC1_BASE + IIC1_ICBRH_OFFSET)
#define IIC1_ICBRH_BRH                    (5 <<  0) /* 01: Bit Rate High-Level Period (High-level period of SCL clock) */
#define IIC1_ICBRH_BRH_MASK                    (0x1f)
#define IIC1_ICDRT_OFFSET                 0x0012
#define IIC1_ICDRT                        (IIC1_BASE + IIC1_ICDRT_OFFSET)
#define IIC1_ICDRT_ICDRT                  (8 <<  0) /* 01: 8-bit read-write register that stores transmit data. */
#define IIC1_ICDRT_ICDRT_MASK                  (0xff)
#define IIC1_ICDRR_OFFSET                 0x0013
#define IIC1_ICDRR                        (IIC1_BASE + IIC1_ICDRR_OFFSET)
#define IIC1_ICDRR_ICDRR                  (8 <<  0) /* 01: 8-bit register that stores the received data */
#define IIC1_ICDRR_ICDRR_MASK                  (0xff)

/* IWDT - Independent Watchdog Timer */
#define IWDT_BASE                         0x40044400
#define IWDT_IWDTRR_OFFSET                0x0000
#define IWDT_IWDTRR                       (IWDT_BASE + IWDT_IWDTRR_OFFSET)
#define IWDT_IWDTRR_IWDTRR                (8 <<  0) /* 01: The counter is refreshed by writing 0x00 and then writing 0xFF to this register. */
#define IWDT_IWDTRR_IWDTRR_MASK                (0xff)
#define IWDT_IWDTSR_OFFSET                0x0004
#define IWDT_IWDTSR                       (IWDT_BASE + IWDT_IWDTSR_OFFSET)
#define IWDT_IWDTSR_REFEF                 (1 << 15) /* 8000: Refresh Error Flag */
#define IWDT_IWDTSR_UNDFF                 (1 << 14) /* 4000: Underflow Flag */
#define IWDT_IWDTSR_CNTVAL                (14 <<  0) /* 01: Counter Value Value counted by the counter */
#define IWDT_IWDTSR_CNTVAL_MASK                (0x3fff)

/* KINT - Key Interrupt Function */
#define KINT_BASE                         0x40080000
#define KINT_KRCTL_OFFSET                 0x0000
#define KINT_KRCTL                        (KINT_BASE + KINT_KRCTL_OFFSET)
#define KINT_KRCTL_KRMD                   (1 <<  7) /* 80: Usage of Key Interrupt Flags(KR0 to KR7) */
#define KINT_KRCTL_KREG                   (1 <<  0) /* 01: Detection Edge Selection (KRF0 to KRF7) */
#define KINT_KRF_OFFSET                   0x0004
#define KINT_KRF                          (KINT_BASE + KINT_KRF_OFFSET)
#define KINT_KRF_KRF7                     (1 <<  7) /* 80: Key interrupt flag 7 */
#define KINT_KRF_KRF6                     (1 <<  6) /* 40: Key interrupt flag 6 */
#define KINT_KRF_KRF5                     (1 <<  5) /* 20: Key interrupt flag 5 */
#define KINT_KRF_KRF4                     (1 <<  4) /* 10: Key interrupt flag 4 */
#define KINT_KRF_KRF3                     (1 <<  3) /* 08: Key interrupt flag 3 */
#define KINT_KRF_KRF2                     (1 <<  2) /* 04: Key interrupt flag 2 */
#define KINT_KRF_KRF1                     (1 <<  1) /* 02: Key interrupt flag 1 */
#define KINT_KRF_KRF0                     (1 <<  0) /* 01: Key interrupt flag 0 */
#define KINT_KRM_OFFSET                   0x0008
#define KINT_KRM                          (KINT_BASE + KINT_KRM_OFFSET)
#define KINT_KRM_KRM7                     (1 <<  7) /* 80: Key interrupt mode control 7 */
#define KINT_KRM_KRM6                     (1 <<  6) /* 40: Key interrupt mode control 6 */
#define KINT_KRM_KRM5                     (1 <<  5) /* 20: Key interrupt mode control 5 */
#define KINT_KRM_KRM4                     (1 <<  4) /* 10: Key interrupt mode control 4 */
#define KINT_KRM_KRM3                     (1 <<  3) /* 08: Key interrupt mode control 3 */
#define KINT_KRM_KRM2                     (1 <<  2) /* 04: Key interrupt mode control 2 */
#define KINT_KRM_KRM1                     (1 <<  1) /* 02: Key interrupt mode control 1 */
#define KINT_KRM_KRM0                     (1 <<  0) /* 01: Key interrupt mode control 0 */

/* MSTP - Module Stop Control B,C,D */
#define MSTP_BASE                         0x40047000
#define MSTP_MSTPCRB_OFFSET               0x0000
#define MSTP_MSTPCRB                      (MSTP_BASE + MSTP_MSTPCRB_OFFSET)
#define MSTP_MSTPCRB_MSTPB31              (1 << 31) /* 80000000: Serial Communication Interface 0 Module Stop */
#define MSTP_MSTPCRB_MSTPB30              (1 << 30) /* 40000000: Serial Communication Interface 1 Module Stop */
#define MSTP_MSTPCRB_MSTPB29              (1 << 29) /* 20000000: Serial Communication Interface 2 Module Stop */
#define MSTP_MSTPCRB_MSTPB22              (1 << 22) /* 400000: Serial Communication Interface 9 Module Stop */
#define MSTP_MSTPCRB_MSTPB19              (1 << 19) /* 80000: Serial Peripheral Interface 0 Module Stop */
#define MSTP_MSTPCRB_MSTPB18              (1 << 18) /* 40000: Serial Peripheral Interface 1 Module Stop */
#define MSTP_MSTPCRB_MSTPB11              (1 << 11) /* 800: Universal Serial Bus 2.0 FS Interface Module Stop */
#define MSTP_MSTPCRB_MSTPB9               (1 <<  9) /* 200: I2C Bus Interface 0 Module Stop */
#define MSTP_MSTPCRB_MSTPB8               (1 <<  8) /* 100: I2C Bus Interface 1 Module Stop */
#define MSTP_MSTPCRB_MSTPB2               (1 <<  2) /* 04: Controller Area Network Module Stop */
#define MSTP_MSTPCRC_OFFSET               0x0004
#define MSTP_MSTPCRC                      (MSTP_BASE + MSTP_MSTPCRC_OFFSET)
#define MSTP_MSTPCRC_MSTPC31              (1 << 31) /* 80000000: SCE5 Module Stop */
#define MSTP_MSTPCRC_MSTPC14              (1 << 14) /* 4000: Event Link Controller Module Stop */
#define MSTP_MSTPCRC_MSTPC13              (1 << 13) /* 2000: Data Operation Circuit Module Stop */
#define MSTP_MSTPCRC_MSTPC8               (1 <<  8) /* 100: Synchronous Serial Interface 0 Module Stop */
#define MSTP_MSTPCRC_MSTPC4               (1 <<  4) /* 10: Segment LCD Controller Module Stop */
#define MSTP_MSTPCRC_MSTPC3               (1 <<  3) /* 08: Capacitive Touch Sensing Unit Module Stop */
#define MSTP_MSTPCRC_MSTPC1               (1 <<  1) /* 02: Cyclic Redundancy Check Calculator Module Stop */
#define MSTP_MSTPCRC_MSTPC0               (1 <<  0) /* 01: Clock Frequency Accuracy Measurement Circuit Module Stop */
#define MSTP_MSTPCRD_OFFSET               0x0008
#define MSTP_MSTPCRD                      (MSTP_BASE + MSTP_MSTPCRD_OFFSET)
#define MSTP_MSTPCRD_MSTPD31              (1 << 31) /* 80000000: Operational Amplifier Module Stop */
#define MSTP_MSTPCRD_MSTPD29              (1 << 29) /* 20000000: Low-Power Analog Comparator Module Stop */
#define MSTP_MSTPCRD_MSTPD20              (1 << 20) /* 100000: 12-Bit D/A Converter Module Stop */
#define MSTP_MSTPCRD_MSTPD19              (1 << 19) /* 80000: 8-bit D/A Converter Module Stop */
#define MSTP_MSTPCRD_MSTPD16              (1 << 16) /* 10000: 14-Bit A/D Converter Module Stop */
#define MSTP_MSTPCRD_MSTPD14              (1 << 14) /* 4000: Port Output Enable for GPT Module Stop */
#define MSTP_MSTPCRD_MSTPD6               (1 <<  6) /* 40: General PWM Timer 169 to 164 Module Stop */
#define MSTP_MSTPCRD_MSTPD5               (1 <<  5) /* 20: General PWM Timer 323 to 320 Module Stop */
#define MSTP_MSTPCRD_MSTPD3               (1 <<  3) /* 08: Asynchronous General Purpose Timer 0 Module Stop */
#define MSTP_MSTPCRD_MSTPD2               (1 <<  2) /* 04: Asynchronous General Purpose Timer 1 Module Stop */

/* MMPU - Bus Master MPU */
#define MMPU_BASE                         0x40000000
#define MMPU_MMPUCTLA_OFFSET              0x0000
#define MMPU_MMPUCTLA                     (MMPU_BASE + MMPU_MMPUCTLA_OFFSET)
#define MMPU_MMPUCTLA_KEY                 (8 <<  8) /* 100: Key Code These bits are used to enable or disable writing of the OAD and ENABLE bit. */
#define MMPU_MMPUCTLA_KEY_MASK                 (0xff)
#define MMPU_MMPUCTLA_OAD                 (1 <<  1) /* 02: Operation after detection */
#define MMPU_MMPUCTLA_ENABLE              (1 <<  0) /* 01: Master Group enable */
#define MMPU_MMPUACA_SIZE                 16
#define MMPU_MMPUACA_OFFSET               0x0200
#define MMPU_MMPUACA(p)                   (MMPU_BASE + MMPU_MMPUACA_OFFSET + (p)*0x0010)
#define MMPU_MMPUACA_WP                   (1 <<  2) /* 04: Write protection */
#define MMPU_MMPUACA_RP                   (1 <<  1) /* 02: Read protection */
#define MMPU_MMPUACA_ENABLE               (1 <<  0) /* 01: Region enable */
#define MMPU_MMPUSA_SIZE                  16
#define MMPU_MMPUSA_OFFSET                0x0204
#define MMPU_MMPUSA(p)                    (MMPU_BASE + MMPU_MMPUSA_OFFSET + (p)*0x0010)
#define MMPU_MMPUSA_MMPUSA                (32 <<  0) /* 01: Address where the region starts, for use in region determination. NOTE: The low-order 2 bits are fixed to 0. */
#define MMPU_MMPUSA_MMPUSA_MASK                (0xffffffff)
#define MMPU_MMPUEA_SIZE                  16
#define MMPU_MMPUEA_OFFSET                0x0208
#define MMPU_MMPUEA(p)                    (MMPU_BASE + MMPU_MMPUEA_OFFSET + (p)*0x0010)
#define MMPU_MMPUEA_MMPUEA                (32 <<  0) /* 01: Region end address register Address where the region end, for use in region determination. NOTE: The low-order 2 bits are fixed to 1. */
#define MMPU_MMPUEA_MMPUEA_MASK                (0xffffffff)
#define MMPU_MMPUPTA_OFFSET               0x0102
#define MMPU_MMPUPTA                      (MMPU_BASE + MMPU_MMPUPTA_OFFSET)
#define MMPU_MMPUPTA_KEY                  (8 <<  8) /* 100: Write Keyword The data written to these bits are not stored. */
#define MMPU_MMPUPTA_KEY_MASK                  (0xff)
#define MMPU_MMPUPTA_PROTECT              (1 <<  0) /* 01: Protection of register (MMPUSAn, MMPUEAn and MMPUACAn) */

/* SMPU - Bus Slave MPU */
#define SMPU_BASE                         0x40000c00
#define SMPU_SMPUCTL_OFFSET               0x0000
#define SMPU_SMPUCTL                      (SMPU_BASE + SMPU_SMPUCTL_OFFSET)
#define SMPU_SMPUCTL_KEY                  (8 <<  8) /* 100: Key Code This bit is used to enable or disable rewriting of the PROTECT and OAD bit. */
#define SMPU_SMPUCTL_KEY_MASK                  (0xff)
#define SMPU_SMPUCTL_PROTECT              (1 <<  1) /* 02: Protection of register */
#define SMPU_SMPUCTL_OAD                  (1 <<  0) /* 01: Master Group enable */
#define SMPU_SMPUMBIU_OFFSET              0x0010
#define SMPU_SMPUMBIU                     (SMPU_BASE + SMPU_SMPUMBIU_OFFSET)
#define SMPU_SMPUMBIU_WPGRPA              (1 <<  3) /* 08: Master Group A Write protection */
#define SMPU_SMPUMBIU_RPGRPA              (1 <<  2) /* 04: Master Group A Read protection */
#define SMPU_SMPUFBIU_OFFSET              0x0014
#define SMPU_SMPUFBIU                     (SMPU_BASE + SMPU_SMPUFBIU_OFFSET)
#define SMPU_SMPUFBIU_WPGRPA              (1 <<  3) /* 08: Master Group A Write protection */
#define SMPU_SMPUFBIU_RPGRPA              (1 <<  2) /* 04: Master Group A Read protection */
#define SMPU_SMPUFBIU_WPCPU               (1 <<  1) /* 02: CPU Write protection */
#define SMPU_SMPUFBIU_RPCPU               (1 <<  0) /* 01: CPU Read protection */
#define SMPU_SMPUSRAM0_OFFSET             0x0018
#define SMPU_SMPUSRAM0                    (SMPU_BASE + SMPU_SMPUSRAM0_OFFSET)
#define SMPU_SMPUSRAM0_WPGRPA             (1 <<  3) /* 08: Master Group A Write protection */
#define SMPU_SMPUSRAM0_RPGRPA             (1 <<  2) /* 04: Master Group A Read protection */
#define SMPU_SMPUSRAM0_WPCPU              (1 <<  1) /* 02: CPU Write protection */
#define SMPU_SMPUSRAM0_RPCPU              (1 <<  0) /* 01: CPU Read protection */
#define SMPU_SMPUPBIU_SIZE                3
#define SMPU_SMPUPBIU_OFFSET              0x0020
#define SMPU_SMPUPBIU(p)                  (SMPU_BASE + SMPU_SMPUPBIU_OFFSET + (p)*0x0004)
#define SMPU_SMPUPBIU_WPGRPA              (1 <<  3) /* 08: Master Group A Write protection */
#define SMPU_SMPUPBIU_RPGRPA              (1 <<  2) /* 04: Master Group A Read protection */
#define SMPU_SMPUPBIU_WPCPU               (1 <<  1) /* 02: CPU Write protection */
#define SMPU_SMPUPBIU_RPCPU               (1 <<  0) /* 01: CPU Read protection */

