leocafonso/svdtoheaders/demo/h/ra4m1_reg.h
/* SPMON - CPU Stack Pointer Monitor */
#define SPMON_BASE                        0x40000d00
#define SPMON_MSPMPUOAD_OFFSET            0x0000
#define SPMON_MSPMPUOAD                   (SPMON_BASE + SPMON_MSPMPUOAD_OFFSET)
#define SPMON_MSPMPUOAD_KEY               (8 <<  8) /* 100: Write Keyword The data written to these bits are not stored. */
#define SPMON_MSPMPUOAD_KEY_MASK               (0xff)
#define SPMON_MSPMPUOAD_OAD               (1 <<  0) /* 01: Operation after detection */
#define SPMON_MSPMPUCTL_OFFSET            0x0004
#define SPMON_MSPMPUCTL                   (SPMON_BASE + SPMON_MSPMPUCTL_OFFSET)
#define SPMON_MSPMPUCTL_ERROR             (1 <<  8) /* 100: Stack Pointer Monitor Error Flag */
#define SPMON_MSPMPUCTL_ENABLE            (1 <<  0) /* 01: Stack Pointer Monitor Enable */
#define SPMON_MSPMPUPT_OFFSET             0x0006
#define SPMON_MSPMPUPT                    (SPMON_BASE + SPMON_MSPMPUPT_OFFSET)
#define SPMON_MSPMPUPT_KEY                (8 <<  8) /* 100: Write Keyword The data written to these bits are not stored. */
#define SPMON_MSPMPUPT_KEY_MASK                (0xff)
#define SPMON_MSPMPUPT_PROTECT            (1 <<  0) /* 01: Protection of register (MSPMPUAC, MSPMPUSA and MSPMPUSE) */
#define SPMON_MSPMPUSA_OFFSET             0x0008
#define SPMON_MSPMPUSA                    (SPMON_BASE + SPMON_MSPMPUSA_OFFSET)
#define SPMON_MSPMPUSA_MSPMPUSA           (32 <<  0) /* 01: Region start address register Address where the region starts, for use in region determination. NOTE: Range: 0x1FF00000-0x200FFFFC The low-order 2 bits are fixed to 0. */
#define SPMON_MSPMPUSA_MSPMPUSA_MASK           (0xffffffff)
#define SPMON_MSPMPUEA_OFFSET             0x000c
#define SPMON_MSPMPUEA                    (SPMON_BASE + SPMON_MSPMPUEA_OFFSET)
#define SPMON_MSPMPUEA_MSPMPUEA           (32 <<  0) /* 01: Region end address register Address where the region starts, for use in region determination. NOTE: Range: 0x1FF00003-0x200FFFFF The low-order 2 bits are fixed to 1. */
#define SPMON_MSPMPUEA_MSPMPUEA_MASK           (0xffffffff)
#define SPMON_PSPMPUOAD_OFFSET            0x0010
#define SPMON_PSPMPUOAD                   (SPMON_BASE + SPMON_PSPMPUOAD_OFFSET)
#define SPMON_PSPMPUOAD_KEY               (8 <<  8) /* 100: Key Code The data written to these bits are not stored. */
#define SPMON_PSPMPUOAD_KEY_MASK               (0xff)
#define SPMON_PSPMPUOAD_OAD               (1 <<  0) /* 01: Operation after detection */
#define SPMON_PSPMPUCTL_OFFSET            0x0014
#define SPMON_PSPMPUCTL                   (SPMON_BASE + SPMON_PSPMPUCTL_OFFSET)
#define SPMON_PSPMPUCTL_ERROR             (1 <<  8) /* 100: Stack Pointer Monitor Error Flag */
#define SPMON_PSPMPUCTL_ENABLE            (1 <<  0) /* 01: Stack Pointer Monitor Enable */
#define SPMON_PSPMPUPT_OFFSET             0x0016
#define SPMON_PSPMPUPT                    (SPMON_BASE + SPMON_PSPMPUPT_OFFSET)
#define SPMON_PSPMPUPT_KEY                (8 <<  8) /* 100: Key Code The data written to these bits are not stored. */
#define SPMON_PSPMPUPT_KEY_MASK                (0xff)
#define SPMON_PSPMPUPT_PROTECT            (1 <<  0) /* 01: Protection register (PSPMPUAC, PSPMPUSA and PSPMPUSE) */
#define SPMON_PSPMPUSA_OFFSET             0x0018
#define SPMON_PSPMPUSA                    (SPMON_BASE + SPMON_PSPMPUSA_OFFSET)
#define SPMON_PSPMPUSA_PSPMPUSA           (32 <<  0) /* 01: Region start address register Address where the region starts, for use in region determination. NOTE: Range: 0x1FF00000-0x200FFFFC The low-order 2 bits are fixed to 0. */
#define SPMON_PSPMPUSA_PSPMPUSA_MASK           (0xffffffff)
#define SPMON_PSPMPUEA_OFFSET             0x001c
#define SPMON_PSPMPUEA                    (SPMON_BASE + SPMON_PSPMPUEA_OFFSET)
#define SPMON_PSPMPUEA_PSPMPUEA           (32 <<  0) /* 01: Region end address register Address where the region starts, for use in region determination. NOTE: Range: 0x1FF00003-0x200FFFFF The low-order 2 bits are fixed to 1. */
#define SPMON_PSPMPUEA_PSPMPUEA_MASK           (0xffffffff)

/* OPAMP - OperationalAmplifier */
#define OPAMP_BASE                        0x40086000
#define OPAMP_AMPMC_OFFSET                0x0008
#define OPAMP_AMPMC                       (OPAMP_BASE + OPAMP_AMPMC_OFFSET)
#define OPAMP_AMPMC_AMPSP                 (1 <<  7) /* 80: Operation mode selection */
#define OPAMP_AMPMC_AMPPC3                (1 <<  3) /* 08: Operational amplifier precharge control status */
#define OPAMP_AMPMC_AMPPC2                (1 <<  2) /* 04: Operational amplifier precharge control status */
#define OPAMP_AMPMC_AMPPC1                (1 <<  1) /* 02: Operational amplifier precharge control status */
#define OPAMP_AMPMC_AMPPC0                (1 <<  0) /* 01: Operational amplifier precharge control status */
#define OPAMP_AMPTRM_OFFSET               0x0009
#define OPAMP_AMPTRM                      (OPAMP_BASE + OPAMP_AMPTRM_OFFSET)
#define OPAMP_AMPTRM_AMPTRM31             (1 <<  7) /* 80: Operational amplifier function activation/stop trigger control */
#define OPAMP_AMPTRM_AMPTRM30             (1 <<  6) /* 40: Operational amplifier function activation/stop trigger control */
#define OPAMP_AMPTRM_AMPTRM21             (1 <<  5) /* 20: Operational amplifier function activation/stop trigger control */
#define OPAMP_AMPTRM_AMPTRM20             (1 <<  4) /* 10: Operational amplifier function activation/stop trigger control */
#define OPAMP_AMPTRM_AMPTRM11             (1 <<  3) /* 08: Operational amplifier function activation/stop trigger control */
#define OPAMP_AMPTRM_AMPTRM10             (1 <<  2) /* 04: Operational amplifier function activation/stop trigger control */
#define OPAMP_AMPTRM_AMPTRM01             (1 <<  1) /* 02: Operational amplifier function activation/stop trigger control */
#define OPAMP_AMPTRM_AMPTRM00             (1 <<  0) /* 01: Operational amplifier function activation/stop trigger control */
#define OPAMP_AMPTRS_OFFSET               0x000a
#define OPAMP_AMPTRS                      (OPAMP_BASE + OPAMP_AMPTRS_OFFSET)
#define OPAMP_AMPTRS_AMPTRS               (2 <<  0) /* 01: ELC trigger selection Do not change the value of the AMPTRS register after setting the AMPTRM register. */
#define OPAMP_AMPTRS_AMPTRS_MASK               (0x03)
#define OPAMP_AMPC_OFFSET                 0x000b
#define OPAMP_AMPC                        (OPAMP_BASE + OPAMP_AMPC_OFFSET)
#define OPAMP_AMPC_IREFE                  (1 <<  7) /* 80: Operation control of operational amplifier reference current circuit */
#define OPAMP_AMPC_AMPE3                  (1 <<  3) /* 08: Operation control of operational amplifier(UNIT3) */
#define OPAMP_AMPC_AMPE2                  (1 <<  2) /* 04: Operation control of operational amplifier(UNIT2) */
#define OPAMP_AMPC_AMPE1                  (1 <<  1) /* 02: Operation control of operational amplifier(UNIT1) */
#define OPAMP_AMPC_AMPE0                  (1 <<  0) /* 01: Operation control of operational amplifier(UNIT0) */
#define OPAMP_AMPMON_OFFSET               0x000c
#define OPAMP_AMPMON                      (OPAMP_BASE + OPAMP_AMPMON_OFFSET)
#define OPAMP_AMPMON_AMPMON3              (1 <<  3) /* 08: Operational amplifier status(UNIT3) */
#define OPAMP_AMPMON_AMPMON2              (1 <<  2) /* 04: Operational amplifier status(UNIT2) */
#define OPAMP_AMPMON_AMPMON1              (1 <<  1) /* 02: Operational amplifier status(UNIT1) */
#define OPAMP_AMPMON_AMPMON0              (1 <<  0) /* 01: Operational amplifier status(UNIT0) */

/* POEG - Port Output Enable Module for GPT */
#define POEG_BASE                         0x40042000
#define POEG_POEGG_SIZE                   2
#define POEG_POEGG_OFFSET                 0x0000
#define POEG_POEGG(p)                     (POEG_BASE + POEG_POEGG_OFFSET + (p)*0x0100)
#define POEG_POEGG_NFCS                   (2 << 30) /* 40000000: Noise Filter Clock Select */
#define POEG_POEGG_NFCS_MASK                   (0x03)
#define POEG_POEGG_NFEN                   (1 << 29) /* 20000000: Noise Filter Enable */
#define POEG_POEGG_INV                    (1 << 28) /* 10000000: GTETRG Input Reverse */
#define POEG_POEGG_ST                     (1 << 16) /* 10000: GTETRG Input Status Flag */
#define POEG_POEGG_OSTPE                  (1 <<  6) /* 40: Oscillation Stop Detection Enable Note: Can be modified only once after a reset. */
#define POEG_POEGG_IOCE                   (1 <<  5) /* 20: Output-disable Request Enable from GPT Note: Can be modified only once after a reset. */
#define POEG_POEGG_PIDE                   (1 <<  4) /* 10: Port Input Detection Enable Note: Can be modified only once after a reset. */
#define POEG_POEGG_SSF                    (1 <<  3) /* 08: Software Stop Flag */
#define POEG_POEGG_OSTPF                  (1 <<  2) /* 04: Oscillation Stop Detection Flag */
#define POEG_POEGG_IOCF                   (1 <<  1) /* 02: Output-disable Request Detection Flag from GPT */
#define POEG_POEGG_PIDF                   (1 <<  0) /* 01: Port Input Detection Flag */

