leocafonso/svdtoheaders/demo/h/ra4m1_reg.h
/* SRAM - SRAM Control */
#define SRAM_BASE                         0x40002000
#define SRAM_PARIOAD_OFFSET               0x0000
#define SRAM_PARIOAD                      (SRAM_BASE + SRAM_PARIOAD_OFFSET)
#define SRAM_PARIOAD_OAD                  (1 <<  0) /* 01: Operation after Detection */
#define SRAM_SRAMPRCR_OFFSET              0x0004
#define SRAM_SRAMPRCR                     (SRAM_BASE + SRAM_SRAMPRCR_OFFSET)
#define SRAM_SRAMPRCR_KW                  (7 <<  1) /* 02: Write Key Code */
#define SRAM_SRAMPRCR_KW_MASK                  (0x7f)
#define SRAM_SRAMPRCR_SRAMPRCR            (1 <<  0) /* 01: Register Write Control */
#define SRAM_ECCMODE_OFFSET               0x00c0
#define SRAM_ECCMODE                      (SRAM_BASE + SRAM_ECCMODE_OFFSET)
#define SRAM_ECCMODE_ECCMOD               (2 <<  0) /* 01: ECC Operating Mode Select */
#define SRAM_ECCMODE_ECCMOD_MASK               (0x03)
#define SRAM_ECC2STS_OFFSET               0x00c1
#define SRAM_ECC2STS                      (SRAM_BASE + SRAM_ECC2STS_OFFSET)
#define SRAM_ECC2STS_ECC2ERR              (1 <<  0) /* 01: ECC 2-Bit Error Status */
#define SRAM_ECC1STSEN_OFFSET             0x00c2
#define SRAM_ECC1STSEN                    (SRAM_BASE + SRAM_ECC1STSEN_OFFSET)
#define SRAM_ECC1STSEN_E1STSEN            (1 <<  0) /* 01: ECC 1-Bit Error Information Update Enable */
#define SRAM_ECC1STS_OFFSET               0x00c3
#define SRAM_ECC1STS                      (SRAM_BASE + SRAM_ECC1STS_OFFSET)
#define SRAM_ECC1STS_ECC1ERR              (1 <<  0) /* 01: ECC 1-Bit Error Status */
#define SRAM_ECCPRCR_OFFSET               0x00c4
#define SRAM_ECCPRCR                      (SRAM_BASE + SRAM_ECCPRCR_OFFSET)
#define SRAM_ECCPRCR_KW                   (7 <<  1) /* 02: Write Key Code */
#define SRAM_ECCPRCR_KW_MASK                   (0x7f)
#define SRAM_ECCPRCR_ECCPRCR              (1 <<  0) /* 01: Register Write Control */
#define SRAM_ECCPRCR2_OFFSET              0x00d0
#define SRAM_ECCPRCR2                     (SRAM_BASE + SRAM_ECCPRCR2_OFFSET)
#define SRAM_ECCPRCR2_KW2                 (7 <<  1) /* 02: Write Key Code */
#define SRAM_ECCPRCR2_KW2_MASK                 (0x7f)
#define SRAM_ECCPRCR2_ECCPRCR2            (1 <<  0) /* 01: Register Write Control */
#define SRAM_ECCETST_OFFSET               0x00d4
#define SRAM_ECCETST                      (SRAM_BASE + SRAM_ECCETST_OFFSET)
#define SRAM_ECCETST_TSTBYP               (1 <<  0) /* 01: ECC Bypass Select */
#define SRAM_ECCOAD_OFFSET                0x00d8
#define SRAM_ECCOAD                       (SRAM_BASE + SRAM_ECCOAD_OFFSET)
#define SRAM_ECCOAD_OAD                   (1 <<  0) /* 01: Operation after Detection */

/* RTC - Realtime Clock */
#define RTC_BASE                          0x40044000
#define RTC_R64CNT_OFFSET                 0x0000
#define RTC_R64CNT                        (RTC_BASE + RTC_R64CNT_OFFSET)
#define RTC_R64CNT_F1HZ                   (1 <<  6) /* 40: 1Hz */
#define RTC_R64CNT_F2HZ                   (1 <<  5) /* 20: 2Hz */
#define RTC_R64CNT_F4HZ                   (1 <<  4) /* 10: 4Hz */
#define RTC_R64CNT_F8HZ                   (1 <<  3) /* 08: 8Hz */
#define RTC_R64CNT_F16HZ                  (1 <<  2) /* 04: 16Hz */
#define RTC_R64CNT_F32HZ                  (1 <<  1) /* 02: 32Hz */
#define RTC_R64CNT_F64HZ                  (1 <<  0) /* 01: 64Hz */
#define RTC_RSECCNT_OFFSET                0x0002
#define RTC_RSECCNT                       (RTC_BASE + RTC_RSECCNT_OFFSET)
#define RTC_RSECCNT_SEC10                 (3 <<  4) /* 10: 10-Second Count Counts from 0 to 5 for 60-second counting. */
#define RTC_RSECCNT_SEC10_MASK                 (0x07)
#define RTC_RSECCNT_SEC1                  (4 <<  0) /* 01: 1-Second Count Counts from 0 to 9 every second. When a carry is generated, 1 is added to the tens place. */
#define RTC_RSECCNT_SEC1_MASK                  (0x0f)
#define RTC_BCNT0_OFFSET                  0x0002
#define RTC_BCNT0                         (RTC_BASE + RTC_BCNT0_OFFSET)
#define RTC_BCNT0_BCNT0                   (8 <<  0) /* 01: The BCNT0 counter is a readable/writable 32-bit binary counter b7 to b0. */
#define RTC_BCNT0_BCNT0_MASK                   (0xff)
#define RTC_RMINCNT_OFFSET                0x0004
#define RTC_RMINCNT                       (RTC_BASE + RTC_RMINCNT_OFFSET)
#define RTC_RMINCNT_MIN10                 (3 <<  4) /* 10: 10-Minute Count Counts from 0 to 5 for 60-minute counting. */
#define RTC_RMINCNT_MIN10_MASK                 (0x07)
#define RTC_RMINCNT_MIN1                  (4 <<  0) /* 01: 1-Minute Count Counts from 0 to 9 every minute. When a carry is generated, 1 is added to the tens place. */
#define RTC_RMINCNT_MIN1_MASK                  (0x0f)
#define RTC_BCNT1_OFFSET                  0x0004
#define RTC_BCNT1                         (RTC_BASE + RTC_BCNT1_OFFSET)
#define RTC_BCNT1_BCNT1                   (8 <<  0) /* 01: The BCNT1 counter is a readable/writable 32-bit binary counter b15 to b8. */
#define RTC_BCNT1_BCNT1_MASK                   (0xff)
#define RTC_RHRCNT_OFFSET                 0x0006
#define RTC_RHRCNT                        (RTC_BASE + RTC_RHRCNT_OFFSET)
#define RTC_RHRCNT_PM                     (1 <<  6) /* 40: Time Counter Setting for a.m./p.m. */
#define RTC_RHRCNT_HR10                   (2 <<  4) /* 10: 10-Hour Count Counts from 0 to 2 once per carry from the ones place. */
#define RTC_RHRCNT_HR10_MASK                   (0x03)
#define RTC_RHRCNT_HR1                    (4 <<  0) /* 01: 1-Hour Count Counts from 0 to 9 once per hour. When a carry is generated, 1 is added to the tens place. */
#define RTC_RHRCNT_HR1_MASK                    (0x0f)
#define RTC_BCNT2_OFFSET                  0x0006
#define RTC_BCNT2                         (RTC_BASE + RTC_BCNT2_OFFSET)
#define RTC_BCNT2_BCNT2                   (8 <<  0) /* 01: The BCNT2 counter is a readable/writable 32-bit binary counter b23 to b16. */
#define RTC_BCNT2_BCNT2_MASK                   (0xff)
#define RTC_RWKCNT_OFFSET                 0x0008
#define RTC_RWKCNT                        (RTC_BASE + RTC_RWKCNT_OFFSET)
#define RTC_RWKCNT_DAYW                   (3 <<  0) /* 01: Day-of-Week Counting */
#define RTC_RWKCNT_DAYW_MASK                   (0x07)
#define RTC_BCNT3_OFFSET                  0x0008
#define RTC_BCNT3                         (RTC_BASE + RTC_BCNT3_OFFSET)
#define RTC_BCNT3_BCNT3                   (8 <<  0) /* 01: The BCNT3 counter is a readable/writable 32-bit binary counter b31 to b24. */
#define RTC_BCNT3_BCNT3_MASK                   (0xff)
#define RTC_RDAYCNT_OFFSET                0x000a
#define RTC_RDAYCNT                       (RTC_BASE + RTC_RDAYCNT_OFFSET)
#define RTC_RDAYCNT_DATE10                (2 <<  4) /* 10: 10-Day Count Counts from 0 to 3 once per carry from the ones place. */
#define RTC_RDAYCNT_DATE10_MASK                (0x03)
#define RTC_RDAYCNT_DATE1                 (4 <<  0) /* 01: 1-Day Count Counts from 0 to 9 once per day. When a carry is generated, 1 is added to the tens place. */
#define RTC_RDAYCNT_DATE1_MASK                 (0x0f)
#define RTC_RMONCNT_OFFSET                0x000c
#define RTC_RMONCNT                       (RTC_BASE + RTC_RMONCNT_OFFSET)
#define RTC_RMONCNT_MON10                 (1 <<  4) /* 10: 10-Month Count Counts from 0 to 1 once per carry from the ones place. */
#define RTC_RMONCNT_MON1                  (4 <<  0) /* 01: 1-Month Count Counts from 0 to 9 once per month. When a carry is generated, 1 is added to the tens place. */
#define RTC_RMONCNT_MON1_MASK                  (0x0f)
#define RTC_RYRCNT_OFFSET                 0x000e
#define RTC_RYRCNT                        (RTC_BASE + RTC_RYRCNT_OFFSET)
#define RTC_RYRCNT_YR10                   (4 <<  4) /* 10: 10-Year Count Counts from 0 to 9 once per carry from ones place. When a carry is generated in the tens place, 1 is added to the hundreds place. */
#define RTC_RYRCNT_YR10_MASK                   (0x0f)
#define RTC_RYRCNT_YR1                    (4 <<  0) /* 01: 1-Year Count Counts from 0 to 9 once per year. When a carry is generated, 1 is added to the tens place. */
#define RTC_RYRCNT_YR1_MASK                    (0x0f)
#define RTC_RSECAR_OFFSET                 0x0010
#define RTC_RSECAR                        (RTC_BASE + RTC_RSECAR_OFFSET)
#define RTC_RSECAR_ENB                    (1 <<  7) /* 80: Compare enable */
#define RTC_RSECAR_SEC10                  (3 <<  4) /* 10: 10-Seconds Value for the tens place of seconds */
#define RTC_RSECAR_SEC10_MASK                  (0x07)
#define RTC_RSECAR_SEC1                   (4 <<  0) /* 01: 1-Second Value for the ones place of seconds */
#define RTC_RSECAR_SEC1_MASK                   (0x0f)
#define RTC_BCNT0AR_OFFSET                0x0010
#define RTC_BCNT0AR                       (RTC_BASE + RTC_BCNT0AR_OFFSET)
#define RTC_BCNT0AR_BCNT0AR               (8 <<  0) /* 01: he BCNT0AR counter is a readable/writable alarm register corresponding to 32-bit binary counter b7 to b0. */
#define RTC_BCNT0AR_BCNT0AR_MASK               (0xff)
#define RTC_RMINAR_OFFSET                 0x0012
#define RTC_RMINAR                        (RTC_BASE + RTC_RMINAR_OFFSET)
#define RTC_RMINAR_ENB                    (1 <<  7) /* 80: Compare enable */
#define RTC_RMINAR_MIN10                  (3 <<  4) /* 10: 10-Minute Count Value for the tens place of minutes */
#define RTC_RMINAR_MIN10_MASK                  (0x07)
#define RTC_RMINAR_MIN1                   (4 <<  0) /* 01: 1-Minute Count Value for the ones place of minutes */
#define RTC_RMINAR_MIN1_MASK                   (0x0f)
#define RTC_BCNT1AR_OFFSET                0x0012
#define RTC_BCNT1AR                       (RTC_BASE + RTC_BCNT1AR_OFFSET)
#define RTC_BCNT1AR_BCNT1AR               (8 <<  0) /* 01: he BCNT1AR counter is a readable/writable alarm register corresponding to 32-bit binary counter b15 to b8. */
#define RTC_BCNT1AR_BCNT1AR_MASK               (0xff)
#define RTC_RHRAR_OFFSET                  0x0014
#define RTC_RHRAR                         (RTC_BASE + RTC_RHRAR_OFFSET)
#define RTC_RHRAR_ENB                     (1 <<  7) /* 80: Compare enable */
#define RTC_RHRAR_PM                      (1 <<  6) /* 40: Time Counter Setting for a.m./p.m. */
#define RTC_RHRAR_HR10                    (2 <<  4) /* 10: 10-Hour Count Value for the tens place of hours */
#define RTC_RHRAR_HR10_MASK                    (0x03)
#define RTC_RHRAR_HR1                     (4 <<  0) /* 01: 1-Hour Count Value for the ones place of hours */
#define RTC_RHRAR_HR1_MASK                     (0x0f)
#define RTC_BCNT2AR_OFFSET                0x0014
#define RTC_BCNT2AR                       (RTC_BASE + RTC_BCNT2AR_OFFSET)
#define RTC_BCNT2AR_BCNT2AR               (8 <<  0) /* 01: The BCNT2AR counter is a readable/writable 32-bit binary counter b23 to b16. */
#define RTC_BCNT2AR_BCNT2AR_MASK               (0xff)
#define RTC_RWKAR_OFFSET                  0x0016
#define RTC_RWKAR                         (RTC_BASE + RTC_RWKAR_OFFSET)
#define RTC_RWKAR_ENB                     (1 <<  7) /* 80: Compare enable */
#define RTC_RWKAR_DAYW                    (3 <<  0) /* 01: Day-of-Week Counting */
#define RTC_RWKAR_DAYW_MASK                    (0x07)
#define RTC_BCNT3AR_OFFSET                0x0016
#define RTC_BCNT3AR                       (RTC_BASE + RTC_BCNT3AR_OFFSET)
#define RTC_BCNT3AR_BCNT3AR               (8 <<  0) /* 01: The BCNT3AR counter is a readable/writable 32-bit binary counter b31 to b24. */
#define RTC_BCNT3AR_BCNT3AR_MASK               (0xff)
#define RTC_RDAYAR_OFFSET                 0x0018
#define RTC_RDAYAR                        (RTC_BASE + RTC_RDAYAR_OFFSET)
#define RTC_RDAYAR_ENB                    (1 <<  7) /* 80: Compare enable */
#define RTC_RDAYAR_DATE10                 (2 <<  4) /* 10: 10 Days Value for the tens place of days */
#define RTC_RDAYAR_DATE10_MASK                 (0x03)
#define RTC_RDAYAR_DATE1                  (4 <<  0) /* 01: 1 Day Value for the ones place of days */
#define RTC_RDAYAR_DATE1_MASK                  (0x0f)
#define RTC_BCNT0AER_OFFSET               0x0018
#define RTC_BCNT0AER                      (RTC_BASE + RTC_BCNT0AER_OFFSET)
#define RTC_BCNT0AER_ENB                  (8 <<  0) /* 01: The BCNT0AER register is a readable/writable register for setting the alarm enable corresponding to 32-bit binary counter b7 to b0. */
#define RTC_BCNT0AER_ENB_MASK                  (0xff)
#define RTC_RMONAR_OFFSET                 0x001a
#define RTC_RMONAR                        (RTC_BASE + RTC_RMONAR_OFFSET)
#define RTC_RMONAR_ENB                    (1 <<  7) /* 80: Compare enable */
#define RTC_RMONAR_MON10                  (1 <<  4) /* 10: 10 Months Value for the tens place of months */
#define RTC_RMONAR_MON1                   (4 <<  0) /* 01: 1 Month Value for the ones place of months */
#define RTC_RMONAR_MON1_MASK                   (0x0f)
#define RTC_BCNT1AER_OFFSET               0x001a
#define RTC_BCNT1AER                      (RTC_BASE + RTC_BCNT1AER_OFFSET)
#define RTC_BCNT1AER_ENB                  (8 <<  0) /* 01: The BCNT1AER register is a readable/writable register for setting the alarm enable corresponding to 32-bit binary counter b15 to b8. */
#define RTC_BCNT1AER_ENB_MASK                  (0xff)
#define RTC_RYRAR_OFFSET                  0x001c
#define RTC_RYRAR                         (RTC_BASE + RTC_RYRAR_OFFSET)
#define RTC_RYRAR_YR10                    (4 <<  4) /* 10: 10 Years Value for the tens place of years */
#define RTC_RYRAR_YR10_MASK                    (0x0f)
#define RTC_RYRAR_YR1                     (4 <<  0) /* 01: 1 Year Value for the ones place of years */
#define RTC_RYRAR_YR1_MASK                     (0x0f)
#define RTC_BCNT2AER_OFFSET               0x001c
#define RTC_BCNT2AER                      (RTC_BASE + RTC_BCNT2AER_OFFSET)
#define RTC_BCNT2AER_ENB                  (8 <<  0) /* 01: The BCNT2AER register is a readable/writable register for setting the alarm enable corresponding to 32-bit binary counter b23 to b16. */
#define RTC_BCNT2AER_ENB_MASK                  (0xff)
#define RTC_RYRAREN_OFFSET                0x001e
#define RTC_RYRAREN                       (RTC_BASE + RTC_RYRAREN_OFFSET)
#define RTC_RYRAREN_ENB                   (1 <<  7) /* 80: Compare enable */
#define RTC_BCNT3AER_OFFSET               0x001e
#define RTC_BCNT3AER                      (RTC_BASE + RTC_BCNT3AER_OFFSET)
#define RTC_BCNT3AER_ENB                  (8 <<  0) /* 01: The BCNT3AER register is a readable/writable register for setting the alarm enable corresponding to 32-bit binary counter b31 to b24. */
#define RTC_BCNT3AER_ENB_MASK                  (0xff)
#define RTC_RCR1_OFFSET                   0x0022
#define RTC_RCR1                          (RTC_BASE + RTC_RCR1_OFFSET)
#define RTC_RCR1_PES                      (4 <<  4) /* 10: Periodic Interrupt Select */
#define RTC_RCR1_PES_MASK                      (0x0f)
#define RTC_RCR1_RTCOS                    (1 <<  3) /* 08: RTCOUT Output Select */
#define RTC_RCR1_PIE                      (1 <<  2) /* 04: Periodic Interrupt Enable */
#define RTC_RCR1_CIE                      (1 <<  1) /* 02: Carry Interrupt Enable */
#define RTC_RCR1_AIE                      (1 <<  0) /* 01: Alarm Interrupt Enable */
#define RTC_RCR2_OFFSET                   0x0024
#define RTC_RCR2                          (RTC_BASE + RTC_RCR2_OFFSET)
#define RTC_RCR2_CNTMD                    (1 <<  7) /* 80: Count Mode Select */
#define RTC_RCR2_HR24                     (1 <<  6) /* 40: Hours Mode */
#define RTC_RCR2_AADJP                    (1 <<  5) /* 20: Automatic Adjustment Period Select (When the LOCO clock is selected, the setting of this bit is disabled.) */
#define RTC_RCR2_AADJE                    (1 <<  4) /* 10: Automatic Adjustment Enable (When the LOCO clock is selected, the setting of this bit is disabled.) */
#define RTC_RCR2_RTCOE                    (1 <<  3) /* 08: RTCOUT Output Enable */
#define RTC_RCR2_ADJ30                    (1 <<  2) /* 04: 30-Second Adjustment */
#define RTC_RCR2_RESET                    (1 <<  1) /* 02: RTC Software Reset */
#define RTC_RCR2_START                    (1 <<  0) /* 01: Start */
#define RTC_RCR4_OFFSET                   0x0028
#define RTC_RCR4                          (RTC_BASE + RTC_RCR4_OFFSET)
#define RTC_RCR4_RCKSEL                   (1 <<  0) /* 01: Count Source Select */
#define RTC_RFRH_OFFSET                   0x002a
#define RTC_RFRH                          (RTC_BASE + RTC_RFRH_OFFSET)
#define RTC_RFRH_RFC16                    (1 <<  0) /* 01: Frequency Comparison Value (b16) To generate the operating clock from the LOCOclock, this bit sets the comparison value of the 128-Hz clock cycle. */
#define RTC_RFRL_OFFSET                   0x002c
#define RTC_RFRL                          (RTC_BASE + RTC_RFRL_OFFSET)
#define RTC_RFRL_RFC                      (16 <<  0) /* 01: Frequency Comparison Value(b15-b0) To generate the operating clock from the main clock, this bit sets the comparison value of the 128-Hz clock cycle. */
#define RTC_RFRL_RFC_MASK                      (0xffff)
#define RTC_RADJ_OFFSET                   0x002e
#define RTC_RADJ                          (RTC_BASE + RTC_RADJ_OFFSET)
#define RTC_RADJ_PMADJ                    (2 <<  6) /* 40: Plus-Minus */
#define RTC_RADJ_PMADJ_MASK                    (0x03)
#define RTC_RADJ_ADJ                      (6 <<  0) /* 01: Adjustment Value These bits specify the adjustment value from the prescaler. */
#define RTC_RADJ_ADJ_MASK                      (0x3f)
#define RTC_RTCCR_SIZE                    3
#define RTC_RTCCR_OFFSET                  0x0040
#define RTC_RTCCR(p)                      (RTC_BASE + RTC_RTCCR_OFFSET + (p)*0x0002)
#define RTC_RTCCR_TCNF                    (2 <<  4) /* 10: Time Capture Noise Filter Control */
#define RTC_RTCCR_TCNF_MASK                    (0x03)
#define RTC_RTCCR_TCST                    (1 <<  2) /* 04: Time Capture Status */
#define RTC_RTCCR_TCCT                    (2 <<  0) /* 01: Time Capture Control */
#define RTC_RTCCR_TCCT_MASK                    (0x03)
#define RTC_RSECCP_SIZE                   3
#define RTC_RSECCP_OFFSET                 0x0052
#define RTC_RSECCP(p)                     (RTC_BASE + RTC_RSECCP_OFFSET + (p)*0x0010)
#define RTC_RSECCP_SEC10                  (3 <<  4) /* 10: 10-Second Capture Capture value for the tens place of seconds */
#define RTC_RSECCP_SEC10_MASK                  (0x07)
#define RTC_RSECCP_SEC1                   (4 <<  0) /* 01: 1-Second Capture Capture value for the ones place of seconds */
#define RTC_RSECCP_SEC1_MASK                   (0x0f)
#define RTC_BCNT0CP_SIZE                  3
#define RTC_BCNT0CP_OFFSET                0x0052
#define RTC_BCNT0CP(p)                    (RTC_BASE + RTC_BCNT0CP_OFFSET + (p)*0x0010)
#define RTC_BCNT0CP_BCNT0CP               (8 <<  0) /* 01: BCNT0CP is a read-only register that captures the BCNT0 value when a time capture event is detected. */
#define RTC_BCNT0CP_BCNT0CP_MASK               (0xff)
#define RTC_RMINCP_SIZE                   3
#define RTC_RMINCP_OFFSET                 0x0054
#define RTC_RMINCP(p)                     (RTC_BASE + RTC_RMINCP_OFFSET + (p)*0x0010)
#define RTC_RMINCP_MIN10                  (3 <<  4) /* 10: 10-Minute Capture Capture value for the tens place of minutes */
#define RTC_RMINCP_MIN10_MASK                  (0x07)
#define RTC_RMINCP_MIN1                   (4 <<  0) /* 01: 1-Minute Capture Capture value for the ones place of minutes */
#define RTC_RMINCP_MIN1_MASK                   (0x0f)
#define RTC_BCNT1CP_SIZE                  3
#define RTC_BCNT1CP_OFFSET                0x0054
#define RTC_BCNT1CP(p)                    (RTC_BASE + RTC_BCNT1CP_OFFSET + (p)*0x0010)
#define RTC_BCNT1CP_BCNT1CP               (8 <<  0) /* 01: BCNT1CP is a read-only register that captures the BCNT1 value when a time capture event is detected. */
#define RTC_BCNT1CP_BCNT1CP_MASK               (0xff)
#define RTC_RHRCP_SIZE                    3
#define RTC_RHRCP_OFFSET                  0x0056
#define RTC_RHRCP(p)                      (RTC_BASE + RTC_RHRCP_OFFSET + (p)*0x0010)
#define RTC_RHRCP_PM                      (1 <<  6) /* 40: A.m./p.m. select for time counter setting. */
#define RTC_RHRCP_HR10                    (2 <<  4) /* 10: 10-Minute Capture Capture value for the tens place of minutes */
#define RTC_RHRCP_HR10_MASK                    (0x03)
#define RTC_RHRCP_HR1                     (4 <<  0) /* 01: 1-Minute Capture Capture value for the ones place of minutes */
#define RTC_RHRCP_HR1_MASK                     (0x0f)
#define RTC_BCNT2CP_SIZE                  3
#define RTC_BCNT2CP_OFFSET                0x0056
#define RTC_BCNT2CP(p)                    (RTC_BASE + RTC_BCNT2CP_OFFSET + (p)*0x0010)
#define RTC_BCNT2CP_BCNT2CP               (8 <<  0) /* 01: BCNT2CP is a read-only register that captures the BCNT2 value when a time capture event is detected. */
#define RTC_BCNT2CP_BCNT2CP_MASK               (0xff)
#define RTC_RDAYCP_SIZE                   3
#define RTC_RDAYCP_OFFSET                 0x005a
#define RTC_RDAYCP(p)                     (RTC_BASE + RTC_RDAYCP_OFFSET + (p)*0x0010)
#define RTC_RDAYCP_DATE10                 (2 <<  4) /* 10: 10-Day Capture Capture value for the tens place of minutes */
#define RTC_RDAYCP_DATE10_MASK                 (0x03)
#define RTC_RDAYCP_DATE1                  (4 <<  0) /* 01: 1-Day Capture Capture value for the ones place of minutes */
#define RTC_RDAYCP_DATE1_MASK                  (0x0f)
#define RTC_BCNT3CP_SIZE                  3
#define RTC_BCNT3CP_OFFSET                0x005a
#define RTC_BCNT3CP(p)                    (RTC_BASE + RTC_BCNT3CP_OFFSET + (p)*0x0010)
#define RTC_BCNT3CP_BCNT3CP               (8 <<  0) /* 01: BCNT3CP is a read-only register that captures the BCNT3 value when a time capture event is detected. */
#define RTC_BCNT3CP_BCNT3CP_MASK               (0xff)
#define RTC_RMONCP_SIZE                   3
#define RTC_RMONCP_OFFSET                 0x005c
#define RTC_RMONCP(p)                     (RTC_BASE + RTC_RMONCP_OFFSET + (p)*0x0010)
#define RTC_RMONCP_MON10                  (1 <<  4) /* 10: 10-Month Capture Capture value for the tens place of months */
#define RTC_RMONCP_MON1                   (4 <<  0) /* 01: 1-Month Capture Capture value for the ones place of months */
#define RTC_RMONCP_MON1_MASK                   (0x0f)

