leocafonso/svdtoheaders/demo/h/ra4m1_reg.h
/* SCI0 - Serial Communication Interface 0 */
#define SCI0_BASE                         0x40070000
#define SCI0_SMR_OFFSET                   0x0000
#define SCI0_SMR                          (SCI0_BASE + SCI0_SMR_OFFSET)
#define SCI0_SMR_CM                       (1 <<  7) /* 80: Communication Mode */
#define SCI0_SMR_CHR                      (1 <<  6) /* 40: Character Length (Valid only in asynchronous mode) */
#define SCI0_SMR_PE                       (1 <<  5) /* 20: Parity Enable (Valid only in asynchronous mode) */
#define SCI0_SMR_PM                       (1 <<  4) /* 10: Parity Mode (Valid only when the PE bit is 1) */
#define SCI0_SMR_STOP                     (1 <<  3) /* 08: Stop Bit Length (Valid only in asynchronous mode) */
#define SCI0_SMR_MP                       (1 <<  2) /* 04: Multi-Processor Mode (Valid only in asynchronous mode) */
#define SCI0_SMR_CKS                      (2 <<  0) /* 01: Clock Select */
#define SCI0_SMR_CKS_MASK                      (0x03)
#define SCI0_SMR_SMCI_OFFSET              0x0000
#define SCI0_SMR_SMCI                     (SCI0_BASE + SCI0_SMR_SMCI_OFFSET)
#define SCI0_SMR_SMCI_GM                  (1 <<  7) /* 80: GSM Mode */
#define SCI0_SMR_SMCI_BLK                 (1 <<  6) /* 40: Block Transfer Mode */
#define SCI0_SMR_SMCI_PE                  (1 <<  5) /* 20: Parity Enable (Valid only in asynchronous mode) */
#define SCI0_SMR_SMCI_PM                  (1 <<  4) /* 10: Parity Mode (Valid only when the PE bit is 1) */
#define SCI0_SMR_SMCI_BCP                 (2 <<  2) /* 04: Base Clock Pulse (Valid only in asynchronous mode) */
#define SCI0_SMR_SMCI_BCP_MASK                 (0x03)
#define SCI0_SMR_SMCI_CKS                 (2 <<  0) /* 01: Clock Select */
#define SCI0_SMR_SMCI_CKS_MASK                 (0x03)
#define SCI0_BRR_OFFSET                   0x0001
#define SCI0_BRR                          (SCI0_BASE + SCI0_BRR_OFFSET)
#define SCI0_BRR_BRR                      (8 <<  0) /* 01: BRR is an 8-bit register that adjusts the bit rate. */
#define SCI0_BRR_BRR_MASK                      (0xff)
#define SCI0_SCR_OFFSET                   0x0002
#define SCI0_SCR                          (SCI0_BASE + SCI0_SCR_OFFSET)
#define SCI0_SCR_TIE                      (1 <<  7) /* 80: Transmit Interrupt Enable */
#define SCI0_SCR_RIE                      (1 <<  6) /* 40: Receive Interrupt Enable */
#define SCI0_SCR_TE                       (1 <<  5) /* 20: Transmit Enable */
#define SCI0_SCR_RE                       (1 <<  4) /* 10: Receive Enable */
#define SCI0_SCR_MPIE                     (1 <<  3) /* 08: Multi-Processor Interrupt Enable (Valid in asynchronous mode when SMR.MP = 1) */
#define SCI0_SCR_TEIE                     (1 <<  2) /* 04: Transmit End Interrupt Enable */
#define SCI0_SCR_CKE                      (2 <<  0) /* 01: Clock Enable */
#define SCI0_SCR_CKE_MASK                      (0x03)
#define SCI0_SCR_SMCI_OFFSET              0x0002
#define SCI0_SCR_SMCI                     (SCI0_BASE + SCI0_SCR_SMCI_OFFSET)
#define SCI0_SCR_SMCI_TIE                 (1 <<  7) /* 80: Transmit Interrupt Enable */
#define SCI0_SCR_SMCI_RIE                 (1 <<  6) /* 40: Receive Interrupt Enable */
#define SCI0_SCR_SMCI_TE                  (1 <<  5) /* 20: Transmit Enable */
#define SCI0_SCR_SMCI_RE                  (1 <<  4) /* 10: Receive Enable */
#define SCI0_SCR_SMCI_MPIE                (1 <<  3) /* 08: Multi-Processor Interrupt Enable */
#define SCI0_SCR_SMCI_TEIE                (1 <<  2) /* 04: Transmit End Interrupt Enable */
#define SCI0_SCR_SMCI_CKE                 (2 <<  0) /* 01: Clock Enable */
#define SCI0_SCR_SMCI_CKE_MASK                 (0x03)
#define SCI0_TDR_OFFSET                   0x0003
#define SCI0_TDR                          (SCI0_BASE + SCI0_TDR_OFFSET)
#define SCI0_TDR_TDR                      (8 <<  0) /* 01: TDR is an 8-bit register that stores transmit data. */
#define SCI0_TDR_TDR_MASK                      (0xff)
#define SCI0_SSR_OFFSET                   0x0004
#define SCI0_SSR                          (SCI0_BASE + SCI0_SSR_OFFSET)
#define SCI0_SSR_TDRE                     (1 <<  7) /* 80: Transmit Data Empty Flag */
#define SCI0_SSR_RDRF                     (1 <<  6) /* 40: Receive Data Full Flag */
#define SCI0_SSR_ORER                     (1 <<  5) /* 20: Overrun Error Flag */
#define SCI0_SSR_FER                      (1 <<  4) /* 10: Framing Error Flag */
#define SCI0_SSR_PER                      (1 <<  3) /* 08: Parity Error Flag */
#define SCI0_SSR_TEND                     (1 <<  2) /* 04: Transmit End Flag */
#define SCI0_SSR_MPB                      (1 <<  1) /* 02: Multi-Processor */
#define SCI0_SSR_MPBT                     (1 <<  0) /* 01: Multi-Processor Bit Transfer */
#define SCI0_SSR_FIFO_OFFSET              0x0004
#define SCI0_SSR_FIFO                     (SCI0_BASE + SCI0_SSR_FIFO_OFFSET)
#define SCI0_SSR_FIFO_TDFE                (1 <<  7) /* 80: Transmit FIFO data empty flag */
#define SCI0_SSR_FIFO_RDF                 (1 <<  6) /* 40: Receive FIFO data full flag */
#define SCI0_SSR_FIFO_ORER                (1 <<  5) /* 20: Overrun Error Flag */
#define SCI0_SSR_FIFO_FER                 (1 <<  4) /* 10: Framing Error Flag */
#define SCI0_SSR_FIFO_PER                 (1 <<  3) /* 08: Parity Error Flag */
#define SCI0_SSR_FIFO_TEND                (1 <<  2) /* 04: Transmit End Flag */
#define SCI0_SSR_FIFO_DR                  (1 <<  0) /* 01: Receive Data Ready flag (Valid only in asynchronous mode(including multi-processor) and FIFO selected) */
#define SCI0_SSR_SMCI_OFFSET              0x0004
#define SCI0_SSR_SMCI                     (SCI0_BASE + SCI0_SSR_SMCI_OFFSET)
#define SCI0_SSR_SMCI_TDRE                (1 <<  7) /* 80: Transmit Data Empty Flag */
#define SCI0_SSR_SMCI_RDRF                (1 <<  6) /* 40: Receive Data Full Flag */
#define SCI0_SSR_SMCI_ORER                (1 <<  5) /* 20: Overrun Error Flag */
#define SCI0_SSR_SMCI_ERS                 (1 <<  4) /* 10: Error Signal Status Flag */
#define SCI0_SSR_SMCI_PER                 (1 <<  3) /* 08: Parity Error Flag */
#define SCI0_SSR_SMCI_TEND                (1 <<  2) /* 04: Transmit End Flag */
#define SCI0_SSR_SMCI_MPB                 (1 <<  1) /* 02: Multi-Processor This bit should be 0 in smart card interface mode. */
#define SCI0_SSR_SMCI_MPBT                (1 <<  0) /* 01: Multi-Processor Bit Transfer This bit should be 0 in smart card interface mode. */
#define SCI0_RDR_OFFSET                   0x0005
#define SCI0_RDR                          (SCI0_BASE + SCI0_RDR_OFFSET)
#define SCI0_RDR_RDR                      (8 <<  0) /* 01: RDR is an 8-bit register that stores receive data. */
#define SCI0_RDR_RDR_MASK                      (0xff)
#define SCI0_SCMR_OFFSET                  0x0006
#define SCI0_SCMR                         (SCI0_BASE + SCI0_SCMR_OFFSET)
#define SCI0_SCMR_BCP2                    (1 <<  7) /* 80: Base Clock Pulse 2 Selects the number of base clock cycles in combination with the SMR.BCP[1:0] bits */
#define SCI0_SCMR_CHR1                    (1 <<  4) /* 10: Character Length 1 (Only valid in asynchronous mode) */
#define SCI0_SCMR_SDIR                    (1 <<  3) /* 08: Transmitted/Received Data Transfer Direction NOTE: The setting is invalid and a fixed data length of 8 bits is used in modes other than asynchronous mode. Set this bit to 1 if operation is to be in simple I2C mode. */
#define SCI0_SCMR_SINV                    (1 <<  2) /* 04: Transmitted/Received Data Invert Set this bit to 0 if operation is to be in simple I2C mode. */
#define SCI0_SCMR_SMIF                    (1 <<  0) /* 01: Smart Card Interface Mode Select */
#define SCI0_SEMR_OFFSET                  0x0007
#define SCI0_SEMR                         (SCI0_BASE + SCI0_SEMR_OFFSET)
#define SCI0_SEMR_RXDESEL                 (1 <<  7) /* 80: Asynchronous Start Bit Edge Detection Select (Valid only in asynchronous mode) */
#define SCI0_SEMR_BGDM                    (1 <<  6) /* 40: Baud Rate Generator Double-Speed Mode Select (Only valid the CKE[1] bit in SCR is 0 in asynchronous mode). */
#define SCI0_SEMR_NFEN                    (1 <<  5) /* 20: Digital Noise Filter Function Enable (The NFEN bit should be 0 without simple I2C mode and asynchronous mode.) In asynchronous mode, for RXDn input only. In simple I2C mode, for RXDn/TxDn input. */
#define SCI0_SEMR_ABCS                    (1 <<  4) /* 10: Asynchronous Mode Base Clock Select (Valid only in asynchronous mode) */
#define SCI0_SEMR_ABCSE                   (1 <<  3) /* 08: Asynchronous Mode Extended Base Clock Select 1 (Valid only in asynchronous mode and SCR.CKE[1]=0) */
#define SCI0_SEMR_BRME                    (1 <<  2) /* 04: Bit Rate Modulation Enable */
#define SCI0_SNFR_OFFSET                  0x0008
#define SCI0_SNFR                         (SCI0_BASE + SCI0_SNFR_OFFSET)
#define SCI0_SNFR_NFCS                    (3 <<  0) /* 01: Noise Filter Clock Select */
#define SCI0_SNFR_NFCS_MASK                    (0x07)
#define SCI0_SIMR1_OFFSET                 0x0009
#define SCI0_SIMR1                        (SCI0_BASE + SCI0_SIMR1_OFFSET)
#define SCI0_SIMR1_IICDL                  (5 <<  3) /* 08: SDA Delay Output Select Cycles below are of the clock signal from the on-chip baud rate generator. */
#define SCI0_SIMR1_IICDL_MASK                  (0x1f)
#define SCI0_SIMR1_IICM                   (1 <<  0) /* 01: Simple I2C Mode Select */
#define SCI0_SIMR2_OFFSET                 0x000a
#define SCI0_SIMR2                        (SCI0_BASE + SCI0_SIMR2_OFFSET)
#define SCI0_SIMR2_IICACKT                (1 <<  5) /* 20: ACK Transmission Data */
#define SCI0_SIMR2_IICCSC                 (1 <<  1) /* 02: Clock Synchronization */
#define SCI0_SIMR2_IICINTM                (1 <<  0) /* 01: I2C Interrupt Mode Select */
#define SCI0_SIMR3_OFFSET                 0x000b
#define SCI0_SIMR3                        (SCI0_BASE + SCI0_SIMR3_OFFSET)
#define SCI0_SIMR3_IICSCLS                (2 <<  6) /* 40: SCL Output Select */
#define SCI0_SIMR3_IICSCLS_MASK                (0x03)
#define SCI0_SIMR3_IICSDAS                (2 <<  4) /* 10: SDA Output Select */
#define SCI0_SIMR3_IICSDAS_MASK                (0x03)
#define SCI0_SIMR3_IICSTIF                (1 <<  3) /* 08: Issuing of Start, Restart, or Stop Condition Completed Flag (When 0 is written to IICSTIF, it is cleared to 0.) */
#define SCI0_SIMR3_IICSTPREQ              (1 <<  2) /* 04: Stop Condition Generation */
#define SCI0_SIMR3_IICRSTAREQ             (1 <<  1) /* 02: Restart Condition Generation */
#define SCI0_SIMR3_IICSTAREQ              (1 <<  0) /* 01: Start Condition Generation */
#define SCI0_SISR_OFFSET                  0x000c
#define SCI0_SISR                         (SCI0_BASE + SCI0_SISR_OFFSET)
#define SCI0_SISR_IICACKR                 (1 <<  0) /* 01: ACK Reception Data Flag */
#define SCI0_SPMR_OFFSET                  0x000d
#define SCI0_SPMR                         (SCI0_BASE + SCI0_SPMR_OFFSET)
#define SCI0_SPMR_CKPH                    (1 <<  7) /* 80: Clock Phase Select */
#define SCI0_SPMR_CKPOL                   (1 <<  6) /* 40: Clock Polarity Select */
#define SCI0_SPMR_MFF                     (1 <<  4) /* 10: Mode Fault Flag */
#define SCI0_SPMR_MSS                     (1 <<  2) /* 04: Master Slave Select */
#define SCI0_SPMR_CTSE                    (1 <<  1) /* 02: CTS Enable */
#define SCI0_SPMR_SSE                     (1 <<  0) /* 01: SSn Pin Function Enable */
#define SCI0_TDRHL_OFFSET                 0x000e
#define SCI0_TDRHL                        (SCI0_BASE + SCI0_TDRHL_OFFSET)
#define SCI0_TDRHL_TDRHL                  (16 <<  0) /* 01: TDRHL is a 16-bit register that stores transmit data. */
#define SCI0_TDRHL_TDRHL_MASK                  (0xffff)
#define SCI0_FTDRHL_OFFSET                0x000e
#define SCI0_FTDRHL                       (SCI0_BASE + SCI0_FTDRHL_OFFSET)
#define SCI0_FTDRHL_MPBT                  (1 <<  9) /* 200: Multi-processor transfer bit flag (Valid only in asynchronous mode and SMR.MP=1 and FIFO selected) */
#define SCI0_FTDRHL_TDAT                  (9 <<  0) /* 01: Serial transmit data (Valid only in asynchronous mode(including multi-processor) or clock synchronous mode, and FIFO selected) */
#define SCI0_FTDRHL_TDAT_MASK                  (0x1ff)
#define SCI0_FTDRH_OFFSET                 0x000e
#define SCI0_FTDRH                        (SCI0_BASE + SCI0_FTDRH_OFFSET)
#define SCI0_FTDRH_MPBT                   (1 <<  1) /* 02: Multi-processor transfer bit flag (Valid only in asynchronous mode and SMR.MP=1 and FIFO selected) */
#define SCI0_FTDRH_TDATH                  (1 <<  0) /* 01: Serial transmit data (b8) (Valid only in asynchronous mode(including multi-processor) or clock synchronous mode, and FIFO selected) */
#define SCI0_FTDRL_OFFSET                 0x000f
#define SCI0_FTDRL                        (SCI0_BASE + SCI0_FTDRL_OFFSET)
#define SCI0_FTDRL_TDATL                  (8 <<  0) /* 01: Serial transmit data(b7-b0) (Valid only in asynchronous mode(including multi-processor) or clock synchronous mode, and FIFO selected) */
#define SCI0_FTDRL_TDATL_MASK                  (0xff)
#define SCI0_RDRHL_OFFSET                 0x0010
#define SCI0_RDRHL                        (SCI0_BASE + SCI0_RDRHL_OFFSET)
#define SCI0_RDRHL_RDRHL                  (16 <<  0) /* 01: RDRHL is an 16-bit register that stores receive data. */
#define SCI0_RDRHL_RDRHL_MASK                  (0xffff)
#define SCI0_FRDRHL_OFFSET                0x0010
#define SCI0_FRDRHL                       (SCI0_BASE + SCI0_FRDRHL_OFFSET)
#define SCI0_FRDRHL_RDF                   (1 << 14) /* 4000: Receive FIFO data full flag (It is same as SSR.RDF) */
#define SCI0_FRDRHL_ORER                  (1 << 13) /* 2000: Overrun error flag (It is same as SSR.ORER) */
#define SCI0_FRDRHL_FER                   (1 << 12) /* 1000: Framing error flag */
#define SCI0_FRDRHL_PER                   (1 << 11) /* 800: Parity error flag */
#define SCI0_FRDRHL_DR                    (1 << 10) /* 400: Receive data ready flag (It is same as SSR.DR) */
#define SCI0_FRDRHL_MPB                   (1 <<  9) /* 200: Multi-processor bit flag (Valid only in asynchronous mode with SMR.MP=1 and FIFO selected) It can read multi-processor bit corresponded to serial receive data(RDATA[8:0]) */
#define SCI0_FRDRHL_RDAT                  (9 <<  0) /* 01: Serial receive data (Valid only in asynchronous mode(including multi-processor) or clock synchronous mode, and FIFO selected) */
#define SCI0_FRDRHL_RDAT_MASK                  (0x1ff)
#define SCI0_FRDRH_OFFSET                 0x0010
#define SCI0_FRDRH                        (SCI0_BASE + SCI0_FRDRH_OFFSET)
#define SCI0_FRDRH_RDF                    (1 <<  6) /* 40: Receive FIFO data full flag (It is same as SSR.RDF) */
#define SCI0_FRDRH_ORER                   (1 <<  5) /* 20: Overrun error flag (It is same as SSR.ORER) */
#define SCI0_FRDRH_FER                    (1 <<  4) /* 10: Framing error flag */
#define SCI0_FRDRH_PER                    (1 <<  3) /* 08: Parity error flag */
#define SCI0_FRDRH_DR                     (1 <<  2) /* 04: Receive data ready flag (It is same as SSR.DR) */
#define SCI0_FRDRH_MPB                    (1 <<  1) /* 02: Multi-processor bit flag (Valid only in asynchronous mode with SMR.MP=1 and FIFO selected) It can read multi-processor bit corresponded to serial receive data(RDATA[8:0]) */
#define SCI0_FRDRH_RDATH                  (1 <<  0) /* 01: Serial receive data(b8) (Valid only in asynchronous mode(including multi-processor) or clock synchronous mode, and FIFO selected) */
#define SCI0_FRDRL_OFFSET                 0x0011
#define SCI0_FRDRL                        (SCI0_BASE + SCI0_FRDRL_OFFSET)
#define SCI0_FRDRL_RDATL                  (8 <<  0) /* 01: Serial receive data (Valid only in asynchronous mode(including multi-processor) or clock synchronous mode, and FIFO selected) NOTE: When reading both of FRDRH register and FRDRL register, please read by an order of the FRDRH register and the FRDRL register. */
#define SCI0_FRDRL_RDATL_MASK                  (0xff)
#define SCI0_MDDR_OFFSET                  0x0012
#define SCI0_MDDR                         (SCI0_BASE + SCI0_MDDR_OFFSET)
#define SCI0_MDDR_MDDR                    (8 <<  0) /* 01: MDDR corrects the bit rate adjusted by the BRR register. */
#define SCI0_MDDR_MDDR_MASK                    (0xff)
#define SCI0_DCCR_OFFSET                  0x0013
#define SCI0_DCCR                         (SCI0_BASE + SCI0_DCCR_OFFSET)
#define SCI0_DCCR_DCME                    (1 <<  7) /* 80: Data Compare Match Enable (Valid only in asynchronous mode(including multi-processor) */
#define SCI0_DCCR_IDSEL                   (1 <<  6) /* 40: ID frame select (Valid only in asynchronous mode(including multi-processor) */
#define SCI0_DCCR_DFER                    (1 <<  4) /* 10: Data Compare Match Framing Error Flag */
#define SCI0_DCCR_DPER                    (1 <<  3) /* 08: Data Compare Match Parity Error Flag */
#define SCI0_DCCR_DCMF                    (1 <<  0) /* 01: Data Compare Match Flag */
#define SCI0_FCR_OFFSET                   0x0014
#define SCI0_FCR                          (SCI0_BASE + SCI0_FCR_OFFSET)
#define SCI0_FCR_RSTRG                    (4 << 12) /* 1000: RTS Output Active Trigger Number Select (Valid only in asynchronous mode(including multi-processor) or clock synchronous mode) */
#define SCI0_FCR_RSTRG_MASK                    (0x0f)
#define SCI0_FCR_RTRG                     (4 <<  8) /* 100: Receive FIFO data trigger number (Valid only in asynchronous mode(including multi-processor) or clock synchronous mode) */
#define SCI0_FCR_RTRG_MASK                     (0x0f)
#define SCI0_FCR_TTRG                     (4 <<  4) /* 10: Transmit FIFO data trigger number (Valid only in asynchronous mode(including multi-processor) or clock synchronous mode) */
#define SCI0_FCR_TTRG_MASK                     (0x0f)
#define SCI0_FCR_DRES                     (1 <<  3) /* 08: Receive data ready error select bit (When detecting a reception data ready, the interrupt request is selected.) */
#define SCI0_FCR_TFRST                    (1 <<  2) /* 04: Transmit FIFO Data Register Reset (Valid only in FCR.FM=1) */
#define SCI0_FCR_RFRST                    (1 <<  1) /* 02: Receive FIFO Data Register Reset (Valid only in FCR.FM=1) */
#define SCI0_FCR_FM                       (1 <<  0) /* 01: FIFO Mode Select (Valid only in asynchronous mode(including multi-processor) or clock synchronous mode) */
#define SCI0_FDR_OFFSET                   0x0016
#define SCI0_FDR                          (SCI0_BASE + SCI0_FDR_OFFSET)
#define SCI0_FDR_T                        (5 <<  8) /* 100: Transmit FIFO Data Count Indicate the quantity of non-transmit data stored in FTDRH and FTDRL (Valid only in asynchronous mode(including multi-processor) or clock synchronous mode, while FCR.FM=1) */
#define SCI0_FDR_T_MASK                        (0x1f)
#define SCI0_FDR_R                        (5 <<  0) /* 01: Receive FIFO Data Count Indicate the quantity of receive data stored in FRDRH and FRDRL (Valid only in asynchronous mode(including multi-processor) or clock synchronous mode, while FCR.FM=1) */
#define SCI0_FDR_R_MASK                        (0x1f)
#define SCI0_LSR_OFFSET                   0x0018
#define SCI0_LSR                          (SCI0_BASE + SCI0_LSR_OFFSET)
#define SCI0_LSR_PNUM                     (5 <<  8) /* 100: Parity Error Count Indicates the quantity of data with a parity error among the receive data stored in the receive FIFO data register (FRDRH and FRDRL). */
#define SCI0_LSR_PNUM_MASK                     (0x1f)
#define SCI0_LSR_FNUM                     (5 <<  2) /* 04: Framing Error Count Indicates the quantity of data with a framing error among the receive data stored in the receive FIFO data register (FRDRH and FRDRL). */
#define SCI0_LSR_FNUM_MASK                     (0x1f)
#define SCI0_LSR_ORER                     (1 <<  0) /* 01: Overrun Error Flag (Valid only in asynchronous mode(including multi-processor) or clock synchronous mode, and FIFO selected) */
#define SCI0_CDR_OFFSET                   0x001a
#define SCI0_CDR                          (SCI0_BASE + SCI0_CDR_OFFSET)
#define SCI0_CDR_CMPD                     (9 <<  0) /* 01: Compare Match Data Compare data pattern for address match wake-up function */
#define SCI0_CDR_CMPD_MASK                     (0x1ff)
#define SCI0_SPTR_OFFSET                  0x001c
#define SCI0_SPTR                         (SCI0_BASE + SCI0_SPTR_OFFSET)
#define SCI0_SPTR_SPB2IO                  (1 <<  2) /* 04: Serial port break I/O bit (It's selected whether the value of SPB2DT is output to TxD terminal.) */
#define SCI0_SPTR_SPB2DT                  (1 <<  1) /* 02: Serial port break data select bit (The output level of TxD terminal is selected when SCR.TE = 0.) */
#define SCI0_SPTR_RXDMON                  (1 <<  0) /* 01: Serial input data monitor bit (The state of the RXD terminal is shown.) */

