leocafonso/svdtoheaders/demo/h/ra4m1_reg.h
/* No registers defined for peripheral SCI1. Using those of SCI0. */
#define SCI1_BASE                         0x40070020
#define SCI1_SMR_OFFSET                   SCI0_SMR_OFFSET
#define SCI1_SMR                          SCI0_SMR
#define SCI1_SMR_CM                       SCI0_SMR_CM
#define SCI1_SMR_CHR                      SCI0_SMR_CHR
#define SCI1_SMR_PE                       SCI0_SMR_PE
#define SCI1_SMR_PM                       SCI0_SMR_PM
#define SCI1_SMR_STOP                     SCI0_SMR_STOP
#define SCI1_SMR_MP                       SCI0_SMR_MP
#define SCI1_SMR_CKS                      SCI0_SMR_CKS
#define SCI1_SMR_CKS_MASK                 SCI0_SMR_CKS_MASK
#define SCI1_SMR_SMCI_OFFSET              SCI0_SMR_SMCI_OFFSET
#define SCI1_SMR_SMCI                     SCI0_SMR_SMCI
#define SCI1_SMR_SMCI_GM                  SCI0_SMR_SMCI_GM
#define SCI1_SMR_SMCI_BLK                 SCI0_SMR_SMCI_BLK
#define SCI1_SMR_SMCI_PE                  SCI0_SMR_SMCI_PE
#define SCI1_SMR_SMCI_PM                  SCI0_SMR_SMCI_PM
#define SCI1_SMR_SMCI_BCP                 SCI0_SMR_SMCI_BCP
#define SCI1_SMR_SMCI_BCP_MASK            SCI0_SMR_SMCI_BCP_MASK
#define SCI1_SMR_SMCI_CKS                 SCI0_SMR_SMCI_CKS
#define SCI1_SMR_SMCI_CKS_MASK            SCI0_SMR_SMCI_CKS_MASK
#define SCI1_BRR_OFFSET                   SCI0_BRR_OFFSET
#define SCI1_BRR                          SCI0_BRR
#define SCI1_BRR_BRR                      SCI0_BRR_BRR
#define SCI1_BRR_BRR_MASK                 SCI0_BRR_BRR_MASK
#define SCI1_SCR_OFFSET                   SCI0_SCR_OFFSET
#define SCI1_SCR                          SCI0_SCR
#define SCI1_SCR_TIE                      SCI0_SCR_TIE
#define SCI1_SCR_RIE                      SCI0_SCR_RIE
#define SCI1_SCR_TE                       SCI0_SCR_TE
#define SCI1_SCR_RE                       SCI0_SCR_RE
#define SCI1_SCR_MPIE                     SCI0_SCR_MPIE
#define SCI1_SCR_TEIE                     SCI0_SCR_TEIE
#define SCI1_SCR_CKE                      SCI0_SCR_CKE
#define SCI1_SCR_CKE_MASK                 SCI0_SCR_CKE_MASK
#define SCI1_SCR_SMCI_OFFSET              SCI0_SCR_SMCI_OFFSET
#define SCI1_SCR_SMCI                     SCI0_SCR_SMCI
#define SCI1_SCR_SMCI_TIE                 SCI0_SCR_SMCI_TIE
#define SCI1_SCR_SMCI_RIE                 SCI0_SCR_SMCI_RIE
#define SCI1_SCR_SMCI_TE                  SCI0_SCR_SMCI_TE
#define SCI1_SCR_SMCI_RE                  SCI0_SCR_SMCI_RE
#define SCI1_SCR_SMCI_MPIE                SCI0_SCR_SMCI_MPIE
#define SCI1_SCR_SMCI_TEIE                SCI0_SCR_SMCI_TEIE
#define SCI1_SCR_SMCI_CKE                 SCI0_SCR_SMCI_CKE
#define SCI1_SCR_SMCI_CKE_MASK            SCI0_SCR_SMCI_CKE_MASK
#define SCI1_TDR_OFFSET                   SCI0_TDR_OFFSET
#define SCI1_TDR                          SCI0_TDR
#define SCI1_TDR_TDR                      SCI0_TDR_TDR
#define SCI1_TDR_TDR_MASK                 SCI0_TDR_TDR_MASK
#define SCI1_SSR_OFFSET                   SCI0_SSR_OFFSET
#define SCI1_SSR                          SCI0_SSR
#define SCI1_SSR_TDRE                     SCI0_SSR_TDRE
#define SCI1_SSR_RDRF                     SCI0_SSR_RDRF
#define SCI1_SSR_ORER                     SCI0_SSR_ORER
#define SCI1_SSR_FER                      SCI0_SSR_FER
#define SCI1_SSR_PER                      SCI0_SSR_PER
#define SCI1_SSR_TEND                     SCI0_SSR_TEND
#define SCI1_SSR_MPB                      SCI0_SSR_MPB
#define SCI1_SSR_MPBT                     SCI0_SSR_MPBT
#define SCI1_SSR_FIFO_OFFSET              SCI0_SSR_FIFO_OFFSET
#define SCI1_SSR_FIFO                     SCI0_SSR_FIFO
#define SCI1_SSR_FIFO_TDFE                SCI0_SSR_FIFO_TDFE
#define SCI1_SSR_FIFO_RDF                 SCI0_SSR_FIFO_RDF
#define SCI1_SSR_FIFO_ORER                SCI0_SSR_FIFO_ORER
#define SCI1_SSR_FIFO_FER                 SCI0_SSR_FIFO_FER
#define SCI1_SSR_FIFO_PER                 SCI0_SSR_FIFO_PER
#define SCI1_SSR_FIFO_TEND                SCI0_SSR_FIFO_TEND
#define SCI1_SSR_FIFO_DR                  SCI0_SSR_FIFO_DR
#define SCI1_SSR_SMCI_OFFSET              SCI0_SSR_SMCI_OFFSET
#define SCI1_SSR_SMCI                     SCI0_SSR_SMCI
#define SCI1_SSR_SMCI_TDRE                SCI0_SSR_SMCI_TDRE
#define SCI1_SSR_SMCI_RDRF                SCI0_SSR_SMCI_RDRF
#define SCI1_SSR_SMCI_ORER                SCI0_SSR_SMCI_ORER
#define SCI1_SSR_SMCI_ERS                 SCI0_SSR_SMCI_ERS
#define SCI1_SSR_SMCI_PER                 SCI0_SSR_SMCI_PER
#define SCI1_SSR_SMCI_TEND                SCI0_SSR_SMCI_TEND
#define SCI1_SSR_SMCI_MPB                 SCI0_SSR_SMCI_MPB
#define SCI1_SSR_SMCI_MPBT                SCI0_SSR_SMCI_MPBT
#define SCI1_RDR_OFFSET                   SCI0_RDR_OFFSET
#define SCI1_RDR                          SCI0_RDR
#define SCI1_RDR_RDR                      SCI0_RDR_RDR
#define SCI1_RDR_RDR_MASK                 SCI0_RDR_RDR_MASK
#define SCI1_SCMR_OFFSET                  SCI0_SCMR_OFFSET
#define SCI1_SCMR                         SCI0_SCMR
#define SCI1_SCMR_BCP2                    SCI0_SCMR_BCP2
#define SCI1_SCMR_CHR1                    SCI0_SCMR_CHR1
#define SCI1_SCMR_SDIR                    SCI0_SCMR_SDIR
#define SCI1_SCMR_SINV                    SCI0_SCMR_SINV
#define SCI1_SCMR_SMIF                    SCI0_SCMR_SMIF
#define SCI1_SEMR_OFFSET                  SCI0_SEMR_OFFSET
#define SCI1_SEMR                         SCI0_SEMR
#define SCI1_SEMR_RXDESEL                 SCI0_SEMR_RXDESEL
#define SCI1_SEMR_BGDM                    SCI0_SEMR_BGDM
#define SCI1_SEMR_NFEN                    SCI0_SEMR_NFEN
#define SCI1_SEMR_ABCS                    SCI0_SEMR_ABCS
#define SCI1_SEMR_ABCSE                   SCI0_SEMR_ABCSE
#define SCI1_SEMR_BRME                    SCI0_SEMR_BRME
#define SCI1_SNFR_OFFSET                  SCI0_SNFR_OFFSET
#define SCI1_SNFR                         SCI0_SNFR
#define SCI1_SNFR_NFCS                    SCI0_SNFR_NFCS
#define SCI1_SNFR_NFCS_MASK               SCI0_SNFR_NFCS_MASK
#define SCI1_SIMR1_OFFSET                 SCI0_SIMR1_OFFSET
#define SCI1_SIMR1                        SCI0_SIMR1
#define SCI1_SIMR1_IICDL                  SCI0_SIMR1_IICDL
#define SCI1_SIMR1_IICDL_MASK             SCI0_SIMR1_IICDL_MASK
#define SCI1_SIMR1_IICM                   SCI0_SIMR1_IICM
#define SCI1_SIMR2_OFFSET                 SCI0_SIMR2_OFFSET
#define SCI1_SIMR2                        SCI0_SIMR2
#define SCI1_SIMR2_IICACKT                SCI0_SIMR2_IICACKT
#define SCI1_SIMR2_IICCSC                 SCI0_SIMR2_IICCSC
#define SCI1_SIMR2_IICINTM                SCI0_SIMR2_IICINTM
#define SCI1_SIMR3_OFFSET                 SCI0_SIMR3_OFFSET
#define SCI1_SIMR3                        SCI0_SIMR3
#define SCI1_SIMR3_IICSCLS                SCI0_SIMR3_IICSCLS
#define SCI1_SIMR3_IICSCLS_MASK           SCI0_SIMR3_IICSCLS_MASK
#define SCI1_SIMR3_IICSDAS                SCI0_SIMR3_IICSDAS
#define SCI1_SIMR3_IICSDAS_MASK           SCI0_SIMR3_IICSDAS_MASK
#define SCI1_SIMR3_IICSTIF                SCI0_SIMR3_IICSTIF
#define SCI1_SIMR3_IICSTPREQ              SCI0_SIMR3_IICSTPREQ
#define SCI1_SIMR3_IICRSTAREQ             SCI0_SIMR3_IICRSTAREQ
#define SCI1_SIMR3_IICSTAREQ              SCI0_SIMR3_IICSTAREQ
#define SCI1_SISR_OFFSET                  SCI0_SISR_OFFSET
#define SCI1_SISR                         SCI0_SISR
#define SCI1_SISR_IICACKR                 SCI0_SISR_IICACKR
#define SCI1_SPMR_OFFSET                  SCI0_SPMR_OFFSET
#define SCI1_SPMR                         SCI0_SPMR
#define SCI1_SPMR_CKPH                    SCI0_SPMR_CKPH
#define SCI1_SPMR_CKPOL                   SCI0_SPMR_CKPOL
#define SCI1_SPMR_MFF                     SCI0_SPMR_MFF
#define SCI1_SPMR_MSS                     SCI0_SPMR_MSS
#define SCI1_SPMR_CTSE                    SCI0_SPMR_CTSE
#define SCI1_SPMR_SSE                     SCI0_SPMR_SSE
#define SCI1_TDRHL_OFFSET                 SCI0_TDRHL_OFFSET
#define SCI1_TDRHL                        SCI0_TDRHL
#define SCI1_TDRHL_TDRHL                  SCI0_TDRHL_TDRHL
#define SCI1_TDRHL_TDRHL_MASK             SCI0_TDRHL_TDRHL_MASK
#define SCI1_FTDRHL_OFFSET                SCI0_FTDRHL_OFFSET
#define SCI1_FTDRHL                       SCI0_FTDRHL
#define SCI1_FTDRHL_MPBT                  SCI0_FTDRHL_MPBT
#define SCI1_FTDRHL_TDAT                  SCI0_FTDRHL_TDAT
#define SCI1_FTDRHL_TDAT_MASK             SCI0_FTDRHL_TDAT_MASK
#define SCI1_FTDRH_OFFSET                 SCI0_FTDRH_OFFSET
#define SCI1_FTDRH                        SCI0_FTDRH
#define SCI1_FTDRH_MPBT                   SCI0_FTDRH_MPBT
#define SCI1_FTDRH_TDATH                  SCI0_FTDRH_TDATH
#define SCI1_FTDRL_OFFSET                 SCI0_FTDRL_OFFSET
#define SCI1_FTDRL                        SCI0_FTDRL
#define SCI1_FTDRL_TDATL                  SCI0_FTDRL_TDATL
#define SCI1_FTDRL_TDATL_MASK             SCI0_FTDRL_TDATL_MASK
#define SCI1_RDRHL_OFFSET                 SCI0_RDRHL_OFFSET
#define SCI1_RDRHL                        SCI0_RDRHL
#define SCI1_RDRHL_RDRHL                  SCI0_RDRHL_RDRHL
#define SCI1_RDRHL_RDRHL_MASK             SCI0_RDRHL_RDRHL_MASK
#define SCI1_FRDRHL_OFFSET                SCI0_FRDRHL_OFFSET
#define SCI1_FRDRHL                       SCI0_FRDRHL
#define SCI1_FRDRHL_RDF                   SCI0_FRDRHL_RDF
#define SCI1_FRDRHL_ORER                  SCI0_FRDRHL_ORER
#define SCI1_FRDRHL_FER                   SCI0_FRDRHL_FER
#define SCI1_FRDRHL_PER                   SCI0_FRDRHL_PER
#define SCI1_FRDRHL_DR                    SCI0_FRDRHL_DR
#define SCI1_FRDRHL_MPB                   SCI0_FRDRHL_MPB
#define SCI1_FRDRHL_RDAT                  SCI0_FRDRHL_RDAT
#define SCI1_FRDRHL_RDAT_MASK             SCI0_FRDRHL_RDAT_MASK
#define SCI1_FRDRH_OFFSET                 SCI0_FRDRH_OFFSET
#define SCI1_FRDRH                        SCI0_FRDRH
#define SCI1_FRDRH_RDF                    SCI0_FRDRH_RDF
#define SCI1_FRDRH_ORER                   SCI0_FRDRH_ORER
#define SCI1_FRDRH_FER                    SCI0_FRDRH_FER
#define SCI1_FRDRH_PER                    SCI0_FRDRH_PER
#define SCI1_FRDRH_DR                     SCI0_FRDRH_DR
#define SCI1_FRDRH_MPB                    SCI0_FRDRH_MPB
#define SCI1_FRDRH_RDATH                  SCI0_FRDRH_RDATH
#define SCI1_FRDRL_OFFSET                 SCI0_FRDRL_OFFSET
#define SCI1_FRDRL                        SCI0_FRDRL
#define SCI1_FRDRL_RDATL                  SCI0_FRDRL_RDATL
#define SCI1_FRDRL_RDATL_MASK             SCI0_FRDRL_RDATL_MASK
#define SCI1_MDDR_OFFSET                  SCI0_MDDR_OFFSET
#define SCI1_MDDR                         SCI0_MDDR
#define SCI1_MDDR_MDDR                    SCI0_MDDR_MDDR
#define SCI1_MDDR_MDDR_MASK               SCI0_MDDR_MDDR_MASK
#define SCI1_DCCR_OFFSET                  SCI0_DCCR_OFFSET
#define SCI1_DCCR                         SCI0_DCCR
#define SCI1_DCCR_DCME                    SCI0_DCCR_DCME
#define SCI1_DCCR_IDSEL                   SCI0_DCCR_IDSEL
#define SCI1_DCCR_DFER                    SCI0_DCCR_DFER
#define SCI1_DCCR_DPER                    SCI0_DCCR_DPER
#define SCI1_DCCR_DCMF                    SCI0_DCCR_DCMF
#define SCI1_FCR_OFFSET                   SCI0_FCR_OFFSET
#define SCI1_FCR                          SCI0_FCR
#define SCI1_FCR_RSTRG                    SCI0_FCR_RSTRG
#define SCI1_FCR_RSTRG_MASK               SCI0_FCR_RSTRG_MASK
#define SCI1_FCR_RTRG                     SCI0_FCR_RTRG
#define SCI1_FCR_RTRG_MASK                SCI0_FCR_RTRG_MASK
#define SCI1_FCR_TTRG                     SCI0_FCR_TTRG
#define SCI1_FCR_TTRG_MASK                SCI0_FCR_TTRG_MASK
#define SCI1_FCR_DRES                     SCI0_FCR_DRES
#define SCI1_FCR_TFRST                    SCI0_FCR_TFRST
#define SCI1_FCR_RFRST                    SCI0_FCR_RFRST
#define SCI1_FCR_FM                       SCI0_FCR_FM
#define SCI1_FDR_OFFSET                   SCI0_FDR_OFFSET
#define SCI1_FDR                          SCI0_FDR
#define SCI1_FDR_T                        SCI0_FDR_T
#define SCI1_FDR_T_MASK                   SCI0_FDR_T_MASK
#define SCI1_FDR_R                        SCI0_FDR_R
#define SCI1_FDR_R_MASK                   SCI0_FDR_R_MASK
#define SCI1_LSR_OFFSET                   SCI0_LSR_OFFSET
#define SCI1_LSR                          SCI0_LSR
#define SCI1_LSR_PNUM                     SCI0_LSR_PNUM
#define SCI1_LSR_PNUM_MASK                SCI0_LSR_PNUM_MASK
#define SCI1_LSR_FNUM                     SCI0_LSR_FNUM
#define SCI1_LSR_FNUM_MASK                SCI0_LSR_FNUM_MASK
#define SCI1_LSR_ORER                     SCI0_LSR_ORER
#define SCI1_CDR_OFFSET                   SCI0_CDR_OFFSET
#define SCI1_CDR                          SCI0_CDR
#define SCI1_CDR_CMPD                     SCI0_CDR_CMPD
#define SCI1_CDR_CMPD_MASK                SCI0_CDR_CMPD_MASK
#define SCI1_SPTR_OFFSET                  SCI0_SPTR_OFFSET
#define SCI1_SPTR                         SCI0_SPTR
#define SCI1_SPTR_SPB2IO                  SCI0_SPTR_SPB2IO
#define SCI1_SPTR_SPB2DT                  SCI0_SPTR_SPB2DT
#define SCI1_SPTR_RXDMON                  SCI0_SPTR_RXDMON

