leocafonso/svdtoheaders/demo/h/ra4m1_reg.h
/* SCI2 - Serial Communication Interface 2 */
#define SCI2_BASE                         0x40070040
#define SCI2_SMR_OFFSET                   0x0000
#define SCI2_SMR                          (SCI2_BASE + SCI2_SMR_OFFSET)
#define SCI2_SMR_CM                       (1 <<  7) /* 80: Communication Mode */
#define SCI2_SMR_CHR                      (1 <<  6) /* 40: Character Length (Valid only in asynchronous mode) */
#define SCI2_SMR_PE                       (1 <<  5) /* 20: Parity Enable (Valid only in asynchronous mode) */
#define SCI2_SMR_PM                       (1 <<  4) /* 10: Parity Mode (Valid only when the PE bit is 1) */
#define SCI2_SMR_STOP                     (1 <<  3) /* 08: Stop Bit Length (Valid only in asynchronous mode) */
#define SCI2_SMR_MP                       (1 <<  2) /* 04: Multi-Processor Mode (Valid only in asynchronous mode) */
#define SCI2_SMR_CKS                      (2 <<  0) /* 01: Clock Select */
#define SCI2_SMR_CKS_MASK                      (0x03)
#define SCI2_SMR_SMCI_OFFSET              0x0000
#define SCI2_SMR_SMCI                     (SCI2_BASE + SCI2_SMR_SMCI_OFFSET)
#define SCI2_SMR_SMCI_GM                  (1 <<  7) /* 80: GSM Mode */
#define SCI2_SMR_SMCI_BLK                 (1 <<  6) /* 40: Block Transfer Mode */
#define SCI2_SMR_SMCI_PE                  (1 <<  5) /* 20: Parity Enable (Valid only in asynchronous mode) */
#define SCI2_SMR_SMCI_PM                  (1 <<  4) /* 10: Parity Mode (Valid only when the PE bit is 1) */
#define SCI2_SMR_SMCI_BCP                 (2 <<  2) /* 04: Base Clock Pulse (Valid only in asynchronous mode) */
#define SCI2_SMR_SMCI_BCP_MASK                 (0x03)
#define SCI2_SMR_SMCI_CKS                 (2 <<  0) /* 01: Clock Select */
#define SCI2_SMR_SMCI_CKS_MASK                 (0x03)
#define SCI2_BRR_OFFSET                   0x0001
#define SCI2_BRR                          (SCI2_BASE + SCI2_BRR_OFFSET)
#define SCI2_BRR_BRR                      (8 <<  0) /* 01: BRR is an 8-bit register that adjusts the bit rate. */
#define SCI2_BRR_BRR_MASK                      (0xff)
#define SCI2_SCR_OFFSET                   0x0002
#define SCI2_SCR                          (SCI2_BASE + SCI2_SCR_OFFSET)
#define SCI2_SCR_TIE                      (1 <<  7) /* 80: Transmit Interrupt Enable */
#define SCI2_SCR_RIE                      (1 <<  6) /* 40: Receive Interrupt Enable */
#define SCI2_SCR_TE                       (1 <<  5) /* 20: Transmit Enable */
#define SCI2_SCR_RE                       (1 <<  4) /* 10: Receive Enable */
#define SCI2_SCR_MPIE                     (1 <<  3) /* 08: Multi-Processor Interrupt Enable (Valid in asynchronous mode when SMR.MP = 1) */
#define SCI2_SCR_TEIE                     (1 <<  2) /* 04: Transmit End Interrupt Enable */
#define SCI2_SCR_CKE                      (2 <<  0) /* 01: Clock Enable */
#define SCI2_SCR_CKE_MASK                      (0x03)
#define SCI2_SCR_SMCI_OFFSET              0x0002
#define SCI2_SCR_SMCI                     (SCI2_BASE + SCI2_SCR_SMCI_OFFSET)
#define SCI2_SCR_SMCI_TIE                 (1 <<  7) /* 80: Transmit Interrupt Enable */
#define SCI2_SCR_SMCI_RIE                 (1 <<  6) /* 40: Receive Interrupt Enable */
#define SCI2_SCR_SMCI_TE                  (1 <<  5) /* 20: Transmit Enable */
#define SCI2_SCR_SMCI_RE                  (1 <<  4) /* 10: Receive Enable */
#define SCI2_SCR_SMCI_MPIE                (1 <<  3) /* 08: Multi-Processor Interrupt Enable */
#define SCI2_SCR_SMCI_TEIE                (1 <<  2) /* 04: Transmit End Interrupt Enable */
#define SCI2_SCR_SMCI_CKE                 (2 <<  0) /* 01: Clock Enable */
#define SCI2_SCR_SMCI_CKE_MASK                 (0x03)
#define SCI2_TDR_OFFSET                   0x0003
#define SCI2_TDR                          (SCI2_BASE + SCI2_TDR_OFFSET)
#define SCI2_TDR_TDR                      (8 <<  0) /* 01: TDR is an 8-bit register that stores transmit data. */
#define SCI2_TDR_TDR_MASK                      (0xff)
#define SCI2_SSR_OFFSET                   0x0004
#define SCI2_SSR                          (SCI2_BASE + SCI2_SSR_OFFSET)
#define SCI2_SSR_TDRE                     (1 <<  7) /* 80: Transmit Data Empty Flag */
#define SCI2_SSR_RDRF                     (1 <<  6) /* 40: Receive Data Full Flag */
#define SCI2_SSR_ORER                     (1 <<  5) /* 20: Overrun Error Flag */
#define SCI2_SSR_FER                      (1 <<  4) /* 10: Framing Error Flag */
#define SCI2_SSR_PER                      (1 <<  3) /* 08: Parity Error Flag */
#define SCI2_SSR_TEND                     (1 <<  2) /* 04: Transmit End Flag */
#define SCI2_SSR_MPB                      (1 <<  1) /* 02: Multi-Processor */
#define SCI2_SSR_MPBT                     (1 <<  0) /* 01: Multi-Processor Bit Transfer */
#define SCI2_SSR_SMCI_OFFSET              0x0004
#define SCI2_SSR_SMCI                     (SCI2_BASE + SCI2_SSR_SMCI_OFFSET)
#define SCI2_SSR_SMCI_TDRE                (1 <<  7) /* 80: Transmit Data Empty Flag */
#define SCI2_SSR_SMCI_RDRF                (1 <<  6) /* 40: Receive Data Full Flag */
#define SCI2_SSR_SMCI_ORER                (1 <<  5) /* 20: Overrun Error Flag */
#define SCI2_SSR_SMCI_ERS                 (1 <<  4) /* 10: Error Signal Status Flag */
#define SCI2_SSR_SMCI_PER                 (1 <<  3) /* 08: Parity Error Flag */
#define SCI2_SSR_SMCI_TEND                (1 <<  2) /* 04: Transmit End Flag */
#define SCI2_SSR_SMCI_MPB                 (1 <<  1) /* 02: Multi-Processor This bit should be 0 in smart card interface mode. */
#define SCI2_SSR_SMCI_MPBT                (1 <<  0) /* 01: Multi-Processor Bit Transfer This bit should be 0 in smart card interface mode. */
#define SCI2_RDR_OFFSET                   0x0005
#define SCI2_RDR                          (SCI2_BASE + SCI2_RDR_OFFSET)
#define SCI2_RDR_RDR                      (8 <<  0) /* 01: RDR is an 8-bit register that stores receive data. */
#define SCI2_RDR_RDR_MASK                      (0xff)
#define SCI2_SCMR_OFFSET                  0x0006
#define SCI2_SCMR                         (SCI2_BASE + SCI2_SCMR_OFFSET)
#define SCI2_SCMR_BCP2                    (1 <<  7) /* 80: Base Clock Pulse 2 Selects the number of base clock cycles in combination with the SMR.BCP[1:0] bits */
#define SCI2_SCMR_CHR1                    (1 <<  4) /* 10: Character Length 1 (Only valid in asynchronous mode) */
#define SCI2_SCMR_SDIR                    (1 <<  3) /* 08: Transmitted/Received Data Transfer Direction NOTE: The setting is invalid and a fixed data length of 8 bits is used in modes other than asynchronous mode. Set this bit to 1 if operation is to be in simple I2C mode. */
#define SCI2_SCMR_SINV                    (1 <<  2) /* 04: Transmitted/Received Data Invert Set this bit to 0 if operation is to be in simple I2C mode. */
#define SCI2_SCMR_SMIF                    (1 <<  0) /* 01: Smart Card Interface Mode Select */
#define SCI2_SEMR_OFFSET                  0x0007
#define SCI2_SEMR                         (SCI2_BASE + SCI2_SEMR_OFFSET)
#define SCI2_SEMR_RXDESEL                 (1 <<  7) /* 80: Asynchronous Start Bit Edge Detection Select (Valid only in asynchronous mode) */
#define SCI2_SEMR_BGDM                    (1 <<  6) /* 40: Baud Rate Generator Double-Speed Mode Select (Only valid the CKE[1] bit in SCR is 0 in asynchronous mode). */
#define SCI2_SEMR_NFEN                    (1 <<  5) /* 20: Digital Noise Filter Function Enable (The NFEN bit should be 0 without simple I2C mode and asynchronous mode.) In asynchronous mode, for RXDn input only. In simple I2C mode, for RXDn/TxDn input. */
#define SCI2_SEMR_ABCS                    (1 <<  4) /* 10: Asynchronous Mode Base Clock Select (Valid only in asynchronous mode) */
#define SCI2_SEMR_ABCSE                   (1 <<  3) /* 08: Asynchronous Mode Extended Base Clock Select 1 (Valid only in asynchronous mode and SCR.CKE[1]=0) */
#define SCI2_SEMR_BRME                    (1 <<  2) /* 04: Bit Rate Modulation Enable */
#define SCI2_SNFR_OFFSET                  0x0008
#define SCI2_SNFR                         (SCI2_BASE + SCI2_SNFR_OFFSET)
#define SCI2_SNFR_NFCS                    (3 <<  0) /* 01: Noise Filter Clock Select */
#define SCI2_SNFR_NFCS_MASK                    (0x07)
#define SCI2_SIMR1_OFFSET                 0x0009
#define SCI2_SIMR1                        (SCI2_BASE + SCI2_SIMR1_OFFSET)
#define SCI2_SIMR1_IICDL                  (5 <<  3) /* 08: SDA Delay Output Select Cycles below are of the clock signal from the on-chip baud rate generator. */
#define SCI2_SIMR1_IICDL_MASK                  (0x1f)
#define SCI2_SIMR1_IICM                   (1 <<  0) /* 01: Simple I2C Mode Select */
#define SCI2_SIMR2_OFFSET                 0x000a
#define SCI2_SIMR2                        (SCI2_BASE + SCI2_SIMR2_OFFSET)
#define SCI2_SIMR2_IICACKT                (1 <<  5) /* 20: ACK Transmission Data */
#define SCI2_SIMR2_IICCSC                 (1 <<  1) /* 02: Clock Synchronization */
#define SCI2_SIMR2_IICINTM                (1 <<  0) /* 01: I2C Interrupt Mode Select */
#define SCI2_SIMR3_OFFSET                 0x000b
#define SCI2_SIMR3                        (SCI2_BASE + SCI2_SIMR3_OFFSET)
#define SCI2_SIMR3_IICSCLS                (2 <<  6) /* 40: SCL Output Select */
#define SCI2_SIMR3_IICSCLS_MASK                (0x03)
#define SCI2_SIMR3_IICSDAS                (2 <<  4) /* 10: SDA Output Select */
#define SCI2_SIMR3_IICSDAS_MASK                (0x03)
#define SCI2_SIMR3_IICSTIF                (1 <<  3) /* 08: Issuing of Start, Restart, or Stop Condition Completed Flag (When 0 is written to IICSTIF, it is cleared to 0.) */
#define SCI2_SIMR3_IICSTPREQ              (1 <<  2) /* 04: Stop Condition Generation */
#define SCI2_SIMR3_IICRSTAREQ             (1 <<  1) /* 02: Restart Condition Generation */
#define SCI2_SIMR3_IICSTAREQ              (1 <<  0) /* 01: Start Condition Generation */
#define SCI2_SISR_OFFSET                  0x000c
#define SCI2_SISR                         (SCI2_BASE + SCI2_SISR_OFFSET)
#define SCI2_SISR_IICACKR                 (1 <<  0) /* 01: ACK Reception Data Flag */
#define SCI2_SPMR_OFFSET                  0x000d
#define SCI2_SPMR                         (SCI2_BASE + SCI2_SPMR_OFFSET)
#define SCI2_SPMR_CKPH                    (1 <<  7) /* 80: Clock Phase Select */
#define SCI2_SPMR_CKPOL                   (1 <<  6) /* 40: Clock Polarity Select */
#define SCI2_SPMR_MFF                     (1 <<  4) /* 10: Mode Fault Flag */
#define SCI2_SPMR_MSS                     (1 <<  2) /* 04: Master Slave Select */
#define SCI2_SPMR_CTSE                    (1 <<  1) /* 02: CTS Enable */
#define SCI2_SPMR_SSE                     (1 <<  0) /* 01: SSn Pin Function Enable */
#define SCI2_TDRHL_OFFSET                 0x000e
#define SCI2_TDRHL                        (SCI2_BASE + SCI2_TDRHL_OFFSET)
#define SCI2_TDRHL_TDRHL                  (16 <<  0) /* 01: TDRHL is a 16-bit register that stores transmit data. */
#define SCI2_TDRHL_TDRHL_MASK                  (0xffff)
#define SCI2_RDRHL_OFFSET                 0x0010
#define SCI2_RDRHL                        (SCI2_BASE + SCI2_RDRHL_OFFSET)
#define SCI2_RDRHL_RDRHL                  (16 <<  0) /* 01: RDRHL is an 16-bit register that stores receive data. */
#define SCI2_RDRHL_RDRHL_MASK                  (0xffff)
#define SCI2_MDDR_OFFSET                  0x0012
#define SCI2_MDDR                         (SCI2_BASE + SCI2_MDDR_OFFSET)
#define SCI2_MDDR_MDDR                    (8 <<  0) /* 01: MDDR corrects the bit rate adjusted by the BRR register. */
#define SCI2_MDDR_MDDR_MASK                    (0xff)
#define SCI2_DCCR_OFFSET                  0x0013
#define SCI2_DCCR                         (SCI2_BASE + SCI2_DCCR_OFFSET)
#define SCI2_DCCR_DCME                    (1 <<  7) /* 80: Data Compare Match Enable (Valid only in asynchronous mode(including multi-processor) */
#define SCI2_DCCR_IDSEL                   (1 <<  6) /* 40: ID frame select (Valid only in asynchronous mode(including multi-processor) */
#define SCI2_DCCR_DFER                    (1 <<  4) /* 10: Data Compare Match Framing Error Flag */
#define SCI2_DCCR_DPER                    (1 <<  3) /* 08: Data Compare Match Parity Error Flag */
#define SCI2_DCCR_DCMF                    (1 <<  0) /* 01: Data Compare Match Flag */
#define SCI2_CDR_OFFSET                   0x001a
#define SCI2_CDR                          (SCI2_BASE + SCI2_CDR_OFFSET)
#define SCI2_CDR_CMPD                     (9 <<  0) /* 01: Compare Match Data Compare data pattern for address match wake-up function */
#define SCI2_CDR_CMPD_MASK                     (0x1ff)
#define SCI2_SPTR_OFFSET                  0x001c
#define SCI2_SPTR                         (SCI2_BASE + SCI2_SPTR_OFFSET)
#define SCI2_SPTR_SPB2IO                  (1 <<  2) /* 04: Serial port break I/O bit (It's selected whether the value of SPB2DT is output to TxD terminal.) */
#define SCI2_SPTR_SPB2DT                  (1 <<  1) /* 02: Serial port break data select bit (The output level of TxD terminal is selected when SCR.TE = 0.) */
#define SCI2_SPTR_RXDMON                  (1 <<  0) /* 01: Serial input data monitor bit (The state of the RXD terminal is shown.) */

/* No registers defined for peripheral SCI9. Using those of SCI2. */
#define SCI9_BASE                         0x40070120
#define SCI9_SMR_OFFSET                   SCI2_SMR_OFFSET
#define SCI9_SMR                          SCI2_SMR
#define SCI9_SMR_CM                       SCI2_SMR_CM
#define SCI9_SMR_CHR                      SCI2_SMR_CHR
#define SCI9_SMR_PE                       SCI2_SMR_PE
#define SCI9_SMR_PM                       SCI2_SMR_PM
#define SCI9_SMR_STOP                     SCI2_SMR_STOP
#define SCI9_SMR_MP                       SCI2_SMR_MP
#define SCI9_SMR_CKS                      SCI2_SMR_CKS
#define SCI9_SMR_CKS_MASK                 SCI2_SMR_CKS_MASK
#define SCI9_SMR_SMCI_OFFSET              SCI2_SMR_SMCI_OFFSET
#define SCI9_SMR_SMCI                     SCI2_SMR_SMCI
#define SCI9_SMR_SMCI_GM                  SCI2_SMR_SMCI_GM
#define SCI9_SMR_SMCI_BLK                 SCI2_SMR_SMCI_BLK
#define SCI9_SMR_SMCI_PE                  SCI2_SMR_SMCI_PE
#define SCI9_SMR_SMCI_PM                  SCI2_SMR_SMCI_PM
#define SCI9_SMR_SMCI_BCP                 SCI2_SMR_SMCI_BCP
#define SCI9_SMR_SMCI_BCP_MASK            SCI2_SMR_SMCI_BCP_MASK
#define SCI9_SMR_SMCI_CKS                 SCI2_SMR_SMCI_CKS
#define SCI9_SMR_SMCI_CKS_MASK            SCI2_SMR_SMCI_CKS_MASK
#define SCI9_BRR_OFFSET                   SCI2_BRR_OFFSET
#define SCI9_BRR                          SCI2_BRR
#define SCI9_BRR_BRR                      SCI2_BRR_BRR
#define SCI9_BRR_BRR_MASK                 SCI2_BRR_BRR_MASK
#define SCI9_SCR_OFFSET                   SCI2_SCR_OFFSET
#define SCI9_SCR                          SCI2_SCR
#define SCI9_SCR_TIE                      SCI2_SCR_TIE
#define SCI9_SCR_RIE                      SCI2_SCR_RIE
#define SCI9_SCR_TE                       SCI2_SCR_TE
#define SCI9_SCR_RE                       SCI2_SCR_RE
#define SCI9_SCR_MPIE                     SCI2_SCR_MPIE
#define SCI9_SCR_TEIE                     SCI2_SCR_TEIE
#define SCI9_SCR_CKE                      SCI2_SCR_CKE
#define SCI9_SCR_CKE_MASK                 SCI2_SCR_CKE_MASK
#define SCI9_SCR_SMCI_OFFSET              SCI2_SCR_SMCI_OFFSET
#define SCI9_SCR_SMCI                     SCI2_SCR_SMCI
#define SCI9_SCR_SMCI_TIE                 SCI2_SCR_SMCI_TIE
#define SCI9_SCR_SMCI_RIE                 SCI2_SCR_SMCI_RIE
#define SCI9_SCR_SMCI_TE                  SCI2_SCR_SMCI_TE
#define SCI9_SCR_SMCI_RE                  SCI2_SCR_SMCI_RE
#define SCI9_SCR_SMCI_MPIE                SCI2_SCR_SMCI_MPIE
#define SCI9_SCR_SMCI_TEIE                SCI2_SCR_SMCI_TEIE
#define SCI9_SCR_SMCI_CKE                 SCI2_SCR_SMCI_CKE
#define SCI9_SCR_SMCI_CKE_MASK            SCI2_SCR_SMCI_CKE_MASK
#define SCI9_TDR_OFFSET                   SCI2_TDR_OFFSET
#define SCI9_TDR                          SCI2_TDR
#define SCI9_TDR_TDR                      SCI2_TDR_TDR
#define SCI9_TDR_TDR_MASK                 SCI2_TDR_TDR_MASK
#define SCI9_SSR_OFFSET                   SCI2_SSR_OFFSET
#define SCI9_SSR                          SCI2_SSR
#define SCI9_SSR_TDRE                     SCI2_SSR_TDRE
#define SCI9_SSR_RDRF                     SCI2_SSR_RDRF
#define SCI9_SSR_ORER                     SCI2_SSR_ORER
#define SCI9_SSR_FER                      SCI2_SSR_FER
#define SCI9_SSR_PER                      SCI2_SSR_PER
#define SCI9_SSR_TEND                     SCI2_SSR_TEND
#define SCI9_SSR_MPB                      SCI2_SSR_MPB
#define SCI9_SSR_MPBT                     SCI2_SSR_MPBT
#define SCI9_SSR_SMCI_OFFSET              SCI2_SSR_SMCI_OFFSET
#define SCI9_SSR_SMCI                     SCI2_SSR_SMCI
#define SCI9_SSR_SMCI_TDRE                SCI2_SSR_SMCI_TDRE
#define SCI9_SSR_SMCI_RDRF                SCI2_SSR_SMCI_RDRF
#define SCI9_SSR_SMCI_ORER                SCI2_SSR_SMCI_ORER
#define SCI9_SSR_SMCI_ERS                 SCI2_SSR_SMCI_ERS
#define SCI9_SSR_SMCI_PER                 SCI2_SSR_SMCI_PER
#define SCI9_SSR_SMCI_TEND                SCI2_SSR_SMCI_TEND
#define SCI9_SSR_SMCI_MPB                 SCI2_SSR_SMCI_MPB
#define SCI9_SSR_SMCI_MPBT                SCI2_SSR_SMCI_MPBT
#define SCI9_RDR_OFFSET                   SCI2_RDR_OFFSET
#define SCI9_RDR                          SCI2_RDR
#define SCI9_RDR_RDR                      SCI2_RDR_RDR
#define SCI9_RDR_RDR_MASK                 SCI2_RDR_RDR_MASK
#define SCI9_SCMR_OFFSET                  SCI2_SCMR_OFFSET
#define SCI9_SCMR                         SCI2_SCMR
#define SCI9_SCMR_BCP2                    SCI2_SCMR_BCP2
#define SCI9_SCMR_CHR1                    SCI2_SCMR_CHR1
#define SCI9_SCMR_SDIR                    SCI2_SCMR_SDIR
#define SCI9_SCMR_SINV                    SCI2_SCMR_SINV
#define SCI9_SCMR_SMIF                    SCI2_SCMR_SMIF
#define SCI9_SEMR_OFFSET                  SCI2_SEMR_OFFSET
#define SCI9_SEMR                         SCI2_SEMR
#define SCI9_SEMR_RXDESEL                 SCI2_SEMR_RXDESEL
#define SCI9_SEMR_BGDM                    SCI2_SEMR_BGDM
#define SCI9_SEMR_NFEN                    SCI2_SEMR_NFEN
#define SCI9_SEMR_ABCS                    SCI2_SEMR_ABCS
#define SCI9_SEMR_ABCSE                   SCI2_SEMR_ABCSE
#define SCI9_SEMR_BRME                    SCI2_SEMR_BRME
#define SCI9_SNFR_OFFSET                  SCI2_SNFR_OFFSET
#define SCI9_SNFR                         SCI2_SNFR
#define SCI9_SNFR_NFCS                    SCI2_SNFR_NFCS
#define SCI9_SNFR_NFCS_MASK               SCI2_SNFR_NFCS_MASK
#define SCI9_SIMR1_OFFSET                 SCI2_SIMR1_OFFSET
#define SCI9_SIMR1                        SCI2_SIMR1
#define SCI9_SIMR1_IICDL                  SCI2_SIMR1_IICDL
#define SCI9_SIMR1_IICDL_MASK             SCI2_SIMR1_IICDL_MASK
#define SCI9_SIMR1_IICM                   SCI2_SIMR1_IICM
#define SCI9_SIMR2_OFFSET                 SCI2_SIMR2_OFFSET
#define SCI9_SIMR2                        SCI2_SIMR2
#define SCI9_SIMR2_IICACKT                SCI2_SIMR2_IICACKT
#define SCI9_SIMR2_IICCSC                 SCI2_SIMR2_IICCSC
#define SCI9_SIMR2_IICINTM                SCI2_SIMR2_IICINTM
#define SCI9_SIMR3_OFFSET                 SCI2_SIMR3_OFFSET
#define SCI9_SIMR3                        SCI2_SIMR3
#define SCI9_SIMR3_IICSCLS                SCI2_SIMR3_IICSCLS
#define SCI9_SIMR3_IICSCLS_MASK           SCI2_SIMR3_IICSCLS_MASK
#define SCI9_SIMR3_IICSDAS                SCI2_SIMR3_IICSDAS
#define SCI9_SIMR3_IICSDAS_MASK           SCI2_SIMR3_IICSDAS_MASK
#define SCI9_SIMR3_IICSTIF                SCI2_SIMR3_IICSTIF
#define SCI9_SIMR3_IICSTPREQ              SCI2_SIMR3_IICSTPREQ
#define SCI9_SIMR3_IICRSTAREQ             SCI2_SIMR3_IICRSTAREQ
#define SCI9_SIMR3_IICSTAREQ              SCI2_SIMR3_IICSTAREQ
#define SCI9_SISR_OFFSET                  SCI2_SISR_OFFSET
#define SCI9_SISR                         SCI2_SISR
#define SCI9_SISR_IICACKR                 SCI2_SISR_IICACKR
#define SCI9_SPMR_OFFSET                  SCI2_SPMR_OFFSET
#define SCI9_SPMR                         SCI2_SPMR
#define SCI9_SPMR_CKPH                    SCI2_SPMR_CKPH
#define SCI9_SPMR_CKPOL                   SCI2_SPMR_CKPOL
#define SCI9_SPMR_MFF                     SCI2_SPMR_MFF
#define SCI9_SPMR_MSS                     SCI2_SPMR_MSS
#define SCI9_SPMR_CTSE                    SCI2_SPMR_CTSE
#define SCI9_SPMR_SSE                     SCI2_SPMR_SSE
#define SCI9_TDRHL_OFFSET                 SCI2_TDRHL_OFFSET
#define SCI9_TDRHL                        SCI2_TDRHL
#define SCI9_TDRHL_TDRHL                  SCI2_TDRHL_TDRHL
#define SCI9_TDRHL_TDRHL_MASK             SCI2_TDRHL_TDRHL_MASK
#define SCI9_RDRHL_OFFSET                 SCI2_RDRHL_OFFSET
#define SCI9_RDRHL                        SCI2_RDRHL
#define SCI9_RDRHL_RDRHL                  SCI2_RDRHL_RDRHL
#define SCI9_RDRHL_RDRHL_MASK             SCI2_RDRHL_RDRHL_MASK
#define SCI9_MDDR_OFFSET                  SCI2_MDDR_OFFSET
#define SCI9_MDDR                         SCI2_MDDR
#define SCI9_MDDR_MDDR                    SCI2_MDDR_MDDR
#define SCI9_MDDR_MDDR_MASK               SCI2_MDDR_MDDR_MASK
#define SCI9_DCCR_OFFSET                  SCI2_DCCR_OFFSET
#define SCI9_DCCR                         SCI2_DCCR
#define SCI9_DCCR_DCME                    SCI2_DCCR_DCME
#define SCI9_DCCR_IDSEL                   SCI2_DCCR_IDSEL
#define SCI9_DCCR_DFER                    SCI2_DCCR_DFER
#define SCI9_DCCR_DPER                    SCI2_DCCR_DPER
#define SCI9_DCCR_DCMF                    SCI2_DCCR_DCMF
#define SCI9_CDR_OFFSET                   SCI2_CDR_OFFSET
#define SCI9_CDR                          SCI2_CDR
#define SCI9_CDR_CMPD                     SCI2_CDR_CMPD
#define SCI9_CDR_CMPD_MASK                SCI2_CDR_CMPD_MASK
#define SCI9_SPTR_OFFSET                  SCI2_SPTR_OFFSET
#define SCI9_SPTR                         SCI2_SPTR
#define SCI9_SPTR_SPB2IO                  SCI2_SPTR_SPB2IO
#define SCI9_SPTR_SPB2DT                  SCI2_SPTR_SPB2DT
#define SCI9_SPTR_RXDMON                  SCI2_SPTR_RXDMON

