leocafonso/svdtoheaders/demo/h/ra4m1_reg.h
/* SLCDC - Segment LCD Controller/Driver */
#define SLCDC_BASE                        0x40082000
#define SLCDC_LCDM0_OFFSET                0x0000
#define SLCDC_LCDM0                       (SLCDC_BASE + SLCDC_LCDM0_OFFSET)
#define SLCDC_LCDM0_MDSET                 (2 <<  6) /* 40: LCD drive voltage generator selection */
#define SLCDC_LCDM0_MDSET_MASK                 (0x03)
#define SLCDC_LCDM0_LWAVE                 (1 <<  5) /* 20: LCD display waveform selection */
#define SLCDC_LCDM0_LDTY                  (3 <<  2) /* 04: Time Slice of LCD Display Select */
#define SLCDC_LCDM0_LDTY_MASK                  (0x07)
#define SLCDC_LCDM0_LBAS                  (2 <<  0) /* 01: LCD Display Bias Method Select */
#define SLCDC_LCDM0_LBAS_MASK                  (0x03)
#define SLCDC_LCDM1_OFFSET                0x0001
#define SLCDC_LCDM1                       (SLCDC_BASE + SLCDC_LCDM1_OFFSET)
#define SLCDC_LCDM1_LCDON                 (1 <<  7) /* 80: LCD Display Enable/Disable */
#define SLCDC_LCDM1_SCOC                  (1 <<  6) /* 40: LCD Display Enable/Disable */
#define SLCDC_LCDM1_VLCON                 (1 <<  5) /* 20: Voltage boost circuit or capacitor split circuit operation enable/disable */
#define SLCDC_LCDM1_BLON                  (1 <<  4) /* 10: Display data area control */
#define SLCDC_LCDM1_LCDSEL                (1 <<  3) /* 08: Display data area control */
#define SLCDC_LCDM1_LCDVLM                (1 <<  0) /* 01: Voltage Boosting Pin Initial Value Switching Control */
#define SLCDC_LCDC0_OFFSET                0x0002
#define SLCDC_LCDC0                       (SLCDC_BASE + SLCDC_LCDC0_OFFSET)
#define SLCDC_LCDC0_LCDC                  (6 <<  0) /* 01: LCD clock (LCDCL) */
#define SLCDC_LCDC0_LCDC_MASK                  (0x3f)
#define SLCDC_VLCD_OFFSET                 0x0003
#define SLCDC_VLCD                        (SLCDC_BASE + SLCDC_VLCD_OFFSET)
#define SLCDC_VLCD_VLCD                   (5 <<  0) /* 01: Reference Voltage(Contrast Adjustment) Select */
#define SLCDC_VLCD_VLCD_MASK                   (0x1f)
#define SLCDC_SEG_SIZE                    38
#define SLCDC_SEG_OFFSET                  0x0100
#define SLCDC_SEG(p)                      (SLCDC_BASE + SLCDC_SEG_OFFSET + (p)*0x0001)
#define SLCDC_SEG_SEG                     (8 <<  0) /* 01: LCD Display Data */
#define SLCDC_SEG_SEG_MASK                     (0xff)

/* SPI0 - Serial Peripheral Interface 0 */
#define SPI0_BASE                         0x40072000
#define SPI0_SPCR_OFFSET                  0x0000
#define SPI0_SPCR                         (SPI0_BASE + SPI0_SPCR_OFFSET)
#define SPI0_SPCR_SPRIE                   (1 <<  7) /* 80: SPI Receive Buffer Full Interrupt Enable */
#define SPI0_SPCR_SPE                     (1 <<  6) /* 40: SPI Function Enable */
#define SPI0_SPCR_SPTIE                   (1 <<  5) /* 20: Transmit Buffer Empty Interrupt Enable */
#define SPI0_SPCR_SPEIE                   (1 <<  4) /* 10: SPI Error Interrupt Enable */
#define SPI0_SPCR_MSTR                    (1 <<  3) /* 08: SPI Master/Slave Mode Select */
#define SPI0_SPCR_MODFEN                  (1 <<  2) /* 04: Mode Fault Error Detection Enable */
#define SPI0_SPCR_TXMD                    (1 <<  1) /* 02: Communications Operating Mode Select */
#define SPI0_SPCR_SPMS                    (1 <<  0) /* 01: SPI Mode Select */
#define SPI0_SSLP_OFFSET                  0x0001
#define SPI0_SSLP                         (SPI0_BASE + SPI0_SSLP_OFFSET)
#define SPI0_SSLP_SSL3P                   (1 <<  3) /* 08: SSL3 Signal Polarity Setting */
#define SPI0_SSLP_SSL2P                   (1 <<  2) /* 04: SSL2 Signal Polarity Setting */
#define SPI0_SSLP_SSL1P                   (1 <<  1) /* 02: SSL1 Signal Polarity Setting */
#define SPI0_SSLP_SSL0P                   (1 <<  0) /* 01: SSL0 Signal Polarity Setting */
#define SPI0_SPPCR_OFFSET                 0x0002
#define SPI0_SPPCR                        (SPI0_BASE + SPI0_SPPCR_OFFSET)
#define SPI0_SPPCR_MOIFE                  (1 <<  5) /* 20: MOSI Idle Value Fixing Enable */
#define SPI0_SPPCR_MOIFV                  (1 <<  4) /* 10: MOSI Idle Fixed Value */
#define SPI0_SPPCR_SPLP2                  (1 <<  1) /* 02: RSPI Loopback 2 */
#define SPI0_SPPCR_SPLP                   (1 <<  0) /* 01: RSPI Loopback */
#define SPI0_SPSR_OFFSET                  0x0003
#define SPI0_SPSR                         (SPI0_BASE + SPI0_SPSR_OFFSET)
#define SPI0_SPSR_SPRF                    (1 <<  7) /* 80: SPI Receive Buffer Full Flag */
#define SPI0_SPSR_SPTEF                   (1 <<  5) /* 20: SPI Transmit Buffer Empty Flag */
#define SPI0_SPSR_UDRF                    (1 <<  4) /* 10: Underrun Error Flag (When MODF is 0, This bit is invalid.) */
#define SPI0_SPSR_PERF                    (1 <<  3) /* 08: Parity Error Flag */
#define SPI0_SPSR_MODF                    (1 <<  2) /* 04: Mode Fault Error Flag */
#define SPI0_SPSR_IDLNF                   (1 <<  1) /* 02: SPI Idle Flag */
#define SPI0_SPSR_OVRF                    (1 <<  0) /* 01: Overrun Error Flag */
#define SPI0_SPDR_OFFSET                  0x0004
#define SPI0_SPDR                         (SPI0_BASE + SPI0_SPDR_OFFSET)
#define SPI0_SPDR_SPDR                    (32 <<  0) /* 01: SPDR is the interface with the buffers that hold data for transmission and reception by the RSPI. When accessing in word (SPDCR.SPLW=1), access SPDR. */
#define SPI0_SPDR_SPDR_MASK                    (0xffffffff)
#define SPI0_SPDR_HA_OFFSET               0x0004
#define SPI0_SPDR_HA                      (SPI0_BASE + SPI0_SPDR_HA_OFFSET)
#define SPI0_SPDR_HA_SPDR_HA              (16 <<  0) /* 01: SPDR is the interface with the buffers that hold data for transmission and reception by the RSPI. When accessing in halfword (SPDCR.SPLW=0), access SPDR_HA. */
#define SPI0_SPDR_HA_SPDR_HA_MASK              (0xffff)
#define SPI0_SPBR_OFFSET                  0x000a
#define SPI0_SPBR                         (SPI0_BASE + SPI0_SPBR_OFFSET)
#define SPI0_SPBR_SPR                     (8 <<  0) /* 01: SPBR sets the bit rate in master mode. */
#define SPI0_SPBR_SPR_MASK                     (0xff)
#define SPI0_SPDCR_OFFSET                 0x000b
#define SPI0_SPDCR                        (SPI0_BASE + SPI0_SPDCR_OFFSET)
#define SPI0_SPDCR_SPLW                   (1 <<  5) /* 20: SPI Word Access/Halfword Access Specification */
#define SPI0_SPDCR_SPRDTD                 (1 <<  4) /* 10: RSPI Receive/Transmit Data Selection */
#define SPI0_SPCKD_OFFSET                 0x000c
#define SPI0_SPCKD                        (SPI0_BASE + SPI0_SPCKD_OFFSET)
#define SPI0_SPCKD_SCKDL                  (3 <<  0) /* 01: RSPCK Delay Setting */
#define SPI0_SPCKD_SCKDL_MASK                  (0x07)
#define SPI0_SSLND_OFFSET                 0x000d
#define SPI0_SSLND                        (SPI0_BASE + SPI0_SSLND_OFFSET)
#define SPI0_SSLND_SLNDL                  (3 <<  0) /* 01: SSL Negation Delay Setting */
#define SPI0_SSLND_SLNDL_MASK                  (0x07)
#define SPI0_SPND_OFFSET                  0x000e
#define SPI0_SPND                         (SPI0_BASE + SPI0_SPND_OFFSET)
#define SPI0_SPND_SPNDL                   (3 <<  0) /* 01: SPI Next-Access Delay Setting */
#define SPI0_SPND_SPNDL_MASK                   (0x07)
#define SPI0_SPCR2_OFFSET                 0x000f
#define SPI0_SPCR2                        (SPI0_BASE + SPI0_SPCR2_OFFSET)
#define SPI0_SPCR2_SCKASE                 (1 <<  4) /* 10: RSPCK Auto-Stop Function Enable */
#define SPI0_SPCR2_PTE                    (1 <<  3) /* 08: Parity Self-Testing */
#define SPI0_SPCR2_SPIIE                  (1 <<  2) /* 04: SPI Idle Interrupt Enable */
#define SPI0_SPCR2_SPOE                   (1 <<  1) /* 02: Parity Mode */
#define SPI0_SPCR2_SPPE                   (1 <<  0) /* 01: Parity Enable */
#define SPI0_SPCMD0_OFFSET                0x0010
#define SPI0_SPCMD0                       (SPI0_BASE + SPI0_SPCMD0_OFFSET)
#define SPI0_SPCMD0_SCKDEN                (1 << 15) /* 8000: RSPCK Delay Setting Enable */
#define SPI0_SPCMD0_SLNDEN                (1 << 14) /* 4000: SSL Negation Delay Setting Enable */
#define SPI0_SPCMD0_SPNDEN                (1 << 13) /* 2000: RSPI Next-Access Delay Enable */
#define SPI0_SPCMD0_LSBF                  (1 << 12) /* 1000: RSPI LSB First */
#define SPI0_SPCMD0_SPB                   (4 <<  8) /* 100: RSPI Data Length Setting */
#define SPI0_SPCMD0_SPB_MASK                   (0x0f)
#define SPI0_SPCMD0_SSLA                  (3 <<  4) /* 10: SSL Signal Assertion Setting */
#define SPI0_SPCMD0_SSLA_MASK                  (0x07)
#define SPI0_SPCMD0_BRDV                  (2 <<  2) /* 04: Bit Rate Division Setting */
#define SPI0_SPCMD0_BRDV_MASK                  (0x03)
#define SPI0_SPCMD0_CPOL                  (1 <<  1) /* 02: RSPCK Polarity Setting */
#define SPI0_SPCMD0_CPHA                  (1 <<  0) /* 01: RSPCK Phase Setting */

