leocafonso/svdtoheaders/demo/h/ra4m1_reg.h
/* SPI1 - Serial Peripheral Interface 1 */
#define SPI1_BASE                         0x40072100
#define SPI1_SPCR_OFFSET                  0x0000
#define SPI1_SPCR                         (SPI1_BASE + SPI1_SPCR_OFFSET)
#define SPI1_SPCR_SPRIE                   (1 <<  7) /* 80: SPI Receive Buffer Full Interrupt Enable */
#define SPI1_SPCR_SPE                     (1 <<  6) /* 40: SPI Function Enable */
#define SPI1_SPCR_SPTIE                   (1 <<  5) /* 20: Transmit Buffer Empty Interrupt Enable */
#define SPI1_SPCR_SPEIE                   (1 <<  4) /* 10: SPI Error Interrupt Enable */
#define SPI1_SPCR_MSTR                    (1 <<  3) /* 08: SPI Master/Slave Mode Select */
#define SPI1_SPCR_MODFEN                  (1 <<  2) /* 04: Mode Fault Error Detection Enable */
#define SPI1_SPCR_TXMD                    (1 <<  1) /* 02: Communications Operating Mode Select */
#define SPI1_SPCR_SPMS                    (1 <<  0) /* 01: SPI Mode Select */
#define SPI1_SSLP_OFFSET                  0x0001
#define SPI1_SSLP                         (SPI1_BASE + SPI1_SSLP_OFFSET)
#define SPI1_SSLP_SSL3P                   (1 <<  3) /* 08: SSL3 Signal Polarity Setting */
#define SPI1_SSLP_SSL2P                   (1 <<  2) /* 04: SSL2 Signal Polarity Setting */
#define SPI1_SSLP_SSL1P                   (1 <<  1) /* 02: SSL1 Signal Polarity Setting */
#define SPI1_SSLP_SSL0P                   (1 <<  0) /* 01: SSL0 Signal Polarity Setting */
#define SPI1_SPPCR_OFFSET                 0x0002
#define SPI1_SPPCR                        (SPI1_BASE + SPI1_SPPCR_OFFSET)
#define SPI1_SPPCR_MOIFE                  (1 <<  5) /* 20: MOSI Idle Value Fixing Enable */
#define SPI1_SPPCR_MOIFV                  (1 <<  4) /* 10: MOSI Idle Fixed Value */
#define SPI1_SPPCR_SPLP2                  (1 <<  1) /* 02: RSPI Loopback 2 */
#define SPI1_SPPCR_SPLP                   (1 <<  0) /* 01: RSPI Loopback */
#define SPI1_SPSR_OFFSET                  0x0003
#define SPI1_SPSR                         (SPI1_BASE + SPI1_SPSR_OFFSET)
#define SPI1_SPSR_SPRF                    (1 <<  7) /* 80: SPI Receive Buffer Full Flag */
#define SPI1_SPSR_SPTEF                   (1 <<  5) /* 20: SPI Transmit Buffer Empty Flag */
#define SPI1_SPSR_UDRF                    (1 <<  4) /* 10: Underrun Error Flag (When MODF is 0, This bit is invalid.) */
#define SPI1_SPSR_PERF                    (1 <<  3) /* 08: Parity Error Flag */
#define SPI1_SPSR_MODF                    (1 <<  2) /* 04: Mode Fault Error Flag */
#define SPI1_SPSR_IDLNF                   (1 <<  1) /* 02: SPI Idle Flag */
#define SPI1_SPSR_OVRF                    (1 <<  0) /* 01: Overrun Error Flag */
#define SPI1_SPDR_OFFSET                  0x0004
#define SPI1_SPDR                         (SPI1_BASE + SPI1_SPDR_OFFSET)
#define SPI1_SPDR_SPDR                    (32 <<  0) /* 01: SPDR is the interface with the buffers that hold data for transmission and reception by the RSPI. When accessing in word (SPDCR.SPLW=1), access SPDR. */
#define SPI1_SPDR_SPDR_MASK                    (0xffffffff)
#define SPI1_SPDR_HA_OFFSET               0x0004
#define SPI1_SPDR_HA                      (SPI1_BASE + SPI1_SPDR_HA_OFFSET)
#define SPI1_SPDR_HA_SPDR_HA              (16 <<  0) /* 01: SPDR is the interface with the buffers that hold data for transmission and reception by the RSPI. When accessing in halfword (SPDCR.SPLW=0), access SPDR_HA. */
#define SPI1_SPDR_HA_SPDR_HA_MASK              (0xffff)
#define SPI1_SPBR_OFFSET                  0x000a
#define SPI1_SPBR                         (SPI1_BASE + SPI1_SPBR_OFFSET)
#define SPI1_SPBR_SPR                     (8 <<  0) /* 01: SPBR sets the bit rate in master mode. */
#define SPI1_SPBR_SPR_MASK                     (0xff)
#define SPI1_SPDCR_OFFSET                 0x000b
#define SPI1_SPDCR                        (SPI1_BASE + SPI1_SPDCR_OFFSET)
#define SPI1_SPDCR_SPLW                   (1 <<  5) /* 20: SPI Word Access/Halfword Access Specification */
#define SPI1_SPDCR_SPRDTD                 (1 <<  4) /* 10: RSPI Receive/Transmit Data Selection */
#define SPI1_SPCKD_OFFSET                 0x000c
#define SPI1_SPCKD                        (SPI1_BASE + SPI1_SPCKD_OFFSET)
#define SPI1_SPCKD_SCKDL                  (3 <<  0) /* 01: RSPCK Delay Setting */
#define SPI1_SPCKD_SCKDL_MASK                  (0x07)
#define SPI1_SSLND_OFFSET                 0x000d
#define SPI1_SSLND                        (SPI1_BASE + SPI1_SSLND_OFFSET)
#define SPI1_SSLND_SLNDL                  (3 <<  0) /* 01: SSL Negation Delay Setting */
#define SPI1_SSLND_SLNDL_MASK                  (0x07)
#define SPI1_SPND_OFFSET                  0x000e
#define SPI1_SPND                         (SPI1_BASE + SPI1_SPND_OFFSET)
#define SPI1_SPND_SPNDL                   (3 <<  0) /* 01: SPI Next-Access Delay Setting */
#define SPI1_SPND_SPNDL_MASK                   (0x07)
#define SPI1_SPCR2_OFFSET                 0x000f
#define SPI1_SPCR2                        (SPI1_BASE + SPI1_SPCR2_OFFSET)
#define SPI1_SPCR2_SCKASE                 (1 <<  4) /* 10: RSPCK Auto-Stop Function Enable */
#define SPI1_SPCR2_PTE                    (1 <<  3) /* 08: Parity Self-Testing */
#define SPI1_SPCR2_SPIIE                  (1 <<  2) /* 04: SPI Idle Interrupt Enable */
#define SPI1_SPCR2_SPOE                   (1 <<  1) /* 02: Parity Mode */
#define SPI1_SPCR2_SPPE                   (1 <<  0) /* 01: Parity Enable */
#define SPI1_SPCMD0_OFFSET                0x0010
#define SPI1_SPCMD0                       (SPI1_BASE + SPI1_SPCMD0_OFFSET)
#define SPI1_SPCMD0_SCKDEN                (1 << 15) /* 8000: RSPCK Delay Setting Enable */
#define SPI1_SPCMD0_SLNDEN                (1 << 14) /* 4000: SSL Negation Delay Setting Enable */
#define SPI1_SPCMD0_SPNDEN                (1 << 13) /* 2000: RSPI Next-Access Delay Enable */
#define SPI1_SPCMD0_LSBF                  (1 << 12) /* 1000: RSPI LSB First */
#define SPI1_SPCMD0_SPB                   (4 <<  8) /* 100: RSPI Data Length Setting */
#define SPI1_SPCMD0_SPB_MASK                   (0x0f)
#define SPI1_SPCMD0_SSLA                  (3 <<  4) /* 10: SSL Signal Assertion Setting */
#define SPI1_SPCMD0_SSLA_MASK                  (0x07)
#define SPI1_SPCMD0_BRDV                  (2 <<  2) /* 04: Bit Rate Division Setting */
#define SPI1_SPCMD0_BRDV_MASK                  (0x03)
#define SPI1_SPCMD0_CPOL                  (1 <<  1) /* 02: RSPCK Polarity Setting */
#define SPI1_SPCMD0_CPHA                  (1 <<  0) /* 01: RSPCK Phase Setting */

/* SSIE0 - Serial Sound Interface Ver.2.0 */
#define SSIE0_BASE                        0x4004e000
#define SSIE0_SSICR_OFFSET                0x0000
#define SSIE0_SSICR                       (SSIE0_BASE + SSIE0_SSICR_OFFSET)
#define SSIE0_SSICR_CKS                   (1 << 30) /* 40000000: Selects an Audio Clock for Master-mode Communication */
#define SSIE0_SSICR_TUIEN                 (1 << 29) /* 20000000: Transmit Underflow Interrupt Output Enable */
#define SSIE0_SSICR_TOIEN                 (1 << 28) /* 10000000: Transmit Overflow Interrupt Output Enable */
#define SSIE0_SSICR_RUIEN                 (1 << 27) /* 8000000: Receive Underflow Interrupt Output Enable */
#define SSIE0_SSICR_ROIEN                 (1 << 26) /* 4000000: Receive Overflow Interrupt Output Enable */
#define SSIE0_SSICR_IIEN                  (1 << 25) /* 2000000: Idle Mode Interrupt Output Enable */
#define SSIE0_SSICR_DWL                   (3 << 19) /* 80000: Selects Data Word Length */
#define SSIE0_SSICR_DWL_MASK                   (0x07)
#define SSIE0_SSICR_SWL                   (3 << 16) /* 10000: Selects System Word Length */
#define SSIE0_SSICR_SWL_MASK                   (0x07)
#define SSIE0_SSICR_MST                   (1 << 14) /* 4000: Master Enable */
#define SSIE0_SSICR_BCKP                  (1 << 13) /* 2000: Selects Bit Clock Polarity */
#define SSIE0_SSICR_LRCKP                 (1 << 12) /* 1000: Selects the Initial Value and Polarity of LR Clock/Frame Synchronization Signal */
#define SSIE0_SSICR_SPDP                  (1 << 11) /* 800: Selects Serial Padding Polarity */
#define SSIE0_SSICR_SDTA                  (1 << 10) /* 400: Selects Serial Data Alignment */
#define SSIE0_SSICR_PDTA                  (1 <<  9) /* 200: Selects Placement Data Alignment */
#define SSIE0_SSICR_DEL                   (1 <<  8) /* 100: Selects Serial Data Delay */
#define SSIE0_SSICR_CKDV                  (4 <<  4) /* 10: Selects Bit Clock Division Ratio */
#define SSIE0_SSICR_CKDV_MASK                  (0x0f)
#define SSIE0_SSICR_MUEN                  (1 <<  3) /* 08: Mute Enable */
#define SSIE0_SSICR_TEN                   (1 <<  1) /* 02: Transmit Enable */
#define SSIE0_SSICR_REN                   (1 <<  0) /* 01: Receive Enable */
#define SSIE0_SSISR_OFFSET                0x0004
#define SSIE0_SSISR                       (SSIE0_BASE + SSIE0_SSISR_OFFSET)
#define SSIE0_SSISR_TUIRQ                 (1 << 29) /* 20000000: Transmit Underflow Error Status flag */
#define SSIE0_SSISR_TOIRQ                 (1 << 28) /* 10000000: Transmit Overflow Error Status Flag */
#define SSIE0_SSISR_RUIRQ                 (1 << 27) /* 8000000: Receive Underflow Error Status Flag */
#define SSIE0_SSISR_ROIRQ                 (1 << 26) /* 4000000: Receive Overflow Error Status Flag */
#define SSIE0_SSISR_IIRQ                  (1 << 25) /* 2000000: Idle Mode Status Flag */
#define SSIE0_SSIFCR_OFFSET               0x0010
#define SSIE0_SSIFCR                      (SSIE0_BASE + SSIE0_SSIFCR_OFFSET)
#define SSIE0_SSIFCR_AUCKE                (1 << 31) /* 80000000: AUDIO_MCK Enable in Mastermode Communication */
#define SSIE0_SSIFCR_SSIRST               (1 << 16) /* 10000: Software Reset */
#define SSIE0_SSIFCR_BSW                  (1 << 11) /* 800: Byte Swap Enable */
#define SSIE0_SSIFCR_TIE                  (1 <<  3) /* 08: Transmit Data Empty Interrupt Output Enable */
#define SSIE0_SSIFCR_RIE                  (1 <<  2) /* 04: Receive Data Full Interrupt Output Enable */
#define SSIE0_SSIFCR_TFRST                (1 <<  1) /* 02: Transmit FIFO Data Register Reset */
#define SSIE0_SSIFCR_RFRST                (1 <<  0) /* 01: Receive FIFO Data Register Reset */
#define SSIE0_SSIFSR_OFFSET               0x0014
#define SSIE0_SSIFSR                      (SSIE0_BASE + SSIE0_SSIFSR_OFFSET)
#define SSIE0_SSIFSR_TDC                  (4 << 24) /* 1000000: Number of Transmit FIFO Data Indication Flag Number of transmit FIFO data indication flag. */
#define SSIE0_SSIFSR_TDC_MASK                  (0x0f)
#define SSIE0_SSIFSR_TDE                  (1 << 16) /* 10000: Transmit Data Empty Flag */
#define SSIE0_SSIFSR_RDC                  (4 <<  8) /* 100: Number of Receive FIFO Data Indication Flag Number of receive FIFO data indication flag. */
#define SSIE0_SSIFSR_RDC_MASK                  (0x0f)
#define SSIE0_SSIFSR_RDF                  (1 <<  0) /* 01: Receive Data Full Flag */
#define SSIE0_SSIFTDR_OFFSET              0x0018
#define SSIE0_SSIFTDR                     (SSIE0_BASE + SSIE0_SSIFTDR_OFFSET)
#define SSIE0_SSIFTDR_SSIFTDR             (32 <<  0) /* 01: Transmit FIFO Data */
#define SSIE0_SSIFTDR_SSIFTDR_MASK             (0xffffffff)
#define SSIE0_SSIFRDR_OFFSET              0x001c
#define SSIE0_SSIFRDR                     (SSIE0_BASE + SSIE0_SSIFRDR_OFFSET)
#define SSIE0_SSIFRDR_SSIFRDR             (32 <<  0) /* 01: Receive FIFO data. */
#define SSIE0_SSIFRDR_SSIFRDR_MASK             (0xffffffff)
#define SSIE0_SSITDMR_OFFSET              0x0020
#define SSIE0_SSITDMR                     (SSIE0_BASE + SSIE0_SSITDMR_OFFSET)
#define SSIE0_SSITDMR_BCKASTP             (1 <<  9) /* 200: Whether to Enable Stopping BCK Output When SSIE is in Idle Status */
#define SSIE0_SSITDMR_LRCONT              (1 <<  8) /* 100: Whether to Enable LRCK/FS Continuation */
#define SSIE0_SSITDMR_OMOD                (2 <<  0) /* 01: Audio Format Select */
#define SSIE0_SSITDMR_OMOD_MASK                (0x03)
#define SSIE0_SSISCR_OFFSET               0x0024
#define SSIE0_SSISCR                      (SSIE0_BASE + SSIE0_SSISCR_OFFSET)
#define SSIE0_SSISCR_TDES                 (3 <<  8) /* 100: TDE Setting Condition Select */
#define SSIE0_SSISCR_TDES_MASK                 (0x07)
#define SSIE0_SSISCR_RDFS                 (3 <<  0) /* 01: RDF Setting Condition Select */
#define SSIE0_SSISCR_RDFS_MASK                 (0x07)

/* TSN - Temperature Sensor */
#define TSN_BASE                          0x407ec000
#define TSN_TSCDRH_OFFSET                 0x0229
#define TSN_TSCDRH                        (TSN_BASE + TSN_TSCDRH_OFFSET)
#define TSN_TSCDRH_TSCDRH                 (8 <<  0) /* 01: The calibration data stores the higher 8 bits of the converted value. */
#define TSN_TSCDRH_TSCDRH_MASK                 (0xff)
#define TSN_TSCDRL_OFFSET                 0x0228
#define TSN_TSCDRL                        (TSN_BASE + TSN_TSCDRL_OFFSET)
#define TSN_TSCDRL_TSCDRL                 (8 <<  0) /* 01: The calibration data stores the lower 8 bits of the converted value. */
#define TSN_TSCDRL_TSCDRL_MASK                 (0xff)

