leocafonso/svdtoheaders/demo/h/ra4m1_reg.h
/* USBFS - USB 2.0 FS Module */
#define USBFS_BASE                        0x40090000
#define USBFS_SYSCFG_OFFSET               0x0000
#define USBFS_SYSCFG                      (USBFS_BASE + USBFS_SYSCFG_OFFSET)
#define USBFS_SYSCFG_SCKE                 (1 << 10) /* 400: USB Clock Enable */
#define USBFS_SYSCFG_CNEN                 (1 <<  8) /* 100: CNEN Single End Receiver Enable */
#define USBFS_SYSCFG_DCFM                 (1 <<  6) /* 40: Controller Function Select */
#define USBFS_SYSCFG_DRPD                 (1 <<  5) /* 20: D+/D- Line Resistor Control */
#define USBFS_SYSCFG_DPRPU                (1 <<  4) /* 10: D+ Line Resistor Control */
#define USBFS_SYSCFG_DMRPU                (1 <<  3) /* 08: D- Line Resistor Control */
#define USBFS_SYSCFG_USBE                 (1 <<  0) /* 01: USB Operation Enable */
#define USBFS_SYSSTS0_OFFSET              0x0004
#define USBFS_SYSSTS0                     (USBFS_BASE + USBFS_SYSSTS0_OFFSET)
#define USBFS_SYSSTS0_OVCMON              (2 << 14) /* 4000: External USB0_OVRCURA/ USB0_OVRCURB Input Pin Monitor The OCVMON[1] bit indicates the status of the USBHS_OVRCURA pin. The OCVMON[0] bit indicates the status of the USBHS_OVRCURB pin. */
#define USBFS_SYSSTS0_OVCMON_MASK              (0x03)
#define USBFS_SYSSTS0_HTACT               (1 <<  6) /* 40: USB Host Sequencer Status Monitor */
#define USBFS_SYSSTS0_IDMON               (1 <<  2) /* 04: External ID0 Input Pin Monitor */
#define USBFS_SYSSTS0_LNST                (2 <<  0) /* 01: USB Data Line Status Monitor */
#define USBFS_SYSSTS0_LNST_MASK                (0x03)
#define USBFS_DVSTCTR0_OFFSET             0x0008
#define USBFS_DVSTCTR0                    (USBFS_BASE + USBFS_DVSTCTR0_OFFSET)
#define USBFS_DVSTCTR0_HNPBTOA            (1 << 11) /* 800: Host Negotiation Protocol (HNP) Control This bit is used when switching from device B to device A while in OTG mode. If the HNPBTOA bit is 1, the internal function control keeps the suspended state until the HNP processing ends even though SYSCFG.DPRPU = 0 or SYSCFG.DCFM = 1 is set. */
#define USBFS_DVSTCTR0_EXICEN             (1 << 10) /* 400: USB_EXICEN Output Pin Control */
#define USBFS_DVSTCTR0_VBUSEN             (1 <<  9) /* 200: USB_VBUSEN Output Pin Control */
#define USBFS_DVSTCTR0_WKUP               (1 <<  8) /* 100: Wakeup Output */
#define USBFS_DVSTCTR0_RWUPE              (1 <<  7) /* 80: Wakeup Detection Enable */
#define USBFS_DVSTCTR0_USBRST             (1 <<  6) /* 40: USB Bus Reset Output */
#define USBFS_DVSTCTR0_RESUME             (1 <<  5) /* 20: Resume Output */
#define USBFS_DVSTCTR0_UACT               (1 <<  4) /* 10: USB Bus Enable */
#define USBFS_DVSTCTR0_RHST               (3 <<  0) /* 01: USB Bus Reset Status */
#define USBFS_DVSTCTR0_RHST_MASK               (0x07)
#define USBFS_CFIFO_OFFSET                0x0014
#define USBFS_CFIFO                       (USBFS_BASE + USBFS_CFIFO_OFFSET)
#define USBFS_CFIFO_FIFOPORT              (16 <<  0) /* 01: FIFO Port Read receive data from the FIFO buffer or write transmit data to the FIFO buffer by accessing these bits. */
#define USBFS_CFIFO_FIFOPORT_MASK              (0xffff)
#define USBFS_CFIFOL_OFFSET               0x0014
#define USBFS_CFIFOL                      (USBFS_BASE + USBFS_CFIFOL_OFFSET)
#define USBFS_D0FIFO_OFFSET               0x0018
#define USBFS_D0FIFO                      (USBFS_BASE + USBFS_D0FIFO_OFFSET)
#define USBFS_D0FIFO_FIFOPORT             (16 <<  0) /* 01: FIFO Port Read receive data from the FIFO buffer or write transmit data to the FIFO buffer by accessing these bits. */
#define USBFS_D0FIFO_FIFOPORT_MASK             (0xffff)
#define USBFS_D0FIFOL_OFFSET              0x0018
#define USBFS_D0FIFOL                     (USBFS_BASE + USBFS_D0FIFOL_OFFSET)
#define USBFS_D1FIFO_OFFSET               0x001c
#define USBFS_D1FIFO                      (USBFS_BASE + USBFS_D1FIFO_OFFSET)
#define USBFS_D1FIFO_FIFOPORT             (16 <<  0) /* 01: FIFO Port Read receive data from the FIFO buffer or write transmit data to the FIFO buffer by accessing these bits. */
#define USBFS_D1FIFO_FIFOPORT_MASK             (0xffff)
#define USBFS_D1FIFOL_OFFSET              0x001c
#define USBFS_D1FIFOL                     (USBFS_BASE + USBFS_D1FIFOL_OFFSET)
#define USBFS_CFIFOSEL_OFFSET             0x0020
#define USBFS_CFIFOSEL                    (USBFS_BASE + USBFS_CFIFOSEL_OFFSET)
#define USBFS_CFIFOSEL_RCNT               (1 << 15) /* 8000: Read Count Mode */
#define USBFS_CFIFOSEL_REW                (1 << 14) /* 4000: Buffer Pointer Rewind */
#define USBFS_CFIFOSEL_MBW                (1 << 10) /* 400: CFIFO Port Access Bit Width */
#define USBFS_CFIFOSEL_BIGEND             (1 <<  8) /* 100: CFIFO Port Endian Control */
#define USBFS_CFIFOSEL_ISEL               (1 <<  5) /* 20: CFIFO Port Access Direction When DCP is Selected */
#define USBFS_CFIFOSEL_CURPIPE            (4 <<  0) /* 01: CFIFO Port Access Pipe Specification */
#define USBFS_CFIFOSEL_CURPIPE_MASK            (0x0f)
#define USBFS_CFIFOCTR_OFFSET             0x0022
#define USBFS_CFIFOCTR                    (USBFS_BASE + USBFS_CFIFOCTR_OFFSET)
#define USBFS_CFIFOCTR_BVAL               (1 << 15) /* 8000: Buffer Memory Valid Flag */
#define USBFS_CFIFOCTR_BCLR               (1 << 14) /* 4000: CPU Buffer Clear Note: Only 0 can be read. */
#define USBFS_CFIFOCTR_FRDY               (1 << 13) /* 2000: FIFO Port Ready */
#define USBFS_CFIFOCTR_DTLN               (9 <<  0) /* 01: Receive Data Length Indicates the length of the receive data. */
#define USBFS_CFIFOCTR_DTLN_MASK               (0x1ff)
#define USBFS_D0FIFOSEL_OFFSET            0x0028
#define USBFS_D0FIFOSEL                   (USBFS_BASE + USBFS_D0FIFOSEL_OFFSET)
#define USBFS_D0FIFOSEL_RCNT              (1 << 15) /* 8000: Read Count Mode */
#define USBFS_D0FIFOSEL_REW               (1 << 14) /* 4000: Buffer Pointer Rewind Note: Only 0 can be read. */
#define USBFS_D0FIFOSEL_DCLRM             (1 << 13) /* 2000: Auto Buffer Memory Clear Mode Accessed after Specified Pipe Data is Read */
#define USBFS_D0FIFOSEL_DREQE             (1 << 12) /* 1000: DMA/DTC Transfer Request Enable */
#define USBFS_D0FIFOSEL_MBW               (1 << 10) /* 400: FIFO Port Access Bit Width */
#define USBFS_D0FIFOSEL_BIGEND            (1 <<  8) /* 100: FIFO Port Endian Control */
#define USBFS_D0FIFOSEL_CURPIPE           (4 <<  0) /* 01: FIFO Port Access Pipe Specification */
#define USBFS_D0FIFOSEL_CURPIPE_MASK           (0x0f)
#define USBFS_D0FIFOCTR_OFFSET            0x002a
#define USBFS_D0FIFOCTR                   (USBFS_BASE + USBFS_D0FIFOCTR_OFFSET)
#define USBFS_D0FIFOCTR_BVAL              (1 << 15) /* 8000: Buffer Memory Valid Flag */
#define USBFS_D0FIFOCTR_BCLR              (1 << 14) /* 4000: CPU Buffer Clear Note: Only 0 can be read. */
#define USBFS_D0FIFOCTR_FRDY              (1 << 13) /* 2000: FIFO Port Ready */
#define USBFS_D0FIFOCTR_DTLN              (9 <<  0) /* 01: Receive Data Length Indicates the length of the receive data. */
#define USBFS_D0FIFOCTR_DTLN_MASK              (0x1ff)
#define USBFS_D1FIFOSEL_OFFSET            0x002c
#define USBFS_D1FIFOSEL                   (USBFS_BASE + USBFS_D1FIFOSEL_OFFSET)
#define USBFS_D1FIFOSEL_RCNT              (1 << 15) /* 8000: Read Count Mode */
#define USBFS_D1FIFOSEL_REW               (1 << 14) /* 4000: Buffer Pointer Rewind */
#define USBFS_D1FIFOSEL_DCLRM             (1 << 13) /* 2000: Auto Buffer Memory Clear Mode Accessed after Specified Pipe Data is Read */
#define USBFS_D1FIFOSEL_DREQE             (1 << 12) /* 1000: DMA/DTC Transfer Request Enable */
#define USBFS_D1FIFOSEL_MBW               (1 << 10) /* 400: FIFO Port Access Bit Width */
#define USBFS_D1FIFOSEL_BIGEND            (1 <<  8) /* 100: FIFO Port Endian Control */
#define USBFS_D1FIFOSEL_CURPIPE           (4 <<  0) /* 01: FIFO Port Access Pipe Specification */
#define USBFS_D1FIFOSEL_CURPIPE_MASK           (0x0f)
#define USBFS_D1FIFOCTR_OFFSET            0x002e
#define USBFS_D1FIFOCTR                   (USBFS_BASE + USBFS_D1FIFOCTR_OFFSET)
#define USBFS_D1FIFOCTR_BVAL              (1 << 15) /* 8000: Buffer Memory Valid Flag */
#define USBFS_D1FIFOCTR_BCLR              (1 << 14) /* 4000: CPU Buffer Clear Note: Only 0 can be read. */
#define USBFS_D1FIFOCTR_FRDY              (1 << 13) /* 2000: FIFO Port Ready */
#define USBFS_D1FIFOCTR_DTLN              (9 <<  0) /* 01: Receive Data Length Indicates the length of the receive data. */
#define USBFS_D1FIFOCTR_DTLN_MASK              (0x1ff)
#define USBFS_INTENB0_OFFSET              0x0030
#define USBFS_INTENB0                     (USBFS_BASE + USBFS_INTENB0_OFFSET)
#define USBFS_INTENB0_VBSE                (1 << 15) /* 8000: VBUS Interrupt Enable */
#define USBFS_INTENB0_RSME                (1 << 14) /* 4000: Resume Interrupt Enable */
#define USBFS_INTENB0_SOFE                (1 << 13) /* 2000: Frame Number Update Interrupt Enable */
#define USBFS_INTENB0_DVSE                (1 << 12) /* 1000: Device State Transition Interrupt Enable */
#define USBFS_INTENB0_CTRE                (1 << 11) /* 800: Control Transfer Stage Transition Interrupt Enable */
#define USBFS_INTENB0_BEMPE               (1 << 10) /* 400: Buffer Empty Interrupt Enable */
#define USBFS_INTENB0_NRDYE               (1 <<  9) /* 200: Buffer Not Ready Response Interrupt Enable */
#define USBFS_INTENB0_BRDYE               (1 <<  8) /* 100: Buffer Ready Interrupt Enable */
#define USBFS_INTENB1_OFFSET              0x0032
#define USBFS_INTENB1                     (USBFS_BASE + USBFS_INTENB1_OFFSET)
#define USBFS_INTENB1_OVRCRE              (1 << 15) /* 8000: Overcurrent Input Change Interrupt Enable */
#define USBFS_INTENB1_BCHGE               (1 << 14) /* 4000: USB Bus Change Interrupt Enable */
#define USBFS_INTENB1_DTCHE               (1 << 12) /* 1000: Disconnection Detection Interrupt Enable */
#define USBFS_INTENB1_ATTCHE              (1 << 11) /* 800: Connection Detection Interrupt Enable */
#define USBFS_INTENB1_EOFERRE             (1 <<  6) /* 40: EOF Error Detection Interrupt Enable */
#define USBFS_INTENB1_SIGNE               (1 <<  5) /* 20: Setup Transaction Error Interrupt Enable */
#define USBFS_INTENB1_SACKE               (1 <<  4) /* 10: Setup Transaction Normal Response Interrupt Enable */
#define USBFS_INTENB1_PDDETINTE0          (1 <<  0) /* 01: PDDETINT0 Detection Interrupt Enable */
#define USBFS_BRDYENB_OFFSET              0x0036
#define USBFS_BRDYENB                     (USBFS_BASE + USBFS_BRDYENB_OFFSET)
#define USBFS_BRDYENB_PIPE9BRDYE          (1 <<  9) /* 200: BRDY Interrupt Enable for PIPE9 */
#define USBFS_BRDYENB_PIPE8BRDYE          (1 <<  8) /* 100: BRDY Interrupt Enable for PIPE8 */
#define USBFS_BRDYENB_PIPE7BRDYE          (1 <<  7) /* 80: BRDY Interrupt Enable for PIPE7 */
#define USBFS_BRDYENB_PIPE6BRDYE          (1 <<  6) /* 40: BRDY Interrupt Enable for PIPE6 */
#define USBFS_BRDYENB_PIPE5BRDYE          (1 <<  5) /* 20: BRDY Interrupt Enable for PIPE5 */
#define USBFS_BRDYENB_PIPE4BRDYE          (1 <<  4) /* 10: BRDY Interrupt Enable for PIPE4 */
#define USBFS_BRDYENB_PIPE3BRDYE          (1 <<  3) /* 08: BRDY Interrupt Enable for PIPE3 */
#define USBFS_BRDYENB_PIPE2BRDYE          (1 <<  2) /* 04: BRDY Interrupt Enable for PIPE2 */
#define USBFS_BRDYENB_PIPE1BRDYE          (1 <<  1) /* 02: BRDY Interrupt Enable for PIPE1 */
#define USBFS_BRDYENB_PIPE0BRDYE          (1 <<  0) /* 01: BRDY Interrupt Enable for PIPE0 */
#define USBFS_NRDYENB_OFFSET              0x0038
#define USBFS_NRDYENB                     (USBFS_BASE + USBFS_NRDYENB_OFFSET)
#define USBFS_NRDYENB_PIPE9NRDYE          (1 <<  9) /* 200: NRDY Interrupt Enable for PIPE9 */
#define USBFS_NRDYENB_PIPE8NRDYE          (1 <<  8) /* 100: NRDY Interrupt Enable for PIPE8 */
#define USBFS_NRDYENB_PIPE7NRDYE          (1 <<  7) /* 80: NRDY Interrupt Enable for PIPE7 */
#define USBFS_NRDYENB_PIPE6NRDYE          (1 <<  6) /* 40: NRDY Interrupt Enable for PIPE6 */
#define USBFS_NRDYENB_PIPE5NRDYE          (1 <<  5) /* 20: NRDY Interrupt Enable for PIPE5 */
#define USBFS_NRDYENB_PIPE4NRDYE          (1 <<  4) /* 10: NRDY Interrupt Enable for PIPE4 */
#define USBFS_NRDYENB_PIPE3NRDYE          (1 <<  3) /* 08: NRDY Interrupt Enable for PIPE3 */
#define USBFS_NRDYENB_PIPE2NRDYE          (1 <<  2) /* 04: NRDY Interrupt Enable for PIPE2 */
#define USBFS_NRDYENB_PIPE1NRDYE          (1 <<  1) /* 02: NRDY Interrupt Enable for PIPE1 */
#define USBFS_NRDYENB_PIPE0NRDYE          (1 <<  0) /* 01: NRDY Interrupt Enable for PIPE0 */
#define USBFS_BEMPENB_OFFSET              0x003a
#define USBFS_BEMPENB                     (USBFS_BASE + USBFS_BEMPENB_OFFSET)
#define USBFS_BEMPENB_PIPE9BEMPE          (1 <<  9) /* 200: BEMP Interrupt Enable for PIPE9 */
#define USBFS_BEMPENB_PIPE8BEMPE          (1 <<  8) /* 100: BEMP Interrupt Enable for PIPE8 */
#define USBFS_BEMPENB_PIPE7BEMPE          (1 <<  7) /* 80: BEMP Interrupt Enable for PIPE7 */
#define USBFS_BEMPENB_PIPE6BEMPE          (1 <<  6) /* 40: BEMP Interrupt Enable for PIPE6 */
#define USBFS_BEMPENB_PIPE5BEMPE          (1 <<  5) /* 20: BEMP Interrupt Enable for PIPE5 */
#define USBFS_BEMPENB_PIPE4BEMPE          (1 <<  4) /* 10: BEMP Interrupt Enable for PIPE4 */
#define USBFS_BEMPENB_PIPE3BEMPE          (1 <<  3) /* 08: BEMP Interrupt Enable for PIPE3 */
#define USBFS_BEMPENB_PIPE2BEMPE          (1 <<  2) /* 04: BEMP Interrupt Enable for PIPE2 */
#define USBFS_BEMPENB_PIPE1BEMPE          (1 <<  1) /* 02: BEMP Interrupt Enable for PIPE1 */
#define USBFS_BEMPENB_PIPE0BEMPE          (1 <<  0) /* 01: BEMP Interrupt Enable for PIPE0 */
#define USBFS_SOFCFG_OFFSET               0x003c
#define USBFS_SOFCFG                      (USBFS_BASE + USBFS_SOFCFG_OFFSET)
#define USBFS_SOFCFG_TRNENSEL             (1 <<  8) /* 100: Transaction-Enabled Time Select */
#define USBFS_SOFCFG_BRDYM                (1 <<  6) /* 40: BRDY Interrupt Status Clear Timing */
#define USBFS_SOFCFG_EDGESTS              (1 <<  4) /* 10: Edge Interrupt Output Status Monitor */
#define USBFS_INTSTS0_OFFSET              0x0040
#define USBFS_INTSTS0                     (USBFS_BASE + USBFS_INTSTS0_OFFSET)
#define USBFS_INTSTS0_VBINT               (1 << 15) /* 8000: VBUS Interrupt Status */
#define USBFS_INTSTS0_RESM                (1 << 14) /* 4000: Resume Interrupt Status */
#define USBFS_INTSTS0_SOFR                (1 << 13) /* 2000: Frame Number Refresh Interrupt Status */
#define USBFS_INTSTS0_DVST                (1 << 12) /* 1000: Device State Transition Interrupt Status */
#define USBFS_INTSTS0_CTRT                (1 << 11) /* 800: Control Transfer Stage Transition Interrupt Status */
#define USBFS_INTSTS0_BEMP                (1 << 10) /* 400: Buffer Empty Interrupt Status */
#define USBFS_INTSTS0_NRDY                (1 <<  9) /* 200: Buffer Not Ready Interrupt Status */
#define USBFS_INTSTS0_BRDY                (1 <<  8) /* 100: Buffer Ready Interrupt Status */
#define USBFS_INTSTS0_VBSTS               (1 <<  7) /* 80: VBUS Input Status */
#define USBFS_INTSTS0_DVSQ                (3 <<  4) /* 10: Device State */
#define USBFS_INTSTS0_DVSQ_MASK                (0x07)
#define USBFS_INTSTS0_VALID               (1 <<  3) /* 08: USB Request Reception */
#define USBFS_INTSTS0_CTSQ                (3 <<  0) /* 01: Control Transfer Stage */
#define USBFS_INTSTS0_CTSQ_MASK                (0x07)
#define USBFS_INTSTS1_OFFSET              0x0042
#define USBFS_INTSTS1                     (USBFS_BASE + USBFS_INTSTS1_OFFSET)
#define USBFS_INTSTS1_OVRCR               (1 << 15) /* 8000: Overcurrent Input Change Interrupt Status */
#define USBFS_INTSTS1_BCHG                (1 << 14) /* 4000: USB Bus Change Interrupt Status */
#define USBFS_INTSTS1_DTCH                (1 << 12) /* 1000: USB Disconnection Detection Interrupt Status */
#define USBFS_INTSTS1_ATTCH               (1 << 11) /* 800: ATTCH Interrupt Status */
#define USBFS_INTSTS1_EOFERR              (1 <<  6) /* 40: EOF Error Detection Interrupt Status */
#define USBFS_INTSTS1_SIGN                (1 <<  5) /* 20: Setup Transaction Error Interrupt Status */
#define USBFS_INTSTS1_SACK                (1 <<  4) /* 10: Setup Transaction Normal Response Interrupt Status */
#define USBFS_INTSTS1_PDDETINT0           (1 <<  0) /* 01: PDDET0 Detection Interrupt Status */
#define USBFS_BRDYSTS_OFFSET              0x0046
#define USBFS_BRDYSTS                     (USBFS_BASE + USBFS_BRDYSTS_OFFSET)
#define USBFS_BRDYSTS_PIPE9BRDY           (1 <<  9) /* 200: BRDY Interrupt Status for PIPE9 */
#define USBFS_BRDYSTS_PIPE8BRDY           (1 <<  8) /* 100: BRDY Interrupt Status for PIPE8 */
#define USBFS_BRDYSTS_PIPE7BRDY           (1 <<  7) /* 80: BRDY Interrupt Status for PIPE7 */
#define USBFS_BRDYSTS_PIPE6BRDY           (1 <<  6) /* 40: BRDY Interrupt Status for PIPE6 */
#define USBFS_BRDYSTS_PIPE5BRDY           (1 <<  5) /* 20: BRDY Interrupt Status for PIPE5 */
#define USBFS_BRDYSTS_PIPE4BRDY           (1 <<  4) /* 10: BRDY Interrupt Status for PIPE4 */
#define USBFS_BRDYSTS_PIPE3BRDY           (1 <<  3) /* 08: BRDY Interrupt Status for PIPE3 */
#define USBFS_BRDYSTS_PIPE2BRDY           (1 <<  2) /* 04: BRDY Interrupt Status for PIPE2 */
#define USBFS_BRDYSTS_PIPE1BRDY           (1 <<  1) /* 02: BRDY Interrupt Status for PIPE1 */
#define USBFS_BRDYSTS_PIPE0BRDY           (1 <<  0) /* 01: BRDY Interrupt Status for PIPE0 */
#define USBFS_NRDYSTS_OFFSET              0x0048
#define USBFS_NRDYSTS                     (USBFS_BASE + USBFS_NRDYSTS_OFFSET)
#define USBFS_NRDYSTS_PIPE9NRDY           (1 <<  9) /* 200: NRDY Interrupt Status for PIPE9 */
#define USBFS_NRDYSTS_PIPE8NRDY           (1 <<  8) /* 100: NRDY Interrupt Status for PIPE8 */
#define USBFS_NRDYSTS_PIPE7NRDY           (1 <<  7) /* 80: NRDY Interrupt Status for PIPE7 */
#define USBFS_NRDYSTS_PIPE6NRDY           (1 <<  6) /* 40: NRDY Interrupt Status for PIPE6 */
#define USBFS_NRDYSTS_PIPE5NRDY           (1 <<  5) /* 20: NRDY Interrupt Status for PIPE5 */
#define USBFS_NRDYSTS_PIPE4NRDY           (1 <<  4) /* 10: NRDY Interrupt Status for PIPE4 */
#define USBFS_NRDYSTS_PIPE3NRDY           (1 <<  3) /* 08: NRDY Interrupt Status for PIPE3 */
#define USBFS_NRDYSTS_PIPE2NRDY           (1 <<  2) /* 04: NRDY Interrupt Status for PIPE2 */
#define USBFS_NRDYSTS_PIPE1NRDY           (1 <<  1) /* 02: NRDY Interrupt Status for PIPE1 */
#define USBFS_NRDYSTS_PIPE0NRDY           (1 <<  0) /* 01: NRDY Interrupt Status for PIPE0 */
#define USBFS_BEMPSTS_OFFSET              0x004a
#define USBFS_BEMPSTS                     (USBFS_BASE + USBFS_BEMPSTS_OFFSET)
#define USBFS_BEMPSTS_PIPE9BEMP           (1 <<  9) /* 200: BEMP Interrupt Status for PIPE9 */
#define USBFS_BEMPSTS_PIPE8BEMP           (1 <<  8) /* 100: BEMP Interrupt Status for PIPE8 */
#define USBFS_BEMPSTS_PIPE7BEMP           (1 <<  7) /* 80: BEMP Interrupt Status for PIPE7 */
#define USBFS_BEMPSTS_PIPE6BEMP           (1 <<  6) /* 40: BEMP Interrupt Status for PIPE6 */
#define USBFS_BEMPSTS_PIPE5BEMP           (1 <<  5) /* 20: BEMP Interrupt Status for PIPE5 */
#define USBFS_BEMPSTS_PIPE4BEMP           (1 <<  4) /* 10: BEMP Interrupt Status for PIPE4 */
#define USBFS_BEMPSTS_PIPE3BEMP           (1 <<  3) /* 08: BEMP Interrupt Status for PIPE3 */
#define USBFS_BEMPSTS_PIPE2BEMP           (1 <<  2) /* 04: BEMP Interrupt Status for PIPE2 */
#define USBFS_BEMPSTS_PIPE1BEMP           (1 <<  1) /* 02: BEMP Interrupt Status for PIPE1 */
#define USBFS_BEMPSTS_PIPE0BEMP           (1 <<  0) /* 01: BEMP Interrupt Status for PIPE0 */
#define USBFS_FRMNUM_OFFSET               0x004c
#define USBFS_FRMNUM                      (USBFS_BASE + USBFS_FRMNUM_OFFSET)
#define USBFS_FRMNUM_OVRN                 (1 << 15) /* 8000: Overrun/Underrun Detection Status */
#define USBFS_FRMNUM_CRCE                 (1 << 14) /* 4000: Receive Data Error */
#define USBFS_FRMNUM_FRNM                 (11 <<  0) /* 01: Frame Number Latest frame number */
#define USBFS_FRMNUM_FRNM_MASK                 (0x7ff)
#define USBFS_USBREQ_OFFSET               0x0054
#define USBFS_USBREQ                      (USBFS_BASE + USBFS_USBREQ_OFFSET)
#define USBFS_USBREQ_BREQUEST             (8 <<  8) /* 100: Request These bits store the USB request bRequest value. */
#define USBFS_USBREQ_BREQUEST_MASK             (0xff)
#define USBFS_USBREQ_BMREQUESTTYPE        (8 <<  0) /* 01: Request Type These bits store the USB request bmRequestType value. */
#define USBFS_USBREQ_BMREQUESTTYPE_MASK        (0xff)
#define USBFS_USBVAL_OFFSET               0x0056
#define USBFS_USBVAL                      (USBFS_BASE + USBFS_USBVAL_OFFSET)
#define USBFS_USBVAL_WVALUE               (16 <<  0) /* 01: Value These bits store the USB request Value value. */
#define USBFS_USBVAL_WVALUE_MASK               (0xffff)
#define USBFS_USBINDX_OFFSET              0x0058
#define USBFS_USBINDX                     (USBFS_BASE + USBFS_USBINDX_OFFSET)
#define USBFS_USBINDX_WINDEX              (16 <<  0) /* 01: Index These bits store the USB request wIndex value. */
#define USBFS_USBINDX_WINDEX_MASK              (0xffff)
#define USBFS_USBLENG_OFFSET              0x005a
#define USBFS_USBLENG                     (USBFS_BASE + USBFS_USBLENG_OFFSET)
#define USBFS_USBLENG_WLENTUH             (16 <<  0) /* 01: Length These bits store the USB request wLength value. */
#define USBFS_USBLENG_WLENTUH_MASK             (0xffff)
#define USBFS_DCPCFG_OFFSET               0x005c
#define USBFS_DCPCFG                      (USBFS_BASE + USBFS_DCPCFG_OFFSET)
#define USBFS_DCPCFG_SHTNAK               (1 <<  7) /* 80: Pipe Disabled at End of Transfer */
#define USBFS_DCPCFG_DIR                  (1 <<  4) /* 10: Transfer Direction */
#define USBFS_DCPMAXP_OFFSET              0x005e
#define USBFS_DCPMAXP                     (USBFS_BASE + USBFS_DCPMAXP_OFFSET)
#define USBFS_DCPMAXP_DEVSEL              (4 << 12) /* 1000: Device Select */
#define USBFS_DCPMAXP_DEVSEL_MASK              (0x0f)
#define USBFS_DCPMAXP_MXPS                (7 <<  0) /* 01: Maximum Packet Size These bits set the maximum amount of data (maximum packet size) in payloads for the DCP. */
#define USBFS_DCPMAXP_MXPS_MASK                (0x7f)
#define USBFS_DCPCTR_OFFSET               0x0060
#define USBFS_DCPCTR                      (USBFS_BASE + USBFS_DCPCTR_OFFSET)
#define USBFS_DCPCTR_BSTS                 (1 << 15) /* 8000: Buffer Status */
#define USBFS_DCPCTR_SUREQ                (1 << 14) /* 4000: Setup Token Transmission */
#define USBFS_DCPCTR_SUREQCLR             (1 << 11) /* 800: SUREQ Bit Clear */
#define USBFS_DCPCTR_SQCLR                (1 <<  8) /* 100: Sequence Toggle Bit Clear */
#define USBFS_DCPCTR_SQSET                (1 <<  7) /* 80: Sequence Toggle Bit Set */
#define USBFS_DCPCTR_SQMON                (1 <<  6) /* 40: Sequence Toggle Bit Monitor */
#define USBFS_DCPCTR_PBUSY                (1 <<  5) /* 20: Pipe Busy */
#define USBFS_DCPCTR_CCPL                 (1 <<  2) /* 04: Control Transfer End Enable */
#define USBFS_DCPCTR_PID                  (2 <<  0) /* 01: Response PID */
#define USBFS_DCPCTR_PID_MASK                  (0x03)
#define USBFS_PIPESEL_OFFSET              0x0064
#define USBFS_PIPESEL                     (USBFS_BASE + USBFS_PIPESEL_OFFSET)
#define USBFS_PIPESEL_PIPESEL             (4 <<  0) /* 01: Pipe Window Select */
#define USBFS_PIPESEL_PIPESEL_MASK             (0x0f)
#define USBFS_PIPECFG_OFFSET              0x0068
#define USBFS_PIPECFG                     (USBFS_BASE + USBFS_PIPECFG_OFFSET)
#define USBFS_PIPECFG_TYPE                (2 << 14) /* 4000: Transfer Type */
#define USBFS_PIPECFG_TYPE_MASK                (0x03)
#define USBFS_PIPECFG_BFRE                (1 << 10) /* 400: BRDY Interrupt Operation Specification */
#define USBFS_PIPECFG_DBLB                (1 <<  9) /* 200: Double Buffer Mode */
#define USBFS_PIPECFG_SHTNAK              (1 <<  7) /* 80: Pipe Disabled at End of Transfer */
#define USBFS_PIPECFG_DIR                 (1 <<  4) /* 10: Transfer Direction */
