leocafonso/svdtoheaders/demo/h/ra4m1_reg.h
#define USBFS_PIPECFG_EPNUM               (4 <<  0) /* 01: Endpoint Number These bits specify the endpoint number for the selected pipe. Setting 0000b means unused pipe. */
#define USBFS_PIPECFG_EPNUM_MASK               (0x0f)
#define USBFS_PIPEMAXP_OFFSET             0x006c
#define USBFS_PIPEMAXP                    (USBFS_BASE + USBFS_PIPEMAXP_OFFSET)
#define USBFS_PIPEMAXP_DEVSEL             (4 << 12) /* 1000: Device Select */
#define USBFS_PIPEMAXP_DEVSEL_MASK             (0x0f)
#define USBFS_PIPEMAXP_MXPS               (9 <<  0) /* 01: Maximum Packet Size PIPE1 and PIPE2: 1 byte (001h) to 256 bytes (100h) PIPE3 to PIPE5: 8 bytes (008h), 16 bytes (010h), 32 bytes (020h), 64 bytes (040h) (Bits [8:7] and [2:0] are not provided.) PIPE6 to PIPE9: 1 byte (001h) to 64 bytes (040h) (Bits [8:7] are not provided.) */
#define USBFS_PIPEMAXP_MXPS_MASK               (0x1ff)
#define USBFS_PIPEPERI_OFFSET             0x006e
#define USBFS_PIPEPERI                    (USBFS_BASE + USBFS_PIPEPERI_OFFSET)
#define USBFS_PIPEPERI_IFIS               (1 << 12) /* 1000: Isochronous IN Buffer Flush */
#define USBFS_PIPEPERI_IITV               (3 <<  0) /* 01: Interval Error Detection Interval Specifies the interval error detection timing for the selected pipe in terms of frames, which is expressed as nth power of 2. */
#define USBFS_PIPEPERI_IITV_MASK               (0x07)
#define USBFS_PIPECTR_SIZE                5
#define USBFS_PIPECTR_OFFSET              0x0070
#define USBFS_PIPECTR(p)                  (USBFS_BASE + USBFS_PIPECTR_OFFSET + (p)*0x0002)
#define USBFS_PIPECTR_BSTS                (1 << 15) /* 8000: Buffer Status */
#define USBFS_PIPECTR_INBUFM              (1 << 14) /* 4000: Transmit Buffer Monitor */
#define USBFS_PIPECTR_ATREPM              (1 << 10) /* 400: Auto Response Mode */
#define USBFS_PIPECTR_ACLRM               (1 <<  9) /* 200: Auto Buffer Clear Mode */
#define USBFS_PIPECTR_SQCLR               (1 <<  8) /* 100: Sequence Toggle Bit Clear */
#define USBFS_PIPECTR_SQSET               (1 <<  7) /* 80: Sequence Toggle Bit Set */
#define USBFS_PIPECTR_SQMON               (1 <<  6) /* 40: Sequence Toggle Bit Confirmation */
#define USBFS_PIPECTR_PBUSY               (1 <<  5) /* 20: Pipe Busy */
#define USBFS_PIPECTR_PID                 (2 <<  0) /* 01: Response PID */
#define USBFS_PIPECTR_PID_MASK                 (0x03)
#define USBFS_PIPECTR_SIZE                4
#define USBFS_PIPECTR_OFFSET              0x007a
#define USBFS_PIPECTR(p)                  (USBFS_BASE + USBFS_PIPECTR_OFFSET + (p)*0x0002)
#define USBFS_PIPECTR_BSTS                (1 << 15) /* 8000: Buffer Status */
#define USBFS_PIPECTR_ACLRM               (1 <<  9) /* 200: Auto Buffer Clear Mode */
#define USBFS_PIPECTR_SQCLR               (1 <<  8) /* 100: Sequence Toggle Bit Clear */
#define USBFS_PIPECTR_SQSET               (1 <<  7) /* 80: Sequence Toggle Bit Set */
#define USBFS_PIPECTR_SQMON               (1 <<  6) /* 40: Sequence Toggle Bit Confirmation */
#define USBFS_PIPECTR_PBUSY               (1 <<  5) /* 20: Pipe Busy */
#define USBFS_PIPECTR_PID                 (2 <<  0) /* 01: Response PID */
#define USBFS_PIPECTR_PID_MASK                 (0x03)
#define USBFS_PIPETRE_SIZE                5
#define USBFS_PIPETRE_OFFSET              0x0090
#define USBFS_PIPETRE(p)                  (USBFS_BASE + USBFS_PIPETRE_OFFSET + (p)*0x0004)
#define USBFS_PIPETRE_TRENB               (1 <<  9) /* 200: Transaction Counter Enable */
#define USBFS_PIPETRE_TRCLR               (1 <<  8) /* 100: Transaction Counter Clear */
#define USBFS_PIPETRN_SIZE                5
#define USBFS_PIPETRN_OFFSET              0x0092
#define USBFS_PIPETRN(p)                  (USBFS_BASE + USBFS_PIPETRN_OFFSET + (p)*0x0004)
#define USBFS_PIPETRN_TRNCNT              (16 <<  0) /* 01: Transaction Counter */
#define USBFS_PIPETRN_TRNCNT_MASK              (0xffff)
#define USBFS_DEVADD_SIZE                 6
#define USBFS_DEVADD_OFFSET               0x00d0
#define USBFS_DEVADD(p)                   (USBFS_BASE + USBFS_DEVADD_OFFSET + (p)*0x0002)
#define USBFS_DEVADD_USBSPD               (2 <<  6) /* 40: Transfer Speed of Communication Target Device */
#define USBFS_DEVADD_USBSPD_MASK               (0x03)
#define USBFS_USBMC_OFFSET                0x00cc
#define USBFS_USBMC                       (USBFS_BASE + USBFS_USBMC_OFFSET)
#define USBFS_USBMC_VDCEN                 (1 <<  7) /* 80: USB Regulator On/Off Control */
#define USBFS_USBMC_VDDUSBE               (1 <<  0) /* 01: USB Reference Power Supply Circuit On/Off Control */
#define USBFS_USBBCCTRL0_OFFSET           0x00b0
#define USBFS_USBBCCTRL0                  (USBFS_BASE + USBFS_USBBCCTRL0_OFFSET)
#define USBFS_USBBCCTRL0_PDDETSTS0        (1 <<  9) /* 200: D+ Pin 0.6 V Input Detection Status */
#define USBFS_USBBCCTRL0_CHGDETSTS0       (1 <<  8) /* 100: D- Pin 0.6 V Input Detection Status */
#define USBFS_USBBCCTRL0_BATCHGE0         (1 <<  7) /* 80: BC (Battery Charger) Function Ch0 General Enable Control */
#define USBFS_USBBCCTRL0_VDMSRCE0         (1 <<  5) /* 20: D- Pin VDMSRC (0.6 V) Output Control */
#define USBFS_USBBCCTRL0_IDPSINKE0        (1 <<  4) /* 10: D+ Pin 0.6 V Input Detection (Comparator and Sink) Control */
#define USBFS_USBBCCTRL0_VDPSRCE0         (1 <<  3) /* 08: D+ Pin VDPSRC (0.6 V) Output Control */
#define USBFS_USBBCCTRL0_IDMSINKE0        (1 <<  2) /* 04: D- Pin 0.6 V Input Detection (Comparator and Sink) Control */
#define USBFS_USBBCCTRL0_IDPSRCE0         (1 <<  1) /* 02: D+ Pin IDPSRC Output Control */
#define USBFS_USBBCCTRL0_RPDME0           (1 <<  0) /* 01: D- Pin Pull-Down Control */

/* WDT - Watchdog Timer */
#define WDT_BASE                          0x40044200
#define WDT_WDTRR_OFFSET                  0x0000
#define WDT_WDTRR                         (WDT_BASE + WDT_WDTRR_OFFSET)
#define WDT_WDTRR_WDTRR                   (8 <<  0) /* 01: WDTRR is an 8-bit register that refreshes the down-counter of the WDT. */
#define WDT_WDTRR_WDTRR_MASK                   (0xff)
#define WDT_WDTCR_OFFSET                  0x0002
#define WDT_WDTCR                         (WDT_BASE + WDT_WDTCR_OFFSET)
#define WDT_WDTCR_RPSS                    (2 << 12) /* 1000: Window Start Position Selection */
#define WDT_WDTCR_RPSS_MASK                    (0x03)
#define WDT_WDTCR_RPES                    (2 <<  8) /* 100: Window End Position Selection */
#define WDT_WDTCR_RPES_MASK                    (0x03)
#define WDT_WDTCR_CKS                     (4 <<  4) /* 10: Clock Division Ratio Selection */
#define WDT_WDTCR_CKS_MASK                     (0x0f)
#define WDT_WDTCR_TOPS                    (2 <<  0) /* 01: Timeout Period Selection */
#define WDT_WDTCR_TOPS_MASK                    (0x03)
#define WDT_WDTSR_OFFSET                  0x0004
#define WDT_WDTSR                         (WDT_BASE + WDT_WDTSR_OFFSET)
#define WDT_WDTSR_REFEF                   (1 << 15) /* 8000: Refresh Error Flag */
#define WDT_WDTSR_UNDFF                   (1 << 14) /* 4000: Underflow Flag */
#define WDT_WDTSR_CNTVAL                  (14 <<  0) /* 01: Down-Counter Value Value counted by the down-counter */
#define WDT_WDTSR_CNTVAL_MASK                  (0x3fff)
#define WDT_WDTRCR_OFFSET                 0x0006
#define WDT_WDTRCR                        (WDT_BASE + WDT_WDTRCR_OFFSET)
#define WDT_WDTRCR_RSTIRQS                (1 <<  7) /* 80: Reset Interrupt Request Selection */
#define WDT_WDTCSTPR_OFFSET               0x0008
#define WDT_WDTCSTPR                      (WDT_BASE + WDT_WDTCSTPR_OFFSET)
#define WDT_WDTCSTPR_SLCSTP               (1 <<  7) /* 80: Sleep-Mode Count Stop Control */

/* ACMPLP - Low-Power Analog Comparator */
#define ACMPLP_BASE                       0x40085e00
#define ACMPLP_COMPMDR_OFFSET             0x0000
#define ACMPLP_COMPMDR                    (ACMPLP_BASE + ACMPLP_COMPMDR_OFFSET)
#define ACMPLP_COMPMDR_C1MON              (1 <<  7) /* 80: ACMPLP1 Monitor Flag */
#define ACMPLP_COMPMDR_C1VRF              (1 <<  6) /* 40: ACMPLP1 Reference Voltage Selection */
#define ACMPLP_COMPMDR_C1WDE              (1 <<  5) /* 20: ACMPLP1 Window Function Mode Enable */
#define ACMPLP_COMPMDR_C1ENB              (1 <<  4) /* 10: ACMPLP1 Operation Enable */
#define ACMPLP_COMPMDR_C0MON              (1 <<  3) /* 08: ACMPLP0 Monitor Flag */
#define ACMPLP_COMPMDR_C0VRF              (1 <<  2) /* 04: ACMPLP0 Reference Voltage Selection */
#define ACMPLP_COMPMDR_C0WDE              (1 <<  1) /* 02: ACMPLP0 Window Function Mode Enable */
#define ACMPLP_COMPMDR_C0ENB              (1 <<  0) /* 01: ACMPLP0 Operation Enable */
#define ACMPLP_COMPFIR_OFFSET             0x0001
#define ACMPLP_COMPFIR                    (ACMPLP_BASE + ACMPLP_COMPFIR_OFFSET)
#define ACMPLP_COMPFIR_C1EDG              (1 <<  7) /* 80: ACMPLP1 Edge Detection Selection */
#define ACMPLP_COMPFIR_C1EPO              (1 <<  6) /* 40: ACMPLP1 Edge Polarity Switching */
#define ACMPLP_COMPFIR_C1FCK              (2 <<  4) /* 10: ACMPLP1 Filter Select */
#define ACMPLP_COMPFIR_C1FCK_MASK              (0x03)
#define ACMPLP_COMPFIR_C0EDG              (1 <<  3) /* 08: ACMPLP0 Edge Detection Selection */
#define ACMPLP_COMPFIR_C0EPO              (1 <<  2) /* 04: ACMPLP0 Edge Polarity Switching */
#define ACMPLP_COMPFIR_C0FCK              (2 <<  0) /* 01: ACMPLP0 Filter Select */
#define ACMPLP_COMPFIR_C0FCK_MASK              (0x03)
#define ACMPLP_COMPOCR_OFFSET             0x0002
#define ACMPLP_COMPOCR                    (ACMPLP_BASE + ACMPLP_COMPOCR_OFFSET)
#define ACMPLP_COMPOCR_SPDMD              (1 <<  7) /* 80: ACMPLP0/ACMPLP1 Speed Selection */
#define ACMPLP_COMPOCR_C1OP               (1 <<  6) /* 40: ACMPLP1 VCOUT Output Polarity Selection */
#define ACMPLP_COMPOCR_C1OE               (1 <<  5) /* 20: ACMPLP1 VCOUT Pin Output Enable */
#define ACMPLP_COMPOCR_C0OP               (1 <<  2) /* 04: ACMPLP0 VCOUT Output Polarity Selection */
#define ACMPLP_COMPOCR_C0OE               (1 <<  1) /* 02: ACMPLP0 VCOUT Pin Output Enable */
#define ACMPLP_COMPSEL0_OFFSET            0x0004
#define ACMPLP_COMPSEL0                   (ACMPLP_BASE + ACMPLP_COMPSEL0_OFFSET)
#define ACMPLP_COMPSEL0_CMPSEL64          (3 <<  4) /* 10: ACMPLP1 Input (IVCMP1) Selection */
#define ACMPLP_COMPSEL0_CMPSEL64_MASK          (0x07)
#define ACMPLP_COMPSEL0_CMPSEL20          (3 <<  0) /* 01: ACMPLP0 Input(IVCMP0) Selection */
#define ACMPLP_COMPSEL0_CMPSEL20_MASK          (0x07)
#define ACMPLP_COMPSEL1_OFFSET            0x0005
#define ACMPLP_COMPSEL1                   (ACMPLP_BASE + ACMPLP_COMPSEL1_OFFSET)
#define ACMPLP_COMPSEL1_C1VRF2            (1 <<  7) /* 80: ACMPLP1 Reference Voltage Selection */
#define ACMPLP_COMPSEL1_CRVS64            (3 <<  4) /* 10: ACMPLP1 Reference Voltage(IVREF1) Selection */
#define ACMPLP_COMPSEL1_CRVS64_MASK            (0x07)
#define ACMPLP_COMPSEL1_CRVS20            (3 <<  0) /* 01: ACMPLP0 Reference Voltage(IVREF0) Selection* */
#define ACMPLP_COMPSEL1_CRVS20_MASK            (0x07)

