leocafonso/svdtoheaders/demo/h/ra4m1_reg.h
/* ADC140 - 14bit A/D Converter */
#define ADC140_BASE                       0x4005c000
#define ADC140_ADCSR_OFFSET               0x0000
#define ADC140_ADCSR                      (ADC140_BASE + ADC140_ADCSR_OFFSET)
#define ADC140_ADCSR_ADST                 (1 << 15) /* 8000: A/D Conversion Start */
#define ADC140_ADCSR_ADCS                 (2 << 13) /* 2000: Scan Mode Select */
#define ADC140_ADCSR_ADCS_MASK                 (0x03)
#define ADC140_ADCSR_ADHSC                (1 << 10) /* 400: A/D Conversion Operation Mode Select */
#define ADC140_ADCSR_TRGE                 (1 <<  9) /* 200: Trigger Start Enable */
#define ADC140_ADCSR_EXTRG                (1 <<  8) /* 100: Trigger Select */
#define ADC140_ADCSR_DBLE                 (1 <<  7) /* 80: Double Trigger Mode Select */
#define ADC140_ADCSR_GBADIE               (1 <<  6) /* 40: Group B Scan End Interrupt Enable */
#define ADC140_ADCSR_DBLANS               (5 <<  0) /* 01: Double Trigger Channel Select These bits select one analog input channel for double triggered operation. The setting is only effective while double trigger mode is selected. */
#define ADC140_ADCSR_DBLANS_MASK               (0x1f)
#define ADC140_ADANSA0_OFFSET             0x0004
#define ADC140_ADANSA0                    (ADC140_BASE + ADC140_ADANSA0_OFFSET)
#define ADC140_ADANSA0_ANSA014            (1 << 14) /* 4000: AN014 Select */
#define ADC140_ADANSA0_ANSA013            (1 << 13) /* 2000: AN013 Select */
#define ADC140_ADANSA0_ANSA012            (1 << 12) /* 1000: AN012 Select */
#define ADC140_ADANSA0_ANSA011            (1 << 11) /* 800: AN011 Select */
#define ADC140_ADANSA0_ANSA010            (1 << 10) /* 400: AN010 Select */
#define ADC140_ADANSA0_ANSA09             (1 <<  9) /* 200: AN009 Select */
#define ADC140_ADANSA0_ANSA08             (1 <<  8) /* 100: AN008 Select */
#define ADC140_ADANSA0_ANSA07             (1 <<  7) /* 80: AN007 Select */
#define ADC140_ADANSA0_ANSA06             (1 <<  6) /* 40: AN006 Select */
#define ADC140_ADANSA0_ANSA05             (1 <<  5) /* 20: AN005 Select */
#define ADC140_ADANSA0_ANSA04             (1 <<  4) /* 10: AN004 Select */
#define ADC140_ADANSA0_ANSA03             (1 <<  3) /* 08: AN003 Select */
#define ADC140_ADANSA0_ANSA02             (1 <<  2) /* 04: AN002 Select */
#define ADC140_ADANSA0_ANSA01             (1 <<  1) /* 02: AN001 Select */
#define ADC140_ADANSA0_ANSA00             (1 <<  0) /* 01: AN000 Select */
#define ADC140_ADANSA1_OFFSET             0x0006
#define ADC140_ADANSA1                    (ADC140_BASE + ADC140_ADANSA1_OFFSET)
#define ADC140_ADANSA1_ANSA25             (1 <<  9) /* 200: AN025 Select */
#define ADC140_ADANSA1_ANSA24             (1 <<  8) /* 100: AN024 Select */
#define ADC140_ADANSA1_ANSA23             (1 <<  7) /* 80: AN023 Select */
#define ADC140_ADANSA1_ANSA22             (1 <<  6) /* 40: AN022 Select */
#define ADC140_ADANSA1_ANSA21             (1 <<  5) /* 20: AN021 Select */
#define ADC140_ADANSA1_ANSA20             (1 <<  4) /* 10: AN020 Select */
#define ADC140_ADANSA1_ANSA19             (1 <<  3) /* 08: AN019 Select */
#define ADC140_ADANSA1_ANSA18             (1 <<  2) /* 04: AN018 Select */
#define ADC140_ADANSA1_ANSA17             (1 <<  1) /* 02: AN017 Select */
#define ADC140_ADANSA1_ANSA16             (1 <<  0) /* 01: AN016 Select */
#define ADC140_ADADS0_OFFSET              0x0008
#define ADC140_ADADS0                     (ADC140_BASE + ADC140_ADADS0_OFFSET)
#define ADC140_ADADS0_ADS14               (1 << 14) /* 4000: A/D-Converted Value Addition/Average Channel AN014 Select */
#define ADC140_ADADS0_ADS13               (1 << 13) /* 2000: A/D-Converted Value Addition/Average Channel AN013 Select */
#define ADC140_ADADS0_ADS12               (1 << 12) /* 1000: A/D-Converted Value Addition/Average Channel AN012 Select */
#define ADC140_ADADS0_ADS11               (1 << 11) /* 800: A/D-Converted Value Addition/Average Channel AN011 Select */
#define ADC140_ADADS0_ADS10               (1 << 10) /* 400: A/D-Converted Value Addition/Average Channel AN010 Select */
#define ADC140_ADADS0_ADS09               (1 <<  9) /* 200: A/D-Converted Value Addition/Average Channel AN009 Select */
#define ADC140_ADADS0_ADS08               (1 <<  8) /* 100: A/D-Converted Value Addition/Average Channel AN008 Select */
#define ADC140_ADADS0_ADS07               (1 <<  7) /* 80: A/D-Converted Value Addition/Average Channel AN007 Select */
#define ADC140_ADADS0_ADS06               (1 <<  6) /* 40: A/D-Converted Value Addition/Average Channel AN006 Select */
#define ADC140_ADADS0_ADS05               (1 <<  5) /* 20: A/D-Converted Value Addition/Average Channel AN005 Select */
#define ADC140_ADADS0_ADS04               (1 <<  4) /* 10: A/D-Converted Value Addition/Average Channel AN004 Select */
#define ADC140_ADADS0_ADS03               (1 <<  3) /* 08: A/D-Converted Value Addition/Average Channel AN003 Select */
#define ADC140_ADADS0_ADS02               (1 <<  2) /* 04: A/D-Converted Value Addition/Average Channel AN002 Select */
#define ADC140_ADADS0_ADS01               (1 <<  1) /* 02: A/D-Converted Value Addition/Average Channel AN001 Select */
#define ADC140_ADADS0_ADS00               (1 <<  0) /* 01: A/D-Converted Value Addition/Average Channel AN000 Select */
#define ADC140_ADADS1_OFFSET              0x000a
#define ADC140_ADADS1                     (ADC140_BASE + ADC140_ADADS1_OFFSET)
#define ADC140_ADADS1_ADS25               (1 <<  9) /* 200: A/D-Converted Value Addition/Average Channel AN025 Select */
#define ADC140_ADADS1_ADS24               (1 <<  8) /* 100: A/D-Converted Value Addition/Average Channel AN024 Select */
#define ADC140_ADADS1_ADS23               (1 <<  7) /* 80: A/D-Converted Value Addition/Average Channel AN023 Select */
#define ADC140_ADADS1_ADS22               (1 <<  6) /* 40: A/D-Converted Value Addition/Average Channel AN022 Select */
#define ADC140_ADADS1_ADS21               (1 <<  5) /* 20: A/D-Converted Value Addition/Average Channel AN021 Select */
#define ADC140_ADADS1_ADS20               (1 <<  4) /* 10: A/D-Converted Value Addition/Average Channel AN020 Select */
#define ADC140_ADADS1_ADS19               (1 <<  3) /* 08: A/D-Converted Value Addition/Average Channel AN019 Select */
#define ADC140_ADADS1_ADS18               (1 <<  2) /* 04: A/D-Converted Value Addition/Average Channel AN018 Select */
#define ADC140_ADADS1_ADS17               (1 <<  1) /* 02: A/D-Converted Value Addition/Average Channel AN017 Select */
#define ADC140_ADADS1_ADS16               (1 <<  0) /* 01: A/D-Converted Value Addition/Average Channel AN016 Select */
#define ADC140_ADADC_OFFSET               0x000c
#define ADC140_ADADC                      (ADC140_BASE + ADC140_ADADC_OFFSET)
#define ADC140_ADADC_AVEE                 (1 <<  7) /* 80: Average mode enable bit. Note: The AVEE bit converts twice, and only when converting it four times, is effective. Please do not set (ADADC.AVEE=1) to conversion (ADADC.ADC 2:0=010b) three times when you select the average mode. */
#define ADC140_ADADC_ADC                  (3 <<  0) /* 01: Addition frequency selection bit. NOTE: AVEE bit is valid at the only setting of ADC[2:0] bits = 001b or 011b. When average mode is selected by setting the ADADC.AVEE bit to 1, do not set the addition count to three times (ADADC.ADC[2:0] = 010b) */
#define ADC140_ADADC_ADC_MASK                  (0x07)
#define ADC140_ADCER_OFFSET               0x000e
#define ADC140_ADCER                      (ADC140_BASE + ADC140_ADCER_OFFSET)
#define ADC140_ADCER_ADRFMT               (1 << 15) /* 8000: A/D Data Register Format Select */
#define ADC140_ADCER_DIAGM                (1 << 11) /* 800: Self-Diagnosis Enable */
#define ADC140_ADCER_DIAGLD               (1 << 10) /* 400: Self-Diagnosis Mode Select */
#define ADC140_ADCER_DIAGVAL              (2 <<  8) /* 100: Self-Diagnosis Conversion Voltage Select */
#define ADC140_ADCER_DIAGVAL_MASK              (0x03)
#define ADC140_ADCER_ACE                  (1 <<  5) /* 20: A/D Data Register Automatic Clearing Enable */
#define ADC140_ADCER_ADPRC                (2 <<  1) /* 02: A/D Conversion Accuracy Specify */
#define ADC140_ADCER_ADPRC_MASK                (0x03)
#define ADC140_ADSTRGR_OFFSET             0x0010
#define ADC140_ADSTRGR                    (ADC140_BASE + ADC140_ADSTRGR_OFFSET)
#define ADC140_ADSTRGR_TRSA               (6 <<  8) /* 100: A/D Conversion Start Trigger Select Select the A/D conversion start trigger in single scan mode and continuous mode. In group scan mode, the A/D conversion start trigger for group A is selected. */
#define ADC140_ADSTRGR_TRSA_MASK               (0x3f)
#define ADC140_ADSTRGR_TRSB               (6 <<  0) /* 01: A/D Conversion Start Trigger Select for Group B Select the A/D conversion start trigger for group B in group scan mode. */
#define ADC140_ADSTRGR_TRSB_MASK               (0x3f)
#define ADC140_ADEXICR_OFFSET             0x0012
#define ADC140_ADEXICR                    (ADC140_BASE + ADC140_ADEXICR_OFFSET)
#define ADC140_ADEXICR_OCSA               (1 <<  9) /* 200: Internal Reference Voltage A/D Conversion Select */
#define ADC140_ADEXICR_TSSA               (1 <<  8) /* 100: Temperature Sensor Output A/D Conversion Select */
#define ADC140_ADEXICR_OCSAD              (1 <<  1) /* 02: Internal Reference Voltage A/D converted Value Addition/Average Mode Select */
#define ADC140_ADEXICR_TSSAD              (1 <<  0) /* 01: Temperature Sensor Output A/D converted Value Addition/Average Mode Select */
#define ADC140_ADANSB0_OFFSET             0x0014
#define ADC140_ADANSB0                    (ADC140_BASE + ADC140_ADANSB0_OFFSET)
#define ADC140_ADANSB0_ANSB14             (1 << 14) /* 4000: AN014 Select */
#define ADC140_ADANSB0_ANSB13             (1 << 13) /* 2000: AN013 Select */
#define ADC140_ADANSB0_ANSB12             (1 << 12) /* 1000: AN012 Select */
#define ADC140_ADANSB0_ANSB11             (1 << 11) /* 800: AN011 Select */
#define ADC140_ADANSB0_ANSB10             (1 << 10) /* 400: AN010 Select */
#define ADC140_ADANSB0_ANSB09             (1 <<  9) /* 200: AN009 Select */
#define ADC140_ADANSB0_ANSB08             (1 <<  8) /* 100: AN008 Select */
#define ADC140_ADANSB0_ANSB07             (1 <<  7) /* 80: AN007 Select */
#define ADC140_ADANSB0_ANSB06             (1 <<  6) /* 40: AN006 Select */
#define ADC140_ADANSB0_ANSB05             (1 <<  5) /* 20: AN005 Select */
#define ADC140_ADANSB0_ANSB04             (1 <<  4) /* 10: AN004 Select */
#define ADC140_ADANSB0_ANSB03             (1 <<  3) /* 08: AN003 Select */
#define ADC140_ADANSB0_ANSB02             (1 <<  2) /* 04: AN002 Select */
#define ADC140_ADANSB0_ANSB01             (1 <<  1) /* 02: AN001 Select */
#define ADC140_ADANSB0_ANSB00             (1 <<  0) /* 01: AN000 Select */
#define ADC140_ADANSB1_OFFSET             0x0016
#define ADC140_ADANSB1                    (ADC140_BASE + ADC140_ADANSB1_OFFSET)
#define ADC140_ADANSB1_ANSB25             (1 <<  9) /* 200: AN025 Select */
#define ADC140_ADANSB1_ANSB24             (1 <<  8) /* 100: AN024 Select */
#define ADC140_ADANSB1_ANSB23             (1 <<  7) /* 80: AN023 Select */
#define ADC140_ADANSB1_ANSB22             (1 <<  6) /* 40: AN022 Select */
#define ADC140_ADANSB1_ANSB21             (1 <<  5) /* 20: AN021 Select */
#define ADC140_ADANSB1_ANSB20             (1 <<  4) /* 10: AN020 Select */
#define ADC140_ADANSB1_ANSB19             (1 <<  3) /* 08: AN019 Select */
#define ADC140_ADANSB1_ANSB18             (1 <<  2) /* 04: AN018 Select */
#define ADC140_ADANSB1_ANSB17             (1 <<  1) /* 02: AN017 Select */
#define ADC140_ADANSB1_ANSB16             (1 <<  0) /* 01: AN016 Select */
#define ADC140_ADDBLDR_OFFSET             0x0018
#define ADC140_ADDBLDR                    (ADC140_BASE + ADC140_ADDBLDR_OFFSET)
#define ADC140_ADDBLDR_ADDBLDR            (16 <<  0) /* 01: This is a 16-bit read-only register for storing the result of A/D conversion in response to the second trigger in double trigger mode. */
#define ADC140_ADDBLDR_ADDBLDR_MASK            (0xffff)
#define ADC140_ADTSDR_OFFSET              0x001a
#define ADC140_ADTSDR                     (ADC140_BASE + ADC140_ADTSDR_OFFSET)
#define ADC140_ADTSDR_ADTSDR              (16 <<  0) /* 01: This is a 16-bit read-only register for storing the A/D conversion result of temperature sensor output. */
#define ADC140_ADTSDR_ADTSDR_MASK              (0xffff)
#define ADC140_ADOCDR_OFFSET              0x001c
#define ADC140_ADOCDR                     (ADC140_BASE + ADC140_ADOCDR_OFFSET)
#define ADC140_ADOCDR_ADOCDR              (16 <<  0) /* 01: This is a 16-bit read-only register for storing the A/D result of internal reference voltage. */
#define ADC140_ADOCDR_ADOCDR_MASK              (0xffff)
#define ADC140_ADRD_OFFSET                0x001e
#define ADC140_ADRD                       (ADC140_BASE + ADC140_ADRD_OFFSET)
#define ADC140_ADRD_DIAGST                (2 << 14) /* 4000: Self-Diagnosis Status */
#define ADC140_ADRD_DIAGST_MASK                (0x03)
#define ADC140_ADRD_AD                    (14 <<  0) /* 01: A/D-converted value (right-justified) The format for data determine ADCER.ADRFMT and ADCER.ADPRC. */
#define ADC140_ADRD_AD_MASK                    (0x3fff)
#define ADC140_ADDR_SIZE                  15
#define ADC140_ADDR_OFFSET                0x0020
#define ADC140_ADDR(p)                    (ADC140_BASE + ADC140_ADDR_OFFSET + (p)*0x0002)
#define ADC140_ADDR_ADDR                  (16 <<  0) /* 01: The ADDR register is a 16-bit read-only registers for storing the result of A/D conversion. */
#define ADC140_ADDR_ADDR_MASK                  (0xffff)
#define ADC140_ADDR_SIZE                  10
#define ADC140_ADDR_OFFSET                0x0040
#define ADC140_ADDR(p)                    (ADC140_BASE + ADC140_ADDR_OFFSET + (p)*0x0002)
#define ADC140_ADDR_ADDR                  (16 <<  0) /* 01: The ADDR register is a 16-bit read-only registers for storing the result of A/D conversion. */
#define ADC140_ADDR_ADDR_MASK                  (0xffff)
#define ADC140_ADDISCR_OFFSET             0x007a
#define ADC140_ADDISCR                    (ADC140_BASE + ADC140_ADDISCR_OFFSET)
#define ADC140_ADDISCR_PCHG               (1 <<  4) /* 10: Selection of Precharge or Discharge */
#define ADC140_ADDISCR_ADNDIS             (4 <<  0) /* 01: The charging time */
#define ADC140_ADDISCR_ADNDIS_MASK             (0x0f)
#define ADC140_ADGSPCR_OFFSET             0x0080
#define ADC140_ADGSPCR                    (ADC140_BASE + ADC140_ADGSPCR_OFFSET)
#define ADC140_ADGSPCR_GBRP               (1 << 15) /* 8000: Group B Single Scan Continuous Start (Enabled only when PGS = 1. Reserved when PGS = 0.) Note: When the GBRP bit has been set to 1, single scan is performed continuously for group B regardless of the setting of the GBRSCN bit. */
#define ADC140_ADGSPCR_GBRSCN             (1 <<  1) /* 02: Group B Restart Setting (Enabled only when PGS = 1. Reserved when PGS = 0.) */
#define ADC140_ADGSPCR_PGS                (1 <<  0) /* 01: Group A priority control setting bit. Note: When the PGS bit is to be set to 1, the ADCSR.ADCS[1:0] bits must be set to 01b (group scan mode). If the bits are set to any other values, proper operation is not guaranteed. */
#define ADC140_ADDBLDRA_OFFSET            0x0084
#define ADC140_ADDBLDRA                   (ADC140_BASE + ADC140_ADDBLDRA_OFFSET)
#define ADC140_ADDBLDRA_ADDBLDRA          (16 <<  0) /* 01: This register is a 16-bit read-only registers for storing the result of A/D conversion in response to the respective triggers during extended operation in double trigger mode. */
#define ADC140_ADDBLDRA_ADDBLDRA_MASK          (0xffff)
#define ADC140_ADDBLDRB_OFFSET            0x0086
#define ADC140_ADDBLDRB                   (ADC140_BASE + ADC140_ADDBLDRB_OFFSET)
#define ADC140_ADDBLDRB_ADDBLDRB          (16 <<  0) /* 01: This register is a 16-bit read-only registers for storing the result of A/D conversion in response to the respective triggers during extended operation in double trigger mode. */
#define ADC140_ADDBLDRB_ADDBLDRB_MASK          (0xffff)
#define ADC140_ADHVREFCNT_OFFSET          0x008a
#define ADC140_ADHVREFCNT                 (ADC140_BASE + ADC140_ADHVREFCNT_OFFSET)
#define ADC140_ADHVREFCNT_ADSLP           (1 <<  7) /* 80: Sleep */
#define ADC140_ADHVREFCNT_LVSEL           (3 <<  2) /* 04: Low-Potential Reference Voltage Select */
#define ADC140_ADHVREFCNT_LVSEL_MASK           (0x07)
#define ADC140_ADHVREFCNT_HVSEL           (2 <<  0) /* 01: High-Potential Reference Voltage Select */
#define ADC140_ADHVREFCNT_HVSEL_MASK           (0x03)
#define ADC140_ADWINMON_OFFSET            0x008c
#define ADC140_ADWINMON                   (ADC140_BASE + ADC140_ADWINMON_OFFSET)
#define ADC140_ADWINMON_MONCMPB           (1 <<  5) /* 20: Comparison Result Monitor B */
#define ADC140_ADWINMON_MONCMPA           (1 <<  4) /* 10: Comparison Result Monitor A */
#define ADC140_ADWINMON_MONCOMB           (1 <<  0) /* 01: Combination result monitor This bit indicates the combination result. This bit is valid when both window A operation and window B operation are enabled. */
#define ADC140_ADCMPCR_OFFSET             0x0090
#define ADC140_ADCMPCR                    (ADC140_BASE + ADC140_ADCMPCR_OFFSET)
#define ADC140_ADCMPCR_CMPAIE             (1 << 15) /* 8000: Compare A Interrupt Enable */
#define ADC140_ADCMPCR_WCMPE              (1 << 14) /* 4000: Window Function Setting */
#define ADC140_ADCMPCR_CMPBIE             (1 << 13) /* 2000: Compare B Interrupt Enable */
#define ADC140_ADCMPCR_CMPAE              (1 << 11) /* 800: Compare Window A Operation Enable */
#define ADC140_ADCMPCR_CMPBE              (1 <<  9) /* 200: Compare Window B Operation Enable */
#define ADC140_ADCMPCR_CMPAB              (2 <<  0) /* 01: Window A/B Composite Conditions Setting NOTE: These bits are valid when both window A and window B are enabled (CMPAE = 1 and CMPBE = 1). */
#define ADC140_ADCMPCR_CMPAB_MASK              (0x03)
#define ADC140_ADCMPANSER_OFFSET          0x0092
#define ADC140_ADCMPANSER                 (ADC140_BASE + ADC140_ADCMPANSER_OFFSET)
#define ADC140_ADCMPANSER_CMPOCA          (1 <<  1) /* 02: Internal reference voltage Compare selection bit. */
#define ADC140_ADCMPANSER_CMPTSA          (1 <<  0) /* 01: Temperature sensor output Compare selection bit. */
#define ADC140_ADCMPLER_OFFSET            0x0093
#define ADC140_ADCMPLER                   (ADC140_BASE + ADC140_ADCMPLER_OFFSET)
#define ADC140_ADCMPLER_CMPLOCA           (1 <<  1) /* 02: Compare Window A Internal Reference Voltage Comparison Condition Select */
#define ADC140_ADCMPLER_CMPLTSA           (1 <<  0) /* 01: Compare Window A Temperature Sensor Output Comparison Condition Select */
#define ADC140_ADCMPANSR0_OFFSET          0x0094
#define ADC140_ADCMPANSR0                 (ADC140_BASE + ADC140_ADCMPANSR0_OFFSET)
#define ADC140_ADCMPANSR0_CMPCHA14        (1 << 14) /* 4000: AN014 Select */
#define ADC140_ADCMPANSR0_CMPCHA13        (1 << 13) /* 2000: AN013 Select */
#define ADC140_ADCMPANSR0_CMPCHA12        (1 << 12) /* 1000: AN012 Select */
#define ADC140_ADCMPANSR0_CMPCHA11        (1 << 11) /* 800: AN011 Select */
#define ADC140_ADCMPANSR0_CMPCHA10        (1 << 10) /* 400: AN010 Select */
#define ADC140_ADCMPANSR0_CMPCHA09        (1 <<  9) /* 200: AN009 Select */
#define ADC140_ADCMPANSR0_CMPCHA08        (1 <<  8) /* 100: AN008 Select */
#define ADC140_ADCMPANSR0_CMPCHA07        (1 <<  7) /* 80: AN007 Select */
#define ADC140_ADCMPANSR0_CMPCHA06        (1 <<  6) /* 40: AN006 Select */
#define ADC140_ADCMPANSR0_CMPCHA05        (1 <<  5) /* 20: AN005 Select */
#define ADC140_ADCMPANSR0_CMPCHA04        (1 <<  4) /* 10: AN004 Select */
#define ADC140_ADCMPANSR0_CMPCHA03        (1 <<  3) /* 08: AN003 Select */
#define ADC140_ADCMPANSR0_CMPCHA02        (1 <<  2) /* 04: AN002 Select */
#define ADC140_ADCMPANSR0_CMPCHA01        (1 <<  1) /* 02: AN001 Select */
#define ADC140_ADCMPANSR0_CMPCHA00        (1 <<  0) /* 01: AN000 Select */
#define ADC140_ADCMPANSR1_OFFSET          0x0096
#define ADC140_ADCMPANSR1                 (ADC140_BASE + ADC140_ADCMPANSR1_OFFSET)
#define ADC140_ADCMPANSR1_CMPCHA25        (1 <<  9) /* 200: AN025 Select */
#define ADC140_ADCMPANSR1_CMPCHA24        (1 <<  8) /* 100: AN024 Select */
#define ADC140_ADCMPANSR1_CMPCHA23        (1 <<  7) /* 80: AN023 Select */
#define ADC140_ADCMPANSR1_CMPCHA22        (1 <<  6) /* 40: AN022 Select */
#define ADC140_ADCMPANSR1_CMPCHA21        (1 <<  5) /* 20: AN021 Select */
#define ADC140_ADCMPANSR1_CMPCHA20        (1 <<  4) /* 10: AN020 Select */
#define ADC140_ADCMPANSR1_CMPCHA19        (1 <<  3) /* 08: AN019 Select */
#define ADC140_ADCMPANSR1_CMPCHA18        (1 <<  2) /* 04: AN018 Select */
#define ADC140_ADCMPANSR1_CMPCHA17        (1 <<  1) /* 02: AN017 Select */
#define ADC140_ADCMPANSR1_CMPCHA16        (1 <<  0) /* 01: AN016 Select */
#define ADC140_ADCMPLR0_OFFSET            0x0098
#define ADC140_ADCMPLR0                   (ADC140_BASE + ADC140_ADCMPLR0_OFFSET)
#define ADC140_ADCMPLR0_CMPLCHA14         (1 << 14) /* 4000: Comparison condition of AN014 */
#define ADC140_ADCMPLR0_CMPLCHA13         (1 << 13) /* 2000: Comparison condition of AN013 */
#define ADC140_ADCMPLR0_CMPLCHA12         (1 << 12) /* 1000: Comparison condition of AN012 */
#define ADC140_ADCMPLR0_CMPLCHA11         (1 << 11) /* 800: Comparison condition of AN011 */
#define ADC140_ADCMPLR0_CMPLCHA10         (1 << 10) /* 400: Comparison condition of AN010 */
#define ADC140_ADCMPLR0_CMPLCHA09         (1 <<  9) /* 200: Comparison condition of AN009 */
#define ADC140_ADCMPLR0_CMPLCHA08         (1 <<  8) /* 100: Comparison condition of AN008 */
#define ADC140_ADCMPLR0_CMPLCHA07         (1 <<  7) /* 80: Comparison condition of AN007 */
#define ADC140_ADCMPLR0_CMPLCHA06         (1 <<  6) /* 40: Comparison condition of AN006 */
#define ADC140_ADCMPLR0_CMPLCHA05         (1 <<  5) /* 20: Comparison condition of AN005 */
#define ADC140_ADCMPLR0_CMPLCHA04         (1 <<  4) /* 10: Comparison condition of AN004 */
#define ADC140_ADCMPLR0_CMPLCHA03         (1 <<  3) /* 08: Comparison condition of AN003 */
#define ADC140_ADCMPLR0_CMPLCHA02         (1 <<  2) /* 04: Comparison condition of AN002 */
#define ADC140_ADCMPLR0_CMPLCHA01         (1 <<  1) /* 02: Comparison condition of AN001 */
#define ADC140_ADCMPLR0_CMPLCHA00         (1 <<  0) /* 01: Comparison condition of AN000 */
#define ADC140_ADCMPLR1_OFFSET            0x009a
#define ADC140_ADCMPLR1                   (ADC140_BASE + ADC140_ADCMPLR1_OFFSET)
#define ADC140_ADCMPLR1_CMPLCHA25         (1 <<  9) /* 200: Comparison condition of AN025 */
#define ADC140_ADCMPLR1_CMPLCHA24         (1 <<  8) /* 100: Comparison condition of AN024 */
#define ADC140_ADCMPLR1_CMPLCHA23         (1 <<  7) /* 80: Comparison condition of AN023 */
#define ADC140_ADCMPLR1_CMPLCHA22         (1 <<  6) /* 40: Comparison condition of AN022 */
#define ADC140_ADCMPLR1_CMPLCHA21         (1 <<  5) /* 20: Comparison condition of AN021 */
#define ADC140_ADCMPLR1_CMPLCHA20         (1 <<  4) /* 10: Comparison condition of AN020 */
#define ADC140_ADCMPLR1_CMPLCHA19         (1 <<  3) /* 08: Comparison condition of AN019 */
#define ADC140_ADCMPLR1_CMPLCHA18         (1 <<  2) /* 04: Comparison condition of AN018 */
#define ADC140_ADCMPLR1_CMPLCHA17         (1 <<  1) /* 02: Comparison condition of AN017 */
#define ADC140_ADCMPLR1_CMPLCHA16         (1 <<  0) /* 01: Comparison condition of AN016 */
#define ADC140_ADCMPDR0_OFFSET            0x009c
#define ADC140_ADCMPDR0                   (ADC140_BASE + ADC140_ADCMPDR0_OFFSET)
#define ADC140_ADCMPDR0_ADCMPDR0          (16 <<  0) /* 01: The ADCMPDR0 register sets the reference data when the compare window A function is used. ADCMPDR0 sets the lower-side level of window A. */
#define ADC140_ADCMPDR0_ADCMPDR0_MASK          (0xffff)
#define ADC140_ADCMPDR1_OFFSET            0x009e
#define ADC140_ADCMPDR1                   (ADC140_BASE + ADC140_ADCMPDR1_OFFSET)
