leocafonso/svdtoheaders/demo/h/ra4m1_reg.h
#define ADC140_ADCMPDR1_ADCMPDR1          (16 <<  0) /* 01: The ADCMPDR1 register sets the reference data when the compare window A function is used. ADCMPDR1 sets the upper-side level of window A.. */
#define ADC140_ADCMPDR1_ADCMPDR1_MASK          (0xffff)
#define ADC140_ADCMPSR0_OFFSET            0x00a0
#define ADC140_ADCMPSR0                   (ADC140_BASE + ADC140_ADCMPSR0_OFFSET)
#define ADC140_ADCMPSR0_CMPSTCHA14        (1 << 14) /* 4000: Compare window A flag of AN014 */
#define ADC140_ADCMPSR0_CMPSTCHA13        (1 << 13) /* 2000: Compare window A flag of AN013 */
#define ADC140_ADCMPSR0_CMPSTCHA12        (1 << 12) /* 1000: Compare window A flag of AN012 */
#define ADC140_ADCMPSR0_CMPSTCHA11        (1 << 11) /* 800: Compare window A flag of AN011 */
#define ADC140_ADCMPSR0_CMPSTCHA10        (1 << 10) /* 400: Compare window A flag of AN010 */
#define ADC140_ADCMPSR0_CMPSTCHA09        (1 <<  9) /* 200: Compare window A flag of AN009 */
#define ADC140_ADCMPSR0_CMPSTCHA08        (1 <<  8) /* 100: Compare window A flag of AN008 */
#define ADC140_ADCMPSR0_CMPSTCHA07        (1 <<  7) /* 80: Compare window A flag of AN007 */
#define ADC140_ADCMPSR0_CMPSTCHA06        (1 <<  6) /* 40: Compare window A flag of AN006 */
#define ADC140_ADCMPSR0_CMPSTCHA05        (1 <<  5) /* 20: Compare window A flag of AN005 */
#define ADC140_ADCMPSR0_CMPSTCHA04        (1 <<  4) /* 10: Compare window A flag of AN004 */
#define ADC140_ADCMPSR0_CMPSTCHA03        (1 <<  3) /* 08: Compare window A flag of AN003 */
#define ADC140_ADCMPSR0_CMPSTCHA02        (1 <<  2) /* 04: Compare window A flag of AN002 */
#define ADC140_ADCMPSR0_CMPSTCHA01        (1 <<  1) /* 02: Compare window A flag of AN001 */
#define ADC140_ADCMPSR0_CMPSTCHA00        (1 <<  0) /* 01: Compare window A flag of AN000 */
#define ADC140_ADCMPSR1_OFFSET            0x00a2
#define ADC140_ADCMPSR1                   (ADC140_BASE + ADC140_ADCMPSR1_OFFSET)
#define ADC140_ADCMPSR1_CMPSTCHA25        (1 <<  9) /* 200: Compare window A flag of AN025 */
#define ADC140_ADCMPSR1_CMPSTCHA24        (1 <<  8) /* 100: Compare window A flag of AN024 */
#define ADC140_ADCMPSR1_CMPSTCHA23        (1 <<  7) /* 80: Compare window A flag of AN023 */
#define ADC140_ADCMPSR1_CMPSTCHA22        (1 <<  6) /* 40: Compare window A flag of AN022 */
#define ADC140_ADCMPSR1_CMPSTCHA21        (1 <<  5) /* 20: Compare window A flag of AN021 */
#define ADC140_ADCMPSR1_CMPSTCHA20        (1 <<  4) /* 10: Compare window A flag of AN020 */
#define ADC140_ADCMPSR1_CMPSTCHA19        (1 <<  3) /* 08: Compare window A flag of AN019 */
#define ADC140_ADCMPSR1_CMPSTCHA18        (1 <<  2) /* 04: Compare window A flag of AN018 */
#define ADC140_ADCMPSR1_CMPSTCHA17        (1 <<  1) /* 02: Compare window A flag of AN017 */
#define ADC140_ADCMPSR1_CMPSTCHA16        (1 <<  0) /* 01: Compare window A flag of AN016 */
#define ADC140_ADCMPSER_OFFSET            0x00a4
#define ADC140_ADCMPSER                   (ADC140_BASE + ADC140_ADCMPSER_OFFSET)
#define ADC140_ADCMPSER_CMPSTOCA          (1 <<  1) /* 02: Compare Window A Internal Reference Voltage Compare Flag When window A operation is enabled (ADCMPCR.CMPAE = 1b), this bit indicates the temperature sensor output comparison result. When window A operation is disabled (ADCMPCR.CMPAE = 0b), comparison conditions for CMPSTTSA are not met any time. */
#define ADC140_ADCMPSER_CMPSTTSA          (1 <<  0) /* 01: Compare Window A Temperature Sensor Output Compare Flag When window A operation is enabled (ADCMPCR.CMPAE = 1b), this bit indicates the temperature sensor output comparison result. When window A operation is disabled (ADCMPCR.CMPAE = 0b), comparison conditions for CMPSTTSA are not met any time. */
#define ADC140_ADCMPBNSR_OFFSET           0x00a6
#define ADC140_ADCMPBNSR                  (ADC140_BASE + ADC140_ADCMPBNSR_OFFSET)
#define ADC140_ADCMPBNSR_CMPLB            (1 <<  7) /* 80: Compare window B Compare condition setting bit. */
#define ADC140_ADCMPBNSR_CMPCHB           (6 <<  0) /* 01: Compare window B channel selection bit. The channel that compares it on the condition of compare window B is selected. */
#define ADC140_ADCMPBNSR_CMPCHB_MASK           (0x3f)
#define ADC140_ADWINLLB_OFFSET            0x00a8
#define ADC140_ADWINLLB                   (ADC140_BASE + ADC140_ADWINLLB_OFFSET)
#define ADC140_ADWINLLB_ADWINLLB          (16 <<  0) /* 01: This register is used to compare A window function is used to set the lower level of the window B. */
#define ADC140_ADWINLLB_ADWINLLB_MASK          (0xffff)
#define ADC140_ADWINULB_OFFSET            0x00aa
#define ADC140_ADWINULB                   (ADC140_BASE + ADC140_ADWINULB_OFFSET)
#define ADC140_ADWINULB_ADWINULB          (16 <<  0) /* 01: This register is used to compare A window function is used to set the higher level of the window B. */
#define ADC140_ADWINULB_ADWINULB_MASK          (0xffff)
#define ADC140_ADCMPBSR_OFFSET            0x00ac
#define ADC140_ADCMPBSR                   (ADC140_BASE + ADC140_ADCMPBSR_OFFSET)
#define ADC140_ADCMPBSR_CMPSTB            (1 <<  0) /* 01: Compare window B flag. It is a status flag that shows the comparative result of CH (AN000-AN027, temperature sensor, and internal reference voltage) made the object of window B relation condition. */
#define ADC140_ADSSTRL_OFFSET             0x00dd
#define ADC140_ADSSTRL                    (ADC140_BASE + ADC140_ADSSTRL_OFFSET)
#define ADC140_ADSSTRL_SST                (8 <<  0) /* 01: Sampling Time Setting (AN016-AN027) */
#define ADC140_ADSSTRL_SST_MASK                (0xff)
#define ADC140_ADSSTRT_OFFSET             0x00de
#define ADC140_ADSSTRT                    (ADC140_BASE + ADC140_ADSSTRT_OFFSET)
#define ADC140_ADSSTRT_SST                (8 <<  0) /* 01: Sampling Time Setting (temperature sensor output) */
#define ADC140_ADSSTRT_SST_MASK                (0xff)
#define ADC140_ADSSTRO_OFFSET             0x00df
#define ADC140_ADSSTRO                    (ADC140_BASE + ADC140_ADSSTRO_OFFSET)
#define ADC140_ADSSTRO_SST                (8 <<  0) /* 01: Sampling Time Setting (Internal reference voltage) */
#define ADC140_ADSSTRO_SST_MASK                (0xff)
#define ADC140_ADSSTR_SIZE                15
#define ADC140_ADSSTR_OFFSET              0x00e0
#define ADC140_ADSSTR(p)                  (ADC140_BASE + ADC140_ADSSTR_OFFSET + (p)*0x0001)
#define ADC140_ADSSTR_SST                 (8 <<  0) /* 01: Sampling time setting */
#define ADC140_ADSSTR_SST_MASK                 (0xff)

/* AGT0 - Asynchronous General purpose Timer 0 */
#define AGT0_BASE                         0x40084000
#define AGT0_AGT_OFFSET                   0x0000
#define AGT0_AGT                          (AGT0_BASE + AGT0_AGT_OFFSET)
#define AGT0_AGT_AGT                      (16 <<  0) /* 01: 16bit counter and reload register NOTE : When 1 is written to the TSTOP bit in the AGTCRn register, the 16-bit counter is forcibly stopped and set to FFFFH. */
#define AGT0_AGT_AGT_MASK                      (0xffff)
#define AGT0_AGTCMA_OFFSET                0x0002
#define AGT0_AGTCMA                       (AGT0_BASE + AGT0_AGTCMA_OFFSET)
#define AGT0_AGTCMA_AGTCMA                (16 <<  0) /* 01: AGT Compare Match A data is stored. NOTE : When 1 is written to the TSTOP bit in the AGTCRn register, set to FFFFH */
#define AGT0_AGTCMA_AGTCMA_MASK                (0xffff)
#define AGT0_AGTCMB_OFFSET                0x0004
#define AGT0_AGTCMB                       (AGT0_BASE + AGT0_AGTCMB_OFFSET)
#define AGT0_AGTCMB_AGTCMB                (16 <<  0) /* 01: AGT Compare Match B data is stored. NOTE : When 1 is written to the TSTOP bit in the AGTCR register, set to FFFFH */
#define AGT0_AGTCMB_AGTCMB_MASK                (0xffff)
#define AGT0_AGTCR_OFFSET                 0x0008
#define AGT0_AGTCR                        (AGT0_BASE + AGT0_AGTCR_OFFSET)
#define AGT0_AGTCR_TCMBF                  (1 <<  7) /* 80: Compare match B flag */
#define AGT0_AGTCR_TCMAF                  (1 <<  6) /* 40: Compare match A flag */
#define AGT0_AGTCR_TUNDF                  (1 <<  5) /* 20: Underflow flag */
#define AGT0_AGTCR_TEDGF                  (1 <<  4) /* 10: Active edge judgment flag */
#define AGT0_AGTCR_TSTOP                  (1 <<  2) /* 04: AGT count forced stop */
#define AGT0_AGTCR_TCSTF                  (1 <<  1) /* 02: AGT count status flag */
#define AGT0_AGTCR_TSTART                 (1 <<  0) /* 01: AGT count start */
#define AGT0_AGTMR1_OFFSET                0x0009
#define AGT0_AGTMR1                       (AGT0_BASE + AGT0_AGTMR1_OFFSET)
#define AGT0_AGTMR1_TCK                   (3 <<  4) /* 10: Count source */
#define AGT0_AGTMR1_TCK_MASK                   (0x07)
#define AGT0_AGTMR1_TEDGPL                (1 <<  3) /* 08: Edge polarity */
#define AGT0_AGTMR1_TMOD                  (3 <<  0) /* 01: Operating mode */
#define AGT0_AGTMR1_TMOD_MASK                  (0x07)
#define AGT0_AGTMR2_OFFSET                0x000a
#define AGT0_AGTMR2                       (AGT0_BASE + AGT0_AGTMR2_OFFSET)
#define AGT0_AGTMR2_LPM                   (1 <<  7) /* 80: Low Power Mode */
#define AGT0_AGTMR2_CKS                   (3 <<  0) /* 01: AGTLCLK/AGTSCLK count source clock frequency division ratio */
#define AGT0_AGTMR2_CKS_MASK                   (0x07)
#define AGT0_AGTIOC_OFFSET                0x000c
#define AGT0_AGTIOC                       (AGT0_BASE + AGT0_AGTIOC_OFFSET)
#define AGT0_AGTIOC_TIOGT                 (2 <<  6) /* 40: Count control */
#define AGT0_AGTIOC_TIOGT_MASK                 (0x03)
#define AGT0_AGTIOC_TIPF                  (2 <<  4) /* 10: Input filter */
#define AGT0_AGTIOC_TIPF_MASK                  (0x03)
#define AGT0_AGTIOC_TOE                   (1 <<  2) /* 04: AGTOn output enable */
#define AGT0_AGTIOC_TEDGSEL               (1 <<  0) /* 01: I/O polarity switch Function varies depending on the operating mode. */
#define AGT0_AGTISR_OFFSET                0x000d
#define AGT0_AGTISR                       (AGT0_BASE + AGT0_AGTISR_OFFSET)
#define AGT0_AGTISR_EEPS                  (1 <<  2) /* 04: AGTEE polarty selection */
#define AGT0_AGTCMSR_OFFSET               0x000e
#define AGT0_AGTCMSR                      (AGT0_BASE + AGT0_AGTCMSR_OFFSET)
#define AGT0_AGTCMSR_TOPOLB               (1 <<  6) /* 40: AGTOB polarity select */
#define AGT0_AGTCMSR_TOEB                 (1 <<  5) /* 20: AGTOB output enable */
#define AGT0_AGTCMSR_TCMEB                (1 <<  4) /* 10: Compare match B register enable */
#define AGT0_AGTCMSR_TOPOLA               (1 <<  2) /* 04: AGTOA polarity select */
#define AGT0_AGTCMSR_TOEA                 (1 <<  1) /* 02: AGTOA output enable */
#define AGT0_AGTCMSR_TCMEA                (1 <<  0) /* 01: Compare match A register enable */
#define AGT0_AGTIOSEL_OFFSET              0x000f
#define AGT0_AGTIOSEL                     (AGT0_BASE + AGT0_AGTIOSEL_OFFSET)
#define AGT0_AGTIOSEL_TIES                (1 <<  4) /* 10: AGTIO input enable */
#define AGT0_AGTIOSEL_SEL                 (2 <<  0) /* 01: AGTIO pin select */
#define AGT0_AGTIOSEL_SEL_MASK                 (0x03)

/* No registers defined for peripheral AGT1. Using those of AGT0. */
#define AGT1_BASE                         0x40084100
#define AGT1_AGT_OFFSET                   AGT0_AGT_OFFSET
#define AGT1_AGT                          AGT0_AGT
#define AGT1_AGT_AGT                      AGT0_AGT_AGT
#define AGT1_AGT_AGT_MASK                 AGT0_AGT_AGT_MASK
#define AGT1_AGTCMA_OFFSET                AGT0_AGTCMA_OFFSET
#define AGT1_AGTCMA                       AGT0_AGTCMA
#define AGT1_AGTCMA_AGTCMA                AGT0_AGTCMA_AGTCMA
#define AGT1_AGTCMA_AGTCMA_MASK           AGT0_AGTCMA_AGTCMA_MASK
#define AGT1_AGTCMB_OFFSET                AGT0_AGTCMB_OFFSET
#define AGT1_AGTCMB                       AGT0_AGTCMB
#define AGT1_AGTCMB_AGTCMB                AGT0_AGTCMB_AGTCMB
#define AGT1_AGTCMB_AGTCMB_MASK           AGT0_AGTCMB_AGTCMB_MASK
#define AGT1_AGTCR_OFFSET                 AGT0_AGTCR_OFFSET
#define AGT1_AGTCR                        AGT0_AGTCR
#define AGT1_AGTCR_TCMBF                  AGT0_AGTCR_TCMBF
#define AGT1_AGTCR_TCMAF                  AGT0_AGTCR_TCMAF
#define AGT1_AGTCR_TUNDF                  AGT0_AGTCR_TUNDF
#define AGT1_AGTCR_TEDGF                  AGT0_AGTCR_TEDGF
#define AGT1_AGTCR_TSTOP                  AGT0_AGTCR_TSTOP
#define AGT1_AGTCR_TCSTF                  AGT0_AGTCR_TCSTF
#define AGT1_AGTCR_TSTART                 AGT0_AGTCR_TSTART
#define AGT1_AGTMR1_OFFSET                AGT0_AGTMR1_OFFSET
#define AGT1_AGTMR1                       AGT0_AGTMR1
#define AGT1_AGTMR1_TCK                   AGT0_AGTMR1_TCK
#define AGT1_AGTMR1_TCK_MASK              AGT0_AGTMR1_TCK_MASK
#define AGT1_AGTMR1_TEDGPL                AGT0_AGTMR1_TEDGPL
#define AGT1_AGTMR1_TMOD                  AGT0_AGTMR1_TMOD
#define AGT1_AGTMR1_TMOD_MASK             AGT0_AGTMR1_TMOD_MASK
#define AGT1_AGTMR2_OFFSET                AGT0_AGTMR2_OFFSET
#define AGT1_AGTMR2                       AGT0_AGTMR2
#define AGT1_AGTMR2_LPM                   AGT0_AGTMR2_LPM
#define AGT1_AGTMR2_CKS                   AGT0_AGTMR2_CKS
#define AGT1_AGTMR2_CKS_MASK              AGT0_AGTMR2_CKS_MASK
#define AGT1_AGTIOC_OFFSET                AGT0_AGTIOC_OFFSET
#define AGT1_AGTIOC                       AGT0_AGTIOC
#define AGT1_AGTIOC_TIOGT                 AGT0_AGTIOC_TIOGT
#define AGT1_AGTIOC_TIOGT_MASK            AGT0_AGTIOC_TIOGT_MASK
#define AGT1_AGTIOC_TIPF                  AGT0_AGTIOC_TIPF
#define AGT1_AGTIOC_TIPF_MASK             AGT0_AGTIOC_TIPF_MASK
#define AGT1_AGTIOC_TOE                   AGT0_AGTIOC_TOE
#define AGT1_AGTIOC_TEDGSEL               AGT0_AGTIOC_TEDGSEL
#define AGT1_AGTISR_OFFSET                AGT0_AGTISR_OFFSET
#define AGT1_AGTISR                       AGT0_AGTISR
#define AGT1_AGTISR_EEPS                  AGT0_AGTISR_EEPS
#define AGT1_AGTCMSR_OFFSET               AGT0_AGTCMSR_OFFSET
#define AGT1_AGTCMSR                      AGT0_AGTCMSR
#define AGT1_AGTCMSR_TOPOLB               AGT0_AGTCMSR_TOPOLB
#define AGT1_AGTCMSR_TOEB                 AGT0_AGTCMSR_TOEB
#define AGT1_AGTCMSR_TCMEB                AGT0_AGTCMSR_TCMEB
#define AGT1_AGTCMSR_TOPOLA               AGT0_AGTCMSR_TOPOLA
#define AGT1_AGTCMSR_TOEA                 AGT0_AGTCMSR_TOEA
#define AGT1_AGTCMSR_TCMEA                AGT0_AGTCMSR_TCMEA
#define AGT1_AGTIOSEL_OFFSET              AGT0_AGTIOSEL_OFFSET
#define AGT1_AGTIOSEL                     AGT0_AGTIOSEL
#define AGT1_AGTIOSEL_TIES                AGT0_AGTIOSEL_TIES
#define AGT1_AGTIOSEL_SEL                 AGT0_AGTIOSEL_SEL
#define AGT1_AGTIOSEL_SEL_MASK            AGT0_AGTIOSEL_SEL_MASK

