leocafonso/svdtoheaders/demo/h/ra4m1_reg.h
/* No registers defined for peripheral GPT321. Using those of GPT320. */
#define GPT321_BASE                       0x40078100
#define GPT321_GTWP_OFFSET                GPT320_GTWP_OFFSET
#define GPT321_GTWP                       GPT320_GTWP
#define GPT321_GTWP_PRKEY                 GPT320_GTWP_PRKEY
#define GPT321_GTWP_PRKEY_MASK            GPT320_GTWP_PRKEY_MASK
#define GPT321_GTWP_WP                    GPT320_GTWP_WP
#define GPT321_GTSTR_OFFSET               GPT320_GTSTR_OFFSET
#define GPT321_GTSTR                      GPT320_GTSTR
#define GPT321_GTSTR_CSTRT7               GPT320_GTSTR_CSTRT7
#define GPT321_GTSTR_CSTRT6               GPT320_GTSTR_CSTRT6
#define GPT321_GTSTR_CSTRT5               GPT320_GTSTR_CSTRT5
#define GPT321_GTSTR_CSTRT4               GPT320_GTSTR_CSTRT4
#define GPT321_GTSTR_CSTRT3               GPT320_GTSTR_CSTRT3
#define GPT321_GTSTR_CSTRT2               GPT320_GTSTR_CSTRT2
#define GPT321_GTSTR_CSTRT1               GPT320_GTSTR_CSTRT1
#define GPT321_GTSTR_CSTRT0               GPT320_GTSTR_CSTRT0
#define GPT321_GTSTP_OFFSET               GPT320_GTSTP_OFFSET
#define GPT321_GTSTP                      GPT320_GTSTP
#define GPT321_GTSTP_CSTOP7               GPT320_GTSTP_CSTOP7
#define GPT321_GTSTP_CSTOP6               GPT320_GTSTP_CSTOP6
#define GPT321_GTSTP_CSTOP5               GPT320_GTSTP_CSTOP5
#define GPT321_GTSTP_CSTOP4               GPT320_GTSTP_CSTOP4
#define GPT321_GTSTP_CSTOP3               GPT320_GTSTP_CSTOP3
#define GPT321_GTSTP_CSTOP2               GPT320_GTSTP_CSTOP2
#define GPT321_GTSTP_CSTOP1               GPT320_GTSTP_CSTOP1
#define GPT321_GTSTP_CSTOP0               GPT320_GTSTP_CSTOP0
#define GPT321_GTCLR_OFFSET               GPT320_GTCLR_OFFSET
#define GPT321_GTCLR                      GPT320_GTCLR
#define GPT321_GTCLR_CCLR7                GPT320_GTCLR_CCLR7
#define GPT321_GTCLR_CCLR6                GPT320_GTCLR_CCLR6
#define GPT321_GTCLR_CCLR5                GPT320_GTCLR_CCLR5
#define GPT321_GTCLR_CCLR4                GPT320_GTCLR_CCLR4
#define GPT321_GTCLR_CCLR3                GPT320_GTCLR_CCLR3
#define GPT321_GTCLR_CCLR2                GPT320_GTCLR_CCLR2
#define GPT321_GTCLR_CCLR1                GPT320_GTCLR_CCLR1
#define GPT321_GTCLR_CCLR0                GPT320_GTCLR_CCLR0
#define GPT321_GTSSR_OFFSET               GPT320_GTSSR_OFFSET
#define GPT321_GTSSR                      GPT320_GTSSR
#define GPT321_GTSSR_CSTRT                GPT320_GTSSR_CSTRT
#define GPT321_GTSSR_SSELCH               GPT320_GTSSR_SSELCH
#define GPT321_GTSSR_SSELCG               GPT320_GTSSR_SSELCG
#define GPT321_GTSSR_SSELCF               GPT320_GTSSR_SSELCF
#define GPT321_GTSSR_SSELCE               GPT320_GTSSR_SSELCE
#define GPT321_GTSSR_SSELCD               GPT320_GTSSR_SSELCD
#define GPT321_GTSSR_SSELCC               GPT320_GTSSR_SSELCC
#define GPT321_GTSSR_SSELCB               GPT320_GTSSR_SSELCB
#define GPT321_GTSSR_SSELCA               GPT320_GTSSR_SSELCA
#define GPT321_GTSSR_SSCBFAH              GPT320_GTSSR_SSCBFAH
#define GPT321_GTSSR_SSCBFAL              GPT320_GTSSR_SSCBFAL
#define GPT321_GTSSR_SSCBRAH              GPT320_GTSSR_SSCBRAH
#define GPT321_GTSSR_SSCBRAL              GPT320_GTSSR_SSCBRAL
#define GPT321_GTSSR_SSCAFBH              GPT320_GTSSR_SSCAFBH
#define GPT321_GTSSR_SSCAFBL              GPT320_GTSSR_SSCAFBL
#define GPT321_GTSSR_SSCARBH              GPT320_GTSSR_SSCARBH
#define GPT321_GTSSR_SSCARBL              GPT320_GTSSR_SSCARBL
#define GPT321_GTSSR_SSGTRGBF             GPT320_GTSSR_SSGTRGBF
#define GPT321_GTSSR_SSGTRGBR             GPT320_GTSSR_SSGTRGBR
#define GPT321_GTSSR_SSGTRGAF             GPT320_GTSSR_SSGTRGAF
#define GPT321_GTSSR_SSGTRGAR             GPT320_GTSSR_SSGTRGAR
#define GPT321_GTPSR_OFFSET               GPT320_GTPSR_OFFSET
#define GPT321_GTPSR                      GPT320_GTPSR
#define GPT321_GTPSR_CSTOP                GPT320_GTPSR_CSTOP
#define GPT321_GTPSR_PSELCH               GPT320_GTPSR_PSELCH
#define GPT321_GTPSR_PSELCG               GPT320_GTPSR_PSELCG
#define GPT321_GTPSR_PSELCF               GPT320_GTPSR_PSELCF
#define GPT321_GTPSR_PSELCE               GPT320_GTPSR_PSELCE
#define GPT321_GTPSR_PSELCD               GPT320_GTPSR_PSELCD
#define GPT321_GTPSR_PSELCC               GPT320_GTPSR_PSELCC
#define GPT321_GTPSR_PSELCB               GPT320_GTPSR_PSELCB
#define GPT321_GTPSR_PSELCA               GPT320_GTPSR_PSELCA
#define GPT321_GTPSR_PSCBFAH              GPT320_GTPSR_PSCBFAH
#define GPT321_GTPSR_PSCBFAL              GPT320_GTPSR_PSCBFAL
#define GPT321_GTPSR_PSCBRAH              GPT320_GTPSR_PSCBRAH
#define GPT321_GTPSR_PSCBRAL              GPT320_GTPSR_PSCBRAL
#define GPT321_GTPSR_PSCAFBH              GPT320_GTPSR_PSCAFBH
#define GPT321_GTPSR_PSCAFBL              GPT320_GTPSR_PSCAFBL
#define GPT321_GTPSR_PSCARBH              GPT320_GTPSR_PSCARBH
#define GPT321_GTPSR_PSCARBL              GPT320_GTPSR_PSCARBL
#define GPT321_GTPSR_PSGTRGBF             GPT320_GTPSR_PSGTRGBF
#define GPT321_GTPSR_PSGTRGBR             GPT320_GTPSR_PSGTRGBR
#define GPT321_GTPSR_PSGTRGAF             GPT320_GTPSR_PSGTRGAF
#define GPT321_GTPSR_PSGTRGAR             GPT320_GTPSR_PSGTRGAR
#define GPT321_GTCSR_OFFSET               GPT320_GTCSR_OFFSET
#define GPT321_GTCSR                      GPT320_GTCSR
#define GPT321_GTCSR_CCLR                 GPT320_GTCSR_CCLR
#define GPT321_GTCSR_CSELCH               GPT320_GTCSR_CSELCH
#define GPT321_GTCSR_CSELCG               GPT320_GTCSR_CSELCG
#define GPT321_GTCSR_CSELCF               GPT320_GTCSR_CSELCF
#define GPT321_GTCSR_CSELCE               GPT320_GTCSR_CSELCE
#define GPT321_GTCSR_CSELCD               GPT320_GTCSR_CSELCD
#define GPT321_GTCSR_CSELCC               GPT320_GTCSR_CSELCC
#define GPT321_GTCSR_CSELCB               GPT320_GTCSR_CSELCB
#define GPT321_GTCSR_CSELCA               GPT320_GTCSR_CSELCA
#define GPT321_GTCSR_CSCBFAH              GPT320_GTCSR_CSCBFAH
#define GPT321_GTCSR_CSCBFAL              GPT320_GTCSR_CSCBFAL
#define GPT321_GTCSR_CSCBRAH              GPT320_GTCSR_CSCBRAH
#define GPT321_GTCSR_CSCBRAL              GPT320_GTCSR_CSCBRAL
#define GPT321_GTCSR_CSCAFBH              GPT320_GTCSR_CSCAFBH
#define GPT321_GTCSR_CSCAFBL              GPT320_GTCSR_CSCAFBL
#define GPT321_GTCSR_CSCARBH              GPT320_GTCSR_CSCARBH
#define GPT321_GTCSR_CSCARBL              GPT320_GTCSR_CSCARBL
#define GPT321_GTCSR_CSGTRGBF             GPT320_GTCSR_CSGTRGBF
#define GPT321_GTCSR_CSGTRGBR             GPT320_GTCSR_CSGTRGBR
#define GPT321_GTCSR_CSGTRGAF             GPT320_GTCSR_CSGTRGAF
#define GPT321_GTCSR_CSGTRGAR             GPT320_GTCSR_CSGTRGAR
#define GPT321_GTUPSR_OFFSET              GPT320_GTUPSR_OFFSET
#define GPT321_GTUPSR                     GPT320_GTUPSR
#define GPT321_GTUPSR_USELCH              GPT320_GTUPSR_USELCH
#define GPT321_GTUPSR_USELCG              GPT320_GTUPSR_USELCG
#define GPT321_GTUPSR_USELCF              GPT320_GTUPSR_USELCF
#define GPT321_GTUPSR_USELCE              GPT320_GTUPSR_USELCE
#define GPT321_GTUPSR_USELCD              GPT320_GTUPSR_USELCD
#define GPT321_GTUPSR_USELCC              GPT320_GTUPSR_USELCC
#define GPT321_GTUPSR_USELCB              GPT320_GTUPSR_USELCB
#define GPT321_GTUPSR_USELCA              GPT320_GTUPSR_USELCA
#define GPT321_GTUPSR_USCBFAH             GPT320_GTUPSR_USCBFAH
#define GPT321_GTUPSR_USCBFAL             GPT320_GTUPSR_USCBFAL
#define GPT321_GTUPSR_USCBRAH             GPT320_GTUPSR_USCBRAH
#define GPT321_GTUPSR_USCBRAL             GPT320_GTUPSR_USCBRAL
#define GPT321_GTUPSR_USCAFBH             GPT320_GTUPSR_USCAFBH
#define GPT321_GTUPSR_USCAFBL             GPT320_GTUPSR_USCAFBL
#define GPT321_GTUPSR_USCARBH             GPT320_GTUPSR_USCARBH
#define GPT321_GTUPSR_USCARBL             GPT320_GTUPSR_USCARBL
#define GPT321_GTUPSR_USGTRGBF            GPT320_GTUPSR_USGTRGBF
#define GPT321_GTUPSR_USGTRGBR            GPT320_GTUPSR_USGTRGBR
#define GPT321_GTUPSR_USGTRGAF            GPT320_GTUPSR_USGTRGAF
#define GPT321_GTUPSR_USGTRGAR            GPT320_GTUPSR_USGTRGAR
#define GPT321_GTDNSR_OFFSET              GPT320_GTDNSR_OFFSET
#define GPT321_GTDNSR                     GPT320_GTDNSR
#define GPT321_GTDNSR_DSELCH              GPT320_GTDNSR_DSELCH
#define GPT321_GTDNSR_DSELCG              GPT320_GTDNSR_DSELCG
#define GPT321_GTDNSR_DSELCF              GPT320_GTDNSR_DSELCF
#define GPT321_GTDNSR_DSELCE              GPT320_GTDNSR_DSELCE
#define GPT321_GTDNSR_DSELCD              GPT320_GTDNSR_DSELCD
#define GPT321_GTDNSR_DSELCC              GPT320_GTDNSR_DSELCC
#define GPT321_GTDNSR_DSELCB              GPT320_GTDNSR_DSELCB
#define GPT321_GTDNSR_DSELCA              GPT320_GTDNSR_DSELCA
#define GPT321_GTDNSR_DSCBFAH             GPT320_GTDNSR_DSCBFAH
#define GPT321_GTDNSR_DSCBFAL             GPT320_GTDNSR_DSCBFAL
#define GPT321_GTDNSR_DSCBRAH             GPT320_GTDNSR_DSCBRAH
#define GPT321_GTDNSR_DSCBRAL             GPT320_GTDNSR_DSCBRAL
#define GPT321_GTDNSR_DSCAFBH             GPT320_GTDNSR_DSCAFBH
#define GPT321_GTDNSR_DSCAFBL             GPT320_GTDNSR_DSCAFBL
#define GPT321_GTDNSR_DSCARBH             GPT320_GTDNSR_DSCARBH
#define GPT321_GTDNSR_DSCARBL             GPT320_GTDNSR_DSCARBL
#define GPT321_GTDNSR_DSGTRGBF            GPT320_GTDNSR_DSGTRGBF
#define GPT321_GTDNSR_DSGTRGBR            GPT320_GTDNSR_DSGTRGBR
#define GPT321_GTDNSR_DSGTRGAF            GPT320_GTDNSR_DSGTRGAF
#define GPT321_GTDNSR_DSGTRGAR            GPT320_GTDNSR_DSGTRGAR
#define GPT321_GTICASR_OFFSET             GPT320_GTICASR_OFFSET
#define GPT321_GTICASR                    GPT320_GTICASR
#define GPT321_GTICASR_ASELCH             GPT320_GTICASR_ASELCH
#define GPT321_GTICASR_ASELCG             GPT320_GTICASR_ASELCG
#define GPT321_GTICASR_ASELCF             GPT320_GTICASR_ASELCF
#define GPT321_GTICASR_ASELCE             GPT320_GTICASR_ASELCE
#define GPT321_GTICASR_ASELCD             GPT320_GTICASR_ASELCD
#define GPT321_GTICASR_ASELCC             GPT320_GTICASR_ASELCC
#define GPT321_GTICASR_ASELCB             GPT320_GTICASR_ASELCB
#define GPT321_GTICASR_ASELCA             GPT320_GTICASR_ASELCA
#define GPT321_GTICASR_ASCBFAH            GPT320_GTICASR_ASCBFAH
#define GPT321_GTICASR_ASCBFAL            GPT320_GTICASR_ASCBFAL
#define GPT321_GTICASR_ASCBRAH            GPT320_GTICASR_ASCBRAH
#define GPT321_GTICASR_ASCBRAL            GPT320_GTICASR_ASCBRAL
#define GPT321_GTICASR_ASCAFBH            GPT320_GTICASR_ASCAFBH
#define GPT321_GTICASR_ASCAFBL            GPT320_GTICASR_ASCAFBL
#define GPT321_GTICASR_ASCARBH            GPT320_GTICASR_ASCARBH
#define GPT321_GTICASR_ASCARBL            GPT320_GTICASR_ASCARBL
#define GPT321_GTICASR_ASGTRGBF           GPT320_GTICASR_ASGTRGBF
#define GPT321_GTICASR_ASGTRGBR           GPT320_GTICASR_ASGTRGBR
#define GPT321_GTICASR_ASGTRGAF           GPT320_GTICASR_ASGTRGAF
#define GPT321_GTICASR_ASGTRGAR           GPT320_GTICASR_ASGTRGAR
#define GPT321_GTICBSR_OFFSET             GPT320_GTICBSR_OFFSET
#define GPT321_GTICBSR                    GPT320_GTICBSR
#define GPT321_GTICBSR_BSELCH             GPT320_GTICBSR_BSELCH
#define GPT321_GTICBSR_BSELCG             GPT320_GTICBSR_BSELCG
#define GPT321_GTICBSR_BSELCF             GPT320_GTICBSR_BSELCF
#define GPT321_GTICBSR_BSELCE             GPT320_GTICBSR_BSELCE
#define GPT321_GTICBSR_BSELCD             GPT320_GTICBSR_BSELCD
#define GPT321_GTICBSR_BSELCC             GPT320_GTICBSR_BSELCC
#define GPT321_GTICBSR_BSELCB             GPT320_GTICBSR_BSELCB
#define GPT321_GTICBSR_BSELCA             GPT320_GTICBSR_BSELCA
#define GPT321_GTICBSR_BSCBFAH            GPT320_GTICBSR_BSCBFAH
#define GPT321_GTICBSR_BSCBFAL            GPT320_GTICBSR_BSCBFAL
#define GPT321_GTICBSR_BSCBRAH            GPT320_GTICBSR_BSCBRAH
#define GPT321_GTICBSR_BSCBRAL            GPT320_GTICBSR_BSCBRAL
#define GPT321_GTICBSR_BSCAFBH            GPT320_GTICBSR_BSCAFBH
#define GPT321_GTICBSR_BSCAFBL            GPT320_GTICBSR_BSCAFBL
#define GPT321_GTICBSR_BSCARBH            GPT320_GTICBSR_BSCARBH
#define GPT321_GTICBSR_BSCARBL            GPT320_GTICBSR_BSCARBL
#define GPT321_GTICBSR_BSGTRGBF           GPT320_GTICBSR_BSGTRGBF
#define GPT321_GTICBSR_BSGTRGBR           GPT320_GTICBSR_BSGTRGBR
#define GPT321_GTICBSR_BSGTRGAF           GPT320_GTICBSR_BSGTRGAF
#define GPT321_GTICBSR_BSGTRGAR           GPT320_GTICBSR_BSGTRGAR
#define GPT321_GTCR_OFFSET                GPT320_GTCR_OFFSET
#define GPT321_GTCR                       GPT320_GTCR
#define GPT321_GTCR_TPCS                  GPT320_GTCR_TPCS
#define GPT321_GTCR_TPCS_MASK             GPT320_GTCR_TPCS_MASK
#define GPT321_GTCR_MD                    GPT320_GTCR_MD
#define GPT321_GTCR_MD_MASK               GPT320_GTCR_MD_MASK
#define GPT321_GTCR_CST                   GPT320_GTCR_CST
#define GPT321_GTUDDTYC_OFFSET            GPT320_GTUDDTYC_OFFSET
#define GPT321_GTUDDTYC                   GPT320_GTUDDTYC
#define GPT321_GTUDDTYC_OBDTYR            GPT320_GTUDDTYC_OBDTYR
#define GPT321_GTUDDTYC_OBDTYF            GPT320_GTUDDTYC_OBDTYF
#define GPT321_GTUDDTYC_OBDTY             GPT320_GTUDDTYC_OBDTY
#define GPT321_GTUDDTYC_OBDTY_MASK        GPT320_GTUDDTYC_OBDTY_MASK
#define GPT321_GTUDDTYC_OADTYR            GPT320_GTUDDTYC_OADTYR
#define GPT321_GTUDDTYC_OADTYF            GPT320_GTUDDTYC_OADTYF
#define GPT321_GTUDDTYC_OADTY             GPT320_GTUDDTYC_OADTY
#define GPT321_GTUDDTYC_OADTY_MASK        GPT320_GTUDDTYC_OADTY_MASK
#define GPT321_GTUDDTYC_UDF               GPT320_GTUDDTYC_UDF
#define GPT321_GTUDDTYC_UD                GPT320_GTUDDTYC_UD
#define GPT321_GTIOR_OFFSET               GPT320_GTIOR_OFFSET
#define GPT321_GTIOR                      GPT320_GTIOR
#define GPT321_GTIOR_NFCSB                GPT320_GTIOR_NFCSB
#define GPT321_GTIOR_NFCSB_MASK           GPT320_GTIOR_NFCSB_MASK
#define GPT321_GTIOR_NFBEN                GPT320_GTIOR_NFBEN
#define GPT321_GTIOR_OBDF                 GPT320_GTIOR_OBDF
#define GPT321_GTIOR_OBDF_MASK            GPT320_GTIOR_OBDF_MASK
#define GPT321_GTIOR_OBE                  GPT320_GTIOR_OBE
#define GPT321_GTIOR_OBHLD                GPT320_GTIOR_OBHLD
#define GPT321_GTIOR_OBDFLT               GPT320_GTIOR_OBDFLT
#define GPT321_GTIOR_GTIOB                GPT320_GTIOR_GTIOB
#define GPT321_GTIOR_GTIOB_MASK           GPT320_GTIOR_GTIOB_MASK
#define GPT321_GTIOR_NFCSA                GPT320_GTIOR_NFCSA
#define GPT321_GTIOR_NFCSA_MASK           GPT320_GTIOR_NFCSA_MASK
#define GPT321_GTIOR_NFAEN                GPT320_GTIOR_NFAEN
#define GPT321_GTIOR_OADF                 GPT320_GTIOR_OADF
#define GPT321_GTIOR_OADF_MASK            GPT320_GTIOR_OADF_MASK
#define GPT321_GTIOR_OAE                  GPT320_GTIOR_OAE
#define GPT321_GTIOR_OAHLD                GPT320_GTIOR_OAHLD
#define GPT321_GTIOR_OADFLT               GPT320_GTIOR_OADFLT
#define GPT321_GTIOR_GTIOA                GPT320_GTIOR_GTIOA
#define GPT321_GTIOR_GTIOA_MASK           GPT320_GTIOR_GTIOA_MASK
#define GPT321_GTINTAD_OFFSET             GPT320_GTINTAD_OFFSET
#define GPT321_GTINTAD                    GPT320_GTINTAD
#define GPT321_GTINTAD_GRPABL             GPT320_GTINTAD_GRPABL
#define GPT321_GTINTAD_GRPABH             GPT320_GTINTAD_GRPABH
#define GPT321_GTINTAD_GRP                GPT320_GTINTAD_GRP
#define GPT321_GTINTAD_GRP_MASK           GPT320_GTINTAD_GRP_MASK
#define GPT321_GTST_OFFSET                GPT320_GTST_OFFSET
#define GPT321_GTST                       GPT320_GTST
#define GPT321_GTST_OABLF                 GPT320_GTST_OABLF
#define GPT321_GTST_OABHF                 GPT320_GTST_OABHF
#define GPT321_GTST_ODF                   GPT320_GTST_ODF
#define GPT321_GTST_TUCF                  GPT320_GTST_TUCF
#define GPT321_GTST_TCFPU                 GPT320_GTST_TCFPU
#define GPT321_GTST_TCFPO                 GPT320_GTST_TCFPO
#define GPT321_GTST_TCFF                  GPT320_GTST_TCFF
#define GPT321_GTST_TCFE                  GPT320_GTST_TCFE
#define GPT321_GTST_TCFD                  GPT320_GTST_TCFD
#define GPT321_GTST_TCFC                  GPT320_GTST_TCFC
#define GPT321_GTST_TCFB                  GPT320_GTST_TCFB
#define GPT321_GTST_TCFA                  GPT320_GTST_TCFA
#define GPT321_GTBER_OFFSET               GPT320_GTBER_OFFSET
#define GPT321_GTBER                      GPT320_GTBER
#define GPT321_GTBER_CCRSWT               GPT320_GTBER_CCRSWT
#define GPT321_GTBER_PR                   GPT320_GTBER_PR
#define GPT321_GTBER_PR_MASK              GPT320_GTBER_PR_MASK
#define GPT321_GTBER_CCRB                 GPT320_GTBER_CCRB
#define GPT321_GTBER_CCRB_MASK            GPT320_GTBER_CCRB_MASK
#define GPT321_GTBER_CCRA                 GPT320_GTBER_CCRA
#define GPT321_GTBER_CCRA_MASK            GPT320_GTBER_CCRA_MASK
#define GPT321_GTBER_BD                   GPT320_GTBER_BD
#define GPT321_GTBER_BD_MASK              GPT320_GTBER_BD_MASK
#define GPT321_GTCNT_OFFSET               GPT320_GTCNT_OFFSET
#define GPT321_GTCNT                      GPT320_GTCNT
#define GPT321_GTCNT_GTCNT                GPT320_GTCNT_GTCNT
#define GPT321_GTCNT_GTCNT_MASK           GPT320_GTCNT_GTCNT_MASK
#define GPT321_GTCCRA_OFFSET              GPT320_GTCCRA_OFFSET
#define GPT321_GTCCRA                     GPT320_GTCCRA
#define GPT321_GTCCRA_GTCCRA              GPT320_GTCCRA_GTCCRA
#define GPT321_GTCCRA_GTCCRA_MASK         GPT320_GTCCRA_GTCCRA_MASK
#define GPT321_GTCCRB_OFFSET              GPT320_GTCCRB_OFFSET
#define GPT321_GTCCRB                     GPT320_GTCCRB
#define GPT321_GTCCRB_GTCCRB              GPT320_GTCCRB_GTCCRB
#define GPT321_GTCCRB_GTCCRB_MASK         GPT320_GTCCRB_GTCCRB_MASK
#define GPT321_GTCCRC_OFFSET              GPT320_GTCCRC_OFFSET
#define GPT321_GTCCRC                     GPT320_GTCCRC
#define GPT321_GTCCRC_GTCCRC              GPT320_GTCCRC_GTCCRC
#define GPT321_GTCCRC_GTCCRC_MASK         GPT320_GTCCRC_GTCCRC_MASK
#define GPT321_GTCCRE_OFFSET              GPT320_GTCCRE_OFFSET
#define GPT321_GTCCRE                     GPT320_GTCCRE
#define GPT321_GTCCRE_GTCCRE              GPT320_GTCCRE_GTCCRE
#define GPT321_GTCCRE_GTCCRE_MASK         GPT320_GTCCRE_GTCCRE_MASK
#define GPT321_GTCCRD_OFFSET              GPT320_GTCCRD_OFFSET
#define GPT321_GTCCRD                     GPT320_GTCCRD
#define GPT321_GTCCRD_GTCCRD              GPT320_GTCCRD_GTCCRD
#define GPT321_GTCCRD_GTCCRD_MASK         GPT320_GTCCRD_GTCCRD_MASK
#define GPT321_GTCCRF_OFFSET              GPT320_GTCCRF_OFFSET
#define GPT321_GTCCRF                     GPT320_GTCCRF
#define GPT321_GTCCRF_GTCCRF              GPT320_GTCCRF_GTCCRF
#define GPT321_GTCCRF_GTCCRF_MASK         GPT320_GTCCRF_GTCCRF_MASK
#define GPT321_GTPR_OFFSET                GPT320_GTPR_OFFSET
#define GPT321_GTPR                       GPT320_GTPR
#define GPT321_GTPR_GTPR                  GPT320_GTPR_GTPR
#define GPT321_GTPR_GTPR_MASK             GPT320_GTPR_GTPR_MASK
#define GPT321_GTPBR_OFFSET               GPT320_GTPBR_OFFSET
#define GPT321_GTPBR                      GPT320_GTPBR
#define GPT321_GTPBR_GTPBR                GPT320_GTPBR_GTPBR
#define GPT321_GTPBR_GTPBR_MASK           GPT320_GTPBR_GTPBR_MASK
#define GPT321_GTDTCR_OFFSET              GPT320_GTDTCR_OFFSET
#define GPT321_GTDTCR                     GPT320_GTDTCR
#define GPT321_GTDTCR_TDE                 GPT320_GTDTCR_TDE
#define GPT321_GTDVU_OFFSET               GPT320_GTDVU_OFFSET
#define GPT321_GTDVU                      GPT320_GTDVU
#define GPT321_GTDVU_GTDVU                GPT320_GTDVU_GTDVU
#define GPT321_GTDVU_GTDVU_MASK           GPT320_GTDVU_GTDVU_MASK

