leocafonso/svdtoheaders/demo/h/ra4m1_reg.h
/* GPT162 - General PWM Timer 2 (16-bit) */
#define GPT162_BASE                       0x40078200
#define GPT162_GTWP_OFFSET                0x0000
#define GPT162_GTWP                       (GPT162_BASE + GPT162_GTWP_OFFSET)
#define GPT162_GTWP_PRKEY                 (8 <<  8) /* 100: GTWP Key Code */
#define GPT162_GTWP_PRKEY_MASK                 (0xff)
#define GPT162_GTWP_WP                    (1 <<  0) /* 01: Register Write Disable */
#define GPT162_GTSTR_OFFSET               0x0004
#define GPT162_GTSTR                      (GPT162_BASE + GPT162_GTSTR_OFFSET)
#define GPT162_GTSTR_CSTRT7               (1 <<  7) /* 80: Channel 7 GTCNT Count Start Read data shows each channel's counter status (GTCR.CST bit). 0 means counter stop. 1 means counter running. */
#define GPT162_GTSTR_CSTRT6               (1 <<  6) /* 40: Channel 6 GTCNT Count Start Read data shows each channel's counter status (GTCR.CST bit). 0 means counter stop. 1 means counter running. */
#define GPT162_GTSTR_CSTRT5               (1 <<  5) /* 20: Channel 5 GTCNT Count Start Read data shows each channel's counter status (GTCR.CST bit). 0 means counter stop. 1 means counter running. */
#define GPT162_GTSTR_CSTRT4               (1 <<  4) /* 10: Channel 4 GTCNT Count Start Read data shows each channel's counter status (GTCR.CST bit). 0 means counter stop. 1 means counter running. */
#define GPT162_GTSTR_CSTRT3               (1 <<  3) /* 08: Channel 3 GTCNT Count Start Read data shows each channel's counter status (GTCR.CST bit). 0 means counter stop. 1 means counter running. */
#define GPT162_GTSTR_CSTRT2               (1 <<  2) /* 04: Channel 2 GTCNT Count Start Read data shows each channel's counter status (GTCR.CST bit). 0 means counter stop. 1 means counter running. */
#define GPT162_GTSTR_CSTRT1               (1 <<  1) /* 02: Channel 1 GTCNT Count Start Read data shows each channel's counter status (GTCR.CST bit). 0 means counter stop. 1 means counter running. */
#define GPT162_GTSTR_CSTRT0               (1 <<  0) /* 01: Channel 0 GTCNT Count Start Read data shows each channel's counter status (GTCR.CST bit). 0 means counter stop. 1 means counter running. */
#define GPT162_GTSTP_OFFSET               0x0008
#define GPT162_GTSTP                      (GPT162_BASE + GPT162_GTSTP_OFFSET)
#define GPT162_GTSTP_CSTOP7               (1 <<  7) /* 80: Channel 7 GTCNT Count Stop Read data shows each channel's counter status (GTCR.CST bit). 0 means counter runnning. 1 means counter stop. */
#define GPT162_GTSTP_CSTOP6               (1 <<  6) /* 40: Channel 6 GTCNT Count Stop Read data shows each channel's counter status (GTCR.CST bit). 0 means counter runnning. 1 means counter stop. */
#define GPT162_GTSTP_CSTOP5               (1 <<  5) /* 20: Channel 5 GTCNT Count Stop Read data shows each channel's counter status (GTCR.CST bit). 0 means counter runnning. 1 means counter stop. */
#define GPT162_GTSTP_CSTOP4               (1 <<  4) /* 10: Channel 4 GTCNT Count Stop Read data shows each channel's counter status (GTCR.CST bit). 0 means counter runnning. 1 means counter stop. */
#define GPT162_GTSTP_CSTOP3               (1 <<  3) /* 08: Channel 3 GTCNT Count Stop Read data shows each channel's counter status (GTCR.CST bit). 0 means counter runnning. 1 means counter stop. */
#define GPT162_GTSTP_CSTOP2               (1 <<  2) /* 04: Channel 2 GTCNT Count Stop Read data shows each channel's counter status (GTCR.CST bit). 0 means counter runnning. 1 means counter stop. */
#define GPT162_GTSTP_CSTOP1               (1 <<  1) /* 02: Channel 1 GTCNT Count Stop Read data shows each channel's counter status (GTCR.CST bit). 0 means counter runnning. 1 means counter stop. */
#define GPT162_GTSTP_CSTOP0               (1 <<  0) /* 01: Channel 0 GTCNT Count Stop Read data shows each channel's counter status (GTCR.CST bit). 0 means counter runnning. 1 means counter stop. */
#define GPT162_GTCLR_OFFSET               0x000c
#define GPT162_GTCLR                      (GPT162_BASE + GPT162_GTCLR_OFFSET)
#define GPT162_GTCLR_CCLR7                (1 <<  7) /* 80: Channel 7 GTCNT Count Clear */
#define GPT162_GTCLR_CCLR6                (1 <<  6) /* 40: Channel 6 GTCNT Count Clear */
#define GPT162_GTCLR_CCLR5                (1 <<  5) /* 20: Channel 5 GTCNT Count Clear */
#define GPT162_GTCLR_CCLR4                (1 <<  4) /* 10: Channel 4 GTCNT Count Clear */
#define GPT162_GTCLR_CCLR3                (1 <<  3) /* 08: Channel 3 GTCNT Count Clear */
#define GPT162_GTCLR_CCLR2                (1 <<  2) /* 04: Channel 2 GTCNT Count Clear */
#define GPT162_GTCLR_CCLR1                (1 <<  1) /* 02: Channel 1 GTCNT Count Clear */
#define GPT162_GTCLR_CCLR0                (1 <<  0) /* 01: Channel 0 GTCNT Count Clear */
#define GPT162_GTSSR_OFFSET               0x0010
#define GPT162_GTSSR                      (GPT162_BASE + GPT162_GTSSR_OFFSET)
#define GPT162_GTSSR_CSTRT                (1 << 31) /* 80000000: Software Source Counter Start Enable */
#define GPT162_GTSSR_SSELCH               (1 << 23) /* 800000: ELC_GPTH Event Source Counter Start Enable */
#define GPT162_GTSSR_SSELCG               (1 << 22) /* 400000: ELC_GPTG Event Source Counter Start Enable */
#define GPT162_GTSSR_SSELCF               (1 << 21) /* 200000: ELC_GPTF Event Source Counter Start Enable */
#define GPT162_GTSSR_SSELCE               (1 << 20) /* 100000: ELC_GPTE Event Source Counter Start Enable */
#define GPT162_GTSSR_SSELCD               (1 << 19) /* 80000: ELC_GPTD Event Source Counter Start Enable */
#define GPT162_GTSSR_SSELCC               (1 << 18) /* 40000: ELC_GPTC Event Source Counter Start Enable */
#define GPT162_GTSSR_SSELCB               (1 << 17) /* 20000: ELC_GPTB Event Source Counter Start Enable */
#define GPT162_GTSSR_SSELCA               (1 << 16) /* 10000: ELC_GPTA Event Source Counter Start Enable */
#define GPT162_GTSSR_SSCBFAH              (1 << 15) /* 8000: GTIOCB Pin Falling Input during GTIOCA Value High Source Counter Start Enable */
#define GPT162_GTSSR_SSCBFAL              (1 << 14) /* 4000: GTIOCB Pin Falling Input during GTIOCA Value Low Source Counter Start Enable */
#define GPT162_GTSSR_SSCBRAH              (1 << 13) /* 2000: GTIOCB Pin Rising Input during GTIOCA Value High Source Counter Start Enable */
#define GPT162_GTSSR_SSCBRAL              (1 << 12) /* 1000: GTIOCB Pin Rising Input during GTIOCA Value Low Source Counter Start Enable */
#define GPT162_GTSSR_SSCAFBH              (1 << 11) /* 800: GTIOCA Pin Falling Input during GTIOCB Value High Source Counter Start Enable */
#define GPT162_GTSSR_SSCAFBL              (1 << 10) /* 400: GTIOCA Pin Falling Input during GTIOCB Value Low Source Counter Start Enable */
#define GPT162_GTSSR_SSCARBH              (1 <<  9) /* 200: GTIOCA Pin Rising Input during GTIOCB Value High Source Counter Start Enable */
#define GPT162_GTSSR_SSCARBL              (1 <<  8) /* 100: GTIOCA Pin Rising Input during GTIOCB Value Low Source Counter Start Enable */
#define GPT162_GTSSR_SSGTRGBF             (1 <<  3) /* 08: GTETRGB Pin Falling Input Source Counter Start Enable */
#define GPT162_GTSSR_SSGTRGBR             (1 <<  2) /* 04: GTETRGB Pin Rising Input Source Counter Start Enable */
#define GPT162_GTSSR_SSGTRGAF             (1 <<  1) /* 02: GTETRGA Pin Falling Input Source Counter Start Enable */
#define GPT162_GTSSR_SSGTRGAR             (1 <<  0) /* 01: GTETRGA Pin Rising Input Source Counter Start Enable */
#define GPT162_GTPSR_OFFSET               0x0014
#define GPT162_GTPSR                      (GPT162_BASE + GPT162_GTPSR_OFFSET)
#define GPT162_GTPSR_CSTOP                (1 << 31) /* 80000000: Software Source Counter Stop Enable */
#define GPT162_GTPSR_PSELCH               (1 << 23) /* 800000: ELC_GPTH Event Source Counter Stop Enable */
#define GPT162_GTPSR_PSELCG               (1 << 22) /* 400000: ELC_GPTG Event Source Counter Stop Enable */
#define GPT162_GTPSR_PSELCF               (1 << 21) /* 200000: ELC_GPTF Event Source Counter Stop Enable */
#define GPT162_GTPSR_PSELCE               (1 << 20) /* 100000: ELC_GPTE Event Source Counter Stop Enable */
#define GPT162_GTPSR_PSELCD               (1 << 19) /* 80000: ELC_GPTD Event Source Counter Stop Enable */
#define GPT162_GTPSR_PSELCC               (1 << 18) /* 40000: ELC_GPTC Event Source Counter Stop Enable */
#define GPT162_GTPSR_PSELCB               (1 << 17) /* 20000: ELC_GPTB Event Source Counter Stop Enable */
#define GPT162_GTPSR_PSELCA               (1 << 16) /* 10000: ELC_GPTA Event Source Counter Stop Enable */
#define GPT162_GTPSR_PSCBFAH              (1 << 15) /* 8000: GTIOCB Pin Falling Input during GTIOCA Value High Source Counter Stop Enable */
#define GPT162_GTPSR_PSCBFAL              (1 << 14) /* 4000: GTIOCB Pin Falling Input during GTIOCA Value Low Source Counter Stop Enable */
#define GPT162_GTPSR_PSCBRAH              (1 << 13) /* 2000: GTIOCB Pin Rising Input during GTIOCA Value High Source Counter Stop Enable */
#define GPT162_GTPSR_PSCBRAL              (1 << 12) /* 1000: GTIOCB Pin Rising Input during GTIOCA Value Low Source Counter Stop Enable */
#define GPT162_GTPSR_PSCAFBH              (1 << 11) /* 800: GTIOCA Pin Falling Input during GTIOCB Value High Source Counter Stop Enable */
#define GPT162_GTPSR_PSCAFBL              (1 << 10) /* 400: GTIOCA Pin Falling Input during GTIOCB Value Low Source Counter Stop Enable */
#define GPT162_GTPSR_PSCARBH              (1 <<  9) /* 200: GTIOCA Pin Rising Input during GTIOCB Value High Source Counter Stop Enable */
#define GPT162_GTPSR_PSCARBL              (1 <<  8) /* 100: GTIOCA Pin Rising Input during GTIOCB Value Low Source Counter Stop Enable */
#define GPT162_GTPSR_PSGTRGBF             (1 <<  3) /* 08: GTETRGB Pin Falling Input Source Counter Stop Enable */
#define GPT162_GTPSR_PSGTRGBR             (1 <<  2) /* 04: GTETRGB Pin Rising Input Source Counter Stop Enable */
#define GPT162_GTPSR_PSGTRGAF             (1 <<  1) /* 02: GTETRGA Pin Falling Input Source Counter Stop Enable */
#define GPT162_GTPSR_PSGTRGAR             (1 <<  0) /* 01: GTETRGA Pin Rising Input Source Counter Stop Enable */
#define GPT162_GTCSR_OFFSET               0x0018
#define GPT162_GTCSR                      (GPT162_BASE + GPT162_GTCSR_OFFSET)
#define GPT162_GTCSR_CCLR                 (1 << 31) /* 80000000: Software Source Counter Clear Enable */
#define GPT162_GTCSR_CSELCH               (1 << 23) /* 800000: ELC_GPTH Event Source Counter Clear Enable */
#define GPT162_GTCSR_CSELCG               (1 << 22) /* 400000: ELC_GPTG Event Source Counter Clear Enable */
#define GPT162_GTCSR_CSELCF               (1 << 21) /* 200000: ELC_GPTF Event Source Counter Clear Enable */
#define GPT162_GTCSR_CSELCE               (1 << 20) /* 100000: ELC_GPTE Event Source Counter Clear Enable */
#define GPT162_GTCSR_CSELCD               (1 << 19) /* 80000: ELC_GPTD Event Source Counter Clear Enable */
#define GPT162_GTCSR_CSELCC               (1 << 18) /* 40000: ELC_GPTC Event Source Counter Clear Enable */
#define GPT162_GTCSR_CSELCB               (1 << 17) /* 20000: ELC_GPTB Event Source Counter Clear Enable */
#define GPT162_GTCSR_CSELCA               (1 << 16) /* 10000: ELC_GPTA Event Source Counter Clear Enable */
#define GPT162_GTCSR_CSCBFAH              (1 << 15) /* 8000: GTIOCB Pin Falling Input during GTIOCA Value High Source Counter Clear Enable */
#define GPT162_GTCSR_CSCBFAL              (1 << 14) /* 4000: GTIOCB Pin Falling Input during GTIOCA Value Low Source Counter Clear Enable */
#define GPT162_GTCSR_CSCBRAH              (1 << 13) /* 2000: GTIOCB Pin Rising Input during GTIOCA Value High Source Counter Clear Enable */
#define GPT162_GTCSR_CSCBRAL              (1 << 12) /* 1000: GTIOCB Pin Rising Input during GTIOCA Value Low Source Counter Clear Enable */
#define GPT162_GTCSR_CSCAFBH              (1 << 11) /* 800: GTIOCA Pin Falling Input during GTIOCB Value High Source Counter Clear Enable */
#define GPT162_GTCSR_CSCAFBL              (1 << 10) /* 400: GTIOCA Pin Falling Input during GTIOCB Value Low Source Counter Clear Enable */
#define GPT162_GTCSR_CSCARBH              (1 <<  9) /* 200: GTIOCA Pin Rising Input during GTIOCB Value High Source Counter Clear Enable */
#define GPT162_GTCSR_CSCARBL              (1 <<  8) /* 100: GTIOCA Pin Rising Input during GTIOCB Value Low Source Counter Clear Enable */
#define GPT162_GTCSR_CSGTRGBF             (1 <<  3) /* 08: GTETRGB Pin Falling Input Source Counter Clear Enable */
#define GPT162_GTCSR_CSGTRGBR             (1 <<  2) /* 04: GTETRGB Pin Rising Input Source Counter Clear Enable */
#define GPT162_GTCSR_CSGTRGAF             (1 <<  1) /* 02: GTETRGA Pin Falling Input Source Counter Clear Enable */
#define GPT162_GTCSR_CSGTRGAR             (1 <<  0) /* 01: GTETRGA Pin Rising Input Source Counter Clear Enable */
#define GPT162_GTUPSR_OFFSET              0x001c
#define GPT162_GTUPSR                     (GPT162_BASE + GPT162_GTUPSR_OFFSET)
#define GPT162_GTUPSR_USELCH              (1 << 23) /* 800000: ELC_GPTH Event Source Counter Count Up Enable */
#define GPT162_GTUPSR_USELCG              (1 << 22) /* 400000: ELC_GPTG Event Source Counter Count Up Enable */
#define GPT162_GTUPSR_USELCF              (1 << 21) /* 200000: ELC_GPTF Event Source Counter Count Up Enable */
#define GPT162_GTUPSR_USELCE              (1 << 20) /* 100000: ELC_GPTE Event Source Counter Count Up Enable */
#define GPT162_GTUPSR_USELCD              (1 << 19) /* 80000: ELC_GPTD Event Source Counter Count Up Enable */
#define GPT162_GTUPSR_USELCC              (1 << 18) /* 40000: ELC_GPTC Event Source Counter Count Up Enable */
#define GPT162_GTUPSR_USELCB              (1 << 17) /* 20000: ELC_GPTB Event Source Counter Count Up Enable */
#define GPT162_GTUPSR_USELCA              (1 << 16) /* 10000: ELC_GPTA Event Source Counter Count Up Enable */
#define GPT162_GTUPSR_USCBFAH             (1 << 15) /* 8000: GTIOCB Pin Falling Input during GTIOCA Value High Source Counter Count Up Enable */
#define GPT162_GTUPSR_USCBFAL             (1 << 14) /* 4000: GTIOCB Pin Falling Input during GTIOCA Value Low Source Counter Count Up Enable */
#define GPT162_GTUPSR_USCBRAH             (1 << 13) /* 2000: GTIOCB Pin Rising Input during GTIOCA Value High Source Counter Count Up Enable */
#define GPT162_GTUPSR_USCBRAL             (1 << 12) /* 1000: GTIOCB Pin Rising Input during GTIOCA Value Low Source Counter Count Up Enable */
#define GPT162_GTUPSR_USCAFBH             (1 << 11) /* 800: GTIOCA Pin Falling Input during GTIOCB Value High Source Counter Count Up Enable */
#define GPT162_GTUPSR_USCAFBL             (1 << 10) /* 400: GTIOCA Pin Falling Input during GTIOCB Value Low Source Counter Count Up Enable */
#define GPT162_GTUPSR_USCARBH             (1 <<  9) /* 200: GTIOCA Pin Rising Input during GTIOCB Value High Source Counter Count Up Enable */
#define GPT162_GTUPSR_USCARBL             (1 <<  8) /* 100: GTIOCA Pin Rising Input during GTIOCB Value Low Source Counter Count Up Enable */
#define GPT162_GTUPSR_USGTRGBF            (1 <<  3) /* 08: GTETRGB Pin Falling Input Source Counter Count Up Enable */
#define GPT162_GTUPSR_USGTRGBR            (1 <<  2) /* 04: GTETRGB Pin Rising Input Source Counter Count Up Enable */
#define GPT162_GTUPSR_USGTRGAF            (1 <<  1) /* 02: GTETRGA Pin Falling Input Source Counter Count Up Enable */
#define GPT162_GTUPSR_USGTRGAR            (1 <<  0) /* 01: GTETRGA Pin Rising Input Source Counter Count Up Enable */
#define GPT162_GTDNSR_OFFSET              0x0020
#define GPT162_GTDNSR                     (GPT162_BASE + GPT162_GTDNSR_OFFSET)
#define GPT162_GTDNSR_DSELCH              (1 << 23) /* 800000: ELC_GPTH Event Source Counter Count Down Enable */
#define GPT162_GTDNSR_DSELCG              (1 << 22) /* 400000: ELC_GPTG Event Source Counter Count Down Enable */
#define GPT162_GTDNSR_DSELCF              (1 << 21) /* 200000: ELC_GPTF Event Source Counter Count Down Enable */
#define GPT162_GTDNSR_DSELCE              (1 << 20) /* 100000: ELC_GPTE Event Source Counter Count Down Enable */
#define GPT162_GTDNSR_DSELCD              (1 << 19) /* 80000: ELC_GPTD Event Source Counter Count Down Enable */
#define GPT162_GTDNSR_DSELCC              (1 << 18) /* 40000: ELC_GPTC Event Source Counter Count Down Enable */
#define GPT162_GTDNSR_DSELCB              (1 << 17) /* 20000: ELC_GPTB Event Source Counter Count Down Enable */
#define GPT162_GTDNSR_DSELCA              (1 << 16) /* 10000: ELC_GPTA Event Source Counter Count Down Enable */
#define GPT162_GTDNSR_DSCBFAH             (1 << 15) /* 8000: GTIOCB Pin Falling Input during GTIOCA Value High Source Counter Count Down Enable */
#define GPT162_GTDNSR_DSCBFAL             (1 << 14) /* 4000: GTIOCB Pin Falling Input during GTIOCA Value Low Source Counter Count Down Enable */
#define GPT162_GTDNSR_DSCBRAH             (1 << 13) /* 2000: GTIOCB Pin Rising Input during GTIOCA Value High Source Counter Count Down Enable */
#define GPT162_GTDNSR_DSCBRAL             (1 << 12) /* 1000: GTIOCB Pin Rising Input during GTIOCA Value Low Source Counter Count Down Enable */
#define GPT162_GTDNSR_DSCAFBH             (1 << 11) /* 800: GTIOCA Pin Falling Input during GTIOCB Value High Source Counter Count Down Enable */
#define GPT162_GTDNSR_DSCAFBL             (1 << 10) /* 400: GTIOCA Pin Falling Input during GTIOCB Value Low Source Counter Count Down Enable */
#define GPT162_GTDNSR_DSCARBH             (1 <<  9) /* 200: GTIOCA Pin Rising Input during GTIOCB Value High Source Counter Count Down Enable */
#define GPT162_GTDNSR_DSCARBL             (1 <<  8) /* 100: GTIOCA Pin Rising Input during GTIOCB Value Low Source Counter Count Down Enable */
#define GPT162_GTDNSR_DSGTRGBF            (1 <<  3) /* 08: GTETRGB Pin Falling Input Source Counter Count Down Enable */
#define GPT162_GTDNSR_DSGTRGBR            (1 <<  2) /* 04: GTETRGB Pin Rising Input Source Counter Count Down Enable */
#define GPT162_GTDNSR_DSGTRGAF            (1 <<  1) /* 02: GTETRGA Pin Falling Input Source Counter Count Down Enable */
#define GPT162_GTDNSR_DSGTRGAR            (1 <<  0) /* 01: GTETRGA Pin Rising Input Source Counter Count Down Enable */
#define GPT162_GTICASR_OFFSET             0x0024
#define GPT162_GTICASR                    (GPT162_BASE + GPT162_GTICASR_OFFSET)
#define GPT162_GTICASR_ASELCH             (1 << 23) /* 800000: ELC_GPTH Event Source GTCCRA Input Capture Enable */
#define GPT162_GTICASR_ASELCG             (1 << 22) /* 400000: ELC_GPTG Event Source GTCCRA Input Capture Enable */
#define GPT162_GTICASR_ASELCF             (1 << 21) /* 200000: ELC_GPTF Event Source GTCCRA Input Capture Enable */
#define GPT162_GTICASR_ASELCE             (1 << 20) /* 100000: ELC_GPTE Event Source GTCCRA Input Capture Enable */
#define GPT162_GTICASR_ASELCD             (1 << 19) /* 80000: ELC_GPTD Event Source GTCCRA Input Capture Enable */
#define GPT162_GTICASR_ASELCC             (1 << 18) /* 40000: ELC_GPTC Event Source GTCCRA Input Capture Enable */
#define GPT162_GTICASR_ASELCB             (1 << 17) /* 20000: ELC_GPTB Event Source GTCCRA Input Capture Enable */
#define GPT162_GTICASR_ASELCA             (1 << 16) /* 10000: ELC_GPTA Event Source GTCCRA Input Capture Enable */
#define GPT162_GTICASR_ASCBFAH            (1 << 15) /* 8000: GTIOCB Pin Falling Input during GTIOCA Value High Source GTCCRA Input Capture Enable */
#define GPT162_GTICASR_ASCBFAL            (1 << 14) /* 4000: GTIOCB Pin Falling Input during GTIOCA Value Low Source GTCCRA Input Capture Enable */
#define GPT162_GTICASR_ASCBRAH            (1 << 13) /* 2000: GTIOCB Pin Rising Input during GTIOCA Value High Source GTCCRA Input Capture Enable */
#define GPT162_GTICASR_ASCBRAL            (1 << 12) /* 1000: GTIOCB Pin Rising Input during GTIOCA Value Low Source GTCCRA Input Capture Enable */
#define GPT162_GTICASR_ASCAFBH            (1 << 11) /* 800: GTIOCA Pin Falling Input during GTIOCB Value High Source GTCCRA Input Capture Enable */
#define GPT162_GTICASR_ASCAFBL            (1 << 10) /* 400: GTIOCA Pin Falling Input during GTIOCB Value Low Source GTCCRA Input Capture Enable */
#define GPT162_GTICASR_ASCARBH            (1 <<  9) /* 200: GTIOCA Pin Rising Input during GTIOCB Value High Source GTCCRA Input Capture Enable */
#define GPT162_GTICASR_ASCARBL            (1 <<  8) /* 100: GTIOCA Pin Rising Input during GTIOCB Value Low Source GTCCRA Input Capture Enable */
#define GPT162_GTICASR_ASGTRGBF           (1 <<  3) /* 08: GTETRGB Pin Falling Input Source GTCCRA Input Capture Enable */
#define GPT162_GTICASR_ASGTRGBR           (1 <<  2) /* 04: GTETRGB Pin Rising Input Source GTCCRA Input Capture Enable */
#define GPT162_GTICASR_ASGTRGAF           (1 <<  1) /* 02: GTETRGA Pin Falling Input Source GTCCRA Input Capture Enable */
#define GPT162_GTICASR_ASGTRGAR           (1 <<  0) /* 01: GTETRGA Pin Rising Input Source GTCCRA Input Capture Enable */
#define GPT162_GTICBSR_OFFSET             0x0028
#define GPT162_GTICBSR                    (GPT162_BASE + GPT162_GTICBSR_OFFSET)
#define GPT162_GTICBSR_BSELCH             (1 << 23) /* 800000: ELC_GPTH Event Source GTCCRB Input Capture Enable */
#define GPT162_GTICBSR_BSELCG             (1 << 22) /* 400000: ELC_GPTG Event Source GTCCRB Input Capture Enable */
#define GPT162_GTICBSR_BSELCF             (1 << 21) /* 200000: ELC_GPTF Event Source GTCCRB Input Capture Enable */
#define GPT162_GTICBSR_BSELCE             (1 << 20) /* 100000: ELC_GPTE Event Source GTCCRB Input Capture Enable */
#define GPT162_GTICBSR_BSELCD             (1 << 19) /* 80000: ELC_GPTD Event Source GTCCRB Input Capture Enable */
#define GPT162_GTICBSR_BSELCC             (1 << 18) /* 40000: ELC_GPTC Event Source GTCCRB Input Capture Enable */
#define GPT162_GTICBSR_BSELCB             (1 << 17) /* 20000: ELC_GPTB Event Source GTCCRB Input Capture Enable */
#define GPT162_GTICBSR_BSELCA             (1 << 16) /* 10000: ELC_GPTA Event Source GTCCRB Input Capture Enable */
#define GPT162_GTICBSR_BSCBFAH            (1 << 15) /* 8000: GTIOCB Pin Falling Input during GTIOCA Value High Source GTCCRB Input Capture Enable */
#define GPT162_GTICBSR_BSCBFAL            (1 << 14) /* 4000: GTIOCB Pin Falling Input during GTIOCA Value Low Source GTCCRB Input Capture Enable */
#define GPT162_GTICBSR_BSCBRAH            (1 << 13) /* 2000: GTIOCB Pin Rising Input during GTIOCA Value High Source GTCCRB Input Capture Enable */
#define GPT162_GTICBSR_BSCBRAL            (1 << 12) /* 1000: GTIOCB Pin Rising Input during GTIOCA Value Low Source GTCCRB Input Capture Enable */
#define GPT162_GTICBSR_BSCAFBH            (1 << 11) /* 800: GTIOCA Pin Falling Input during GTIOCB Value High Source GTCCRB Input Capture Enable */
#define GPT162_GTICBSR_BSCAFBL            (1 << 10) /* 400: GTIOCA Pin Falling Input during GTIOCB Value Low Source GTCCRB Input Capture Enable */
#define GPT162_GTICBSR_BSCARBH            (1 <<  9) /* 200: GTIOCA Pin Rising Input during GTIOCB Value High Source GTCCRB Input Capture Enable */
#define GPT162_GTICBSR_BSCARBL            (1 <<  8) /* 100: GTIOCA Pin Rising Input during GTIOCB Value Low Source GTCCRB Input Capture Enable */
#define GPT162_GTICBSR_BSGTRGBF           (1 <<  3) /* 08: GTETRGB Pin Falling Input Source GTCCRB Input Capture Enable */
#define GPT162_GTICBSR_BSGTRGBR           (1 <<  2) /* 04: GTETRGB Pin Rising Input Source GTCCRB Input Capture Enable */
#define GPT162_GTICBSR_BSGTRGAF           (1 <<  1) /* 02: GTETRGA Pin Falling Input Source GTCCRB Input Capture Enable */
#define GPT162_GTICBSR_BSGTRGAR           (1 <<  0) /* 01: GTETRGA Pin Rising Input Source GTCCRB Input Capture Enable */
#define GPT162_GTCR_OFFSET                0x002c
#define GPT162_GTCR                       (GPT162_BASE + GPT162_GTCR_OFFSET)
#define GPT162_GTCR_TPCS                  (3 << 24) /* 1000000: Timer Prescaler Select */
#define GPT162_GTCR_TPCS_MASK                  (0x07)
#define GPT162_GTCR_MD                    (3 << 16) /* 10000: Mode Select */
#define GPT162_GTCR_MD_MASK                    (0x07)
