leocafonso/svdtoheaders/demo/h/ra4m1_reg.h
#define GPT162_GTCR_CST                   (1 <<  0) /* 01: Count Start */
#define GPT162_GTUDDTYC_OFFSET            0x0030
#define GPT162_GTUDDTYC                   (GPT162_BASE + GPT162_GTUDDTYC_OFFSET)
#define GPT162_GTUDDTYC_OBDTYR            (1 << 27) /* 8000000: GTIOCB Output Value Selecting after Releasing 0 percent/100 percent Duty Setting */
#define GPT162_GTUDDTYC_OBDTYF            (1 << 26) /* 4000000: Forcible GTIOCB Output Duty Setting */
#define GPT162_GTUDDTYC_OBDTY             (2 << 24) /* 1000000: GTIOCB Output Duty Setting */
#define GPT162_GTUDDTYC_OBDTY_MASK             (0x03)
#define GPT162_GTUDDTYC_OADTYR            (1 << 19) /* 80000: GTIOCA Output Value Selecting after Releasing 0 percent/100 percent Duty Setting */
#define GPT162_GTUDDTYC_OADTYF            (1 << 18) /* 40000: Forcible GTIOCA Output Duty Setting */
#define GPT162_GTUDDTYC_OADTY             (2 << 16) /* 10000: GTIOCA Output Duty Setting */
#define GPT162_GTUDDTYC_OADTY_MASK             (0x03)
#define GPT162_GTUDDTYC_UDF               (1 <<  1) /* 02: Forcible Count Direction Setting */
#define GPT162_GTUDDTYC_UD                (1 <<  0) /* 01: Count Direction Setting */
#define GPT162_GTIOR_OFFSET               0x0034
#define GPT162_GTIOR                      (GPT162_BASE + GPT162_GTIOR_OFFSET)
#define GPT162_GTIOR_NFCSB                (2 << 30) /* 40000000: Noise Filter B Sampling Clock Select */
#define GPT162_GTIOR_NFCSB_MASK                (0x03)
#define GPT162_GTIOR_NFBEN                (1 << 29) /* 20000000: Noise Filter B Enable */
#define GPT162_GTIOR_OBDF                 (2 << 25) /* 2000000: GTIOCB Pin Disable Value Setting */
#define GPT162_GTIOR_OBDF_MASK                 (0x03)
#define GPT162_GTIOR_OBE                  (1 << 24) /* 1000000: GTIOCB Pin Output Enable */
#define GPT162_GTIOR_OBHLD                (1 << 23) /* 800000: GTIOCB Pin Output Setting at the Start/Stop Count */
#define GPT162_GTIOR_OBDFLT               (1 << 22) /* 400000: GTIOCB Pin Output Value Setting at the Count Stop */
#define GPT162_GTIOR_GTIOB                (5 << 16) /* 10000: GTIOCB Pin Function Select */
#define GPT162_GTIOR_GTIOB_MASK                (0x1f)
#define GPT162_GTIOR_NFCSA                (2 << 14) /* 4000: Noise Filter A Sampling Clock Select */
#define GPT162_GTIOR_NFCSA_MASK                (0x03)
#define GPT162_GTIOR_NFAEN                (1 << 13) /* 2000: Noise Filter A Enable */
#define GPT162_GTIOR_OADF                 (2 <<  9) /* 200: GTIOCA Pin Disable Value Setting */
#define GPT162_GTIOR_OADF_MASK                 (0x03)
#define GPT162_GTIOR_OAE                  (1 <<  8) /* 100: GTIOCA Pin Output Enable */
#define GPT162_GTIOR_OAHLD                (1 <<  7) /* 80: GTIOCA Pin Output Setting at the Start/Stop Count */
#define GPT162_GTIOR_OADFLT               (1 <<  6) /* 40: GTIOCA Pin Output Value Setting at the Count Stop */
#define GPT162_GTIOR_GTIOA                (5 <<  0) /* 01: GTIOCA Pin Function Select */
#define GPT162_GTIOR_GTIOA_MASK                (0x1f)
#define GPT162_GTINTAD_OFFSET             0x0038
#define GPT162_GTINTAD                    (GPT162_BASE + GPT162_GTINTAD_OFFSET)
#define GPT162_GTINTAD_GRPABL             (1 << 30) /* 40000000: Same Time Output Level Low Disable Request Enable */
#define GPT162_GTINTAD_GRPABH             (1 << 29) /* 20000000: Same Time Output Level High Disable Request Enable */
#define GPT162_GTINTAD_GRP                (2 << 24) /* 1000000: Output Disable Source Select */
#define GPT162_GTINTAD_GRP_MASK                (0x03)
#define GPT162_GTST_OFFSET                0x003c
#define GPT162_GTST                       (GPT162_BASE + GPT162_GTST_OFFSET)
#define GPT162_GTST_OABLF                 (1 << 30) /* 40000000: Same Time Output Level Low Disable Request Enable */
#define GPT162_GTST_OABHF                 (1 << 29) /* 20000000: Same Time Output Level High Disable Request Enable */
#define GPT162_GTST_ODF                   (1 << 24) /* 1000000: Output Disable Flag */
#define GPT162_GTST_TUCF                  (1 << 15) /* 8000: Count Direction Flag */
#define GPT162_GTST_TCFPU                 (1 <<  7) /* 80: Underflow Flag */
#define GPT162_GTST_TCFPO                 (1 <<  6) /* 40: Overflow Flag */
#define GPT162_GTST_TCFF                  (1 <<  5) /* 20: Input Compare Match Flag F */
#define GPT162_GTST_TCFE                  (1 <<  4) /* 10: Input Compare Match Flag E */
#define GPT162_GTST_TCFD                  (1 <<  3) /* 08: Input Compare Match Flag D */
#define GPT162_GTST_TCFC                  (1 <<  2) /* 04: Input Compare Match Flag C */
#define GPT162_GTST_TCFB                  (1 <<  1) /* 02: Input Capture/Compare Match Flag B */
#define GPT162_GTST_TCFA                  (1 <<  0) /* 01: Input Capture/Compare Match Flag A */
#define GPT162_GTBER_OFFSET               0x0040
#define GPT162_GTBER                      (GPT162_BASE + GPT162_GTBER_OFFSET)
#define GPT162_GTBER_CCRSWT               (1 << 22) /* 400000: GTCCRA and GTCCRB Forcible Buffer Operation This bit is read as 0. */
#define GPT162_GTBER_PR                   (2 << 20) /* 100000: GTPR Buffer Operation */
#define GPT162_GTBER_PR_MASK                   (0x03)
#define GPT162_GTBER_CCRB                 (2 << 18) /* 40000: GTCCRB Buffer Operation */
#define GPT162_GTBER_CCRB_MASK                 (0x03)
#define GPT162_GTBER_CCRA                 (2 << 16) /* 10000: GTCCRA Buffer Operation */
#define GPT162_GTBER_CCRA_MASK                 (0x03)
#define GPT162_GTBER_BD                   (2 <<  0) /* 01: BD[1]: GTPR Buffer Operation Disable BD[0]: GTCCR Buffer Operation Disable */
#define GPT162_GTBER_BD_MASK                   (0x03)
#define GPT162_GTCNT_OFFSET               0x0048
#define GPT162_GTCNT                      (GPT162_BASE + GPT162_GTCNT_OFFSET)
#define GPT162_GTCNT_GTCNT                (32 <<  0) /* 01: Counter */
#define GPT162_GTCNT_GTCNT_MASK                (0xffffffff)
#define GPT162_GTCCRA_OFFSET              0x004c
#define GPT162_GTCCRA                     (GPT162_BASE + GPT162_GTCCRA_OFFSET)
#define GPT162_GTCCRA_GTCCRA              (32 <<  0) /* 01: Compare Capture Register A */
#define GPT162_GTCCRA_GTCCRA_MASK              (0xffffffff)
#define GPT162_GTCCRB_OFFSET              0x0050
#define GPT162_GTCCRB                     (GPT162_BASE + GPT162_GTCCRB_OFFSET)
#define GPT162_GTCCRB_GTCCRB              (32 <<  0) /* 01: Compare Capture Register B */
#define GPT162_GTCCRB_GTCCRB_MASK              (0xffffffff)
#define GPT162_GTCCRC_OFFSET              0x0054
#define GPT162_GTCCRC                     (GPT162_BASE + GPT162_GTCCRC_OFFSET)
#define GPT162_GTCCRC_GTCCRC              (32 <<  0) /* 01: Compare Capture Register C */
#define GPT162_GTCCRC_GTCCRC_MASK              (0xffffffff)
#define GPT162_GTCCRE_OFFSET              0x0058
#define GPT162_GTCCRE                     (GPT162_BASE + GPT162_GTCCRE_OFFSET)
#define GPT162_GTCCRE_GTCCRE              (32 <<  0) /* 01: Compare Capture Register E */
#define GPT162_GTCCRE_GTCCRE_MASK              (0xffffffff)
#define GPT162_GTCCRD_OFFSET              0x005c
#define GPT162_GTCCRD                     (GPT162_BASE + GPT162_GTCCRD_OFFSET)
#define GPT162_GTCCRD_GTCCRD              (32 <<  0) /* 01: Compare Capture Register D */
#define GPT162_GTCCRD_GTCCRD_MASK              (0xffffffff)
#define GPT162_GTCCRF_OFFSET              0x0060
#define GPT162_GTCCRF                     (GPT162_BASE + GPT162_GTCCRF_OFFSET)
#define GPT162_GTCCRF_GTCCRF              (32 <<  0) /* 01: Compare Capture Register F */
#define GPT162_GTCCRF_GTCCRF_MASK              (0xffffffff)
#define GPT162_GTPR_OFFSET                0x0064
#define GPT162_GTPR                       (GPT162_BASE + GPT162_GTPR_OFFSET)
#define GPT162_GTPR_GTPR                  (32 <<  0) /* 01: Cycle Setting Register */
#define GPT162_GTPR_GTPR_MASK                  (0xffffffff)
#define GPT162_GTPBR_OFFSET               0x0068
#define GPT162_GTPBR                      (GPT162_BASE + GPT162_GTPBR_OFFSET)
#define GPT162_GTPBR_GTPBR                (32 <<  0) /* 01: Cycle Setting Buffer Register */
#define GPT162_GTPBR_GTPBR_MASK                (0xffffffff)
#define GPT162_GTDTCR_OFFSET              0x0088
#define GPT162_GTDTCR                     (GPT162_BASE + GPT162_GTDTCR_OFFSET)
#define GPT162_GTDTCR_TDE                 (1 <<  0) /* 01: Negative-Phase Waveform Setting */
#define GPT162_GTDVU_OFFSET               0x008c
#define GPT162_GTDVU                      (GPT162_BASE + GPT162_GTDVU_OFFSET)
#define GPT162_GTDVU_GTDVU                (32 <<  0) /* 01: Dead Time Value Register U */
#define GPT162_GTDVU_GTDVU_MASK                (0xffffffff)

