leocafonso/svdtoheaders/demo/h/ra4m1_reg.h
/* No registers defined for peripheral GPT163. Using those of GPT162. */
#define GPT163_BASE                       0x40078300
#define GPT163_GTWP_OFFSET                GPT162_GTWP_OFFSET
#define GPT163_GTWP                       GPT162_GTWP
#define GPT163_GTWP_PRKEY                 GPT162_GTWP_PRKEY
#define GPT163_GTWP_PRKEY_MASK            GPT162_GTWP_PRKEY_MASK
#define GPT163_GTWP_WP                    GPT162_GTWP_WP
#define GPT163_GTSTR_OFFSET               GPT162_GTSTR_OFFSET
#define GPT163_GTSTR                      GPT162_GTSTR
#define GPT163_GTSTR_CSTRT7               GPT162_GTSTR_CSTRT7
#define GPT163_GTSTR_CSTRT6               GPT162_GTSTR_CSTRT6
#define GPT163_GTSTR_CSTRT5               GPT162_GTSTR_CSTRT5
#define GPT163_GTSTR_CSTRT4               GPT162_GTSTR_CSTRT4
#define GPT163_GTSTR_CSTRT3               GPT162_GTSTR_CSTRT3
#define GPT163_GTSTR_CSTRT2               GPT162_GTSTR_CSTRT2
#define GPT163_GTSTR_CSTRT1               GPT162_GTSTR_CSTRT1
#define GPT163_GTSTR_CSTRT0               GPT162_GTSTR_CSTRT0
#define GPT163_GTSTP_OFFSET               GPT162_GTSTP_OFFSET
#define GPT163_GTSTP                      GPT162_GTSTP
#define GPT163_GTSTP_CSTOP7               GPT162_GTSTP_CSTOP7
#define GPT163_GTSTP_CSTOP6               GPT162_GTSTP_CSTOP6
#define GPT163_GTSTP_CSTOP5               GPT162_GTSTP_CSTOP5
#define GPT163_GTSTP_CSTOP4               GPT162_GTSTP_CSTOP4
#define GPT163_GTSTP_CSTOP3               GPT162_GTSTP_CSTOP3
#define GPT163_GTSTP_CSTOP2               GPT162_GTSTP_CSTOP2
#define GPT163_GTSTP_CSTOP1               GPT162_GTSTP_CSTOP1
#define GPT163_GTSTP_CSTOP0               GPT162_GTSTP_CSTOP0
#define GPT163_GTCLR_OFFSET               GPT162_GTCLR_OFFSET
#define GPT163_GTCLR                      GPT162_GTCLR
#define GPT163_GTCLR_CCLR7                GPT162_GTCLR_CCLR7
#define GPT163_GTCLR_CCLR6                GPT162_GTCLR_CCLR6
#define GPT163_GTCLR_CCLR5                GPT162_GTCLR_CCLR5
#define GPT163_GTCLR_CCLR4                GPT162_GTCLR_CCLR4
#define GPT163_GTCLR_CCLR3                GPT162_GTCLR_CCLR3
#define GPT163_GTCLR_CCLR2                GPT162_GTCLR_CCLR2
#define GPT163_GTCLR_CCLR1                GPT162_GTCLR_CCLR1
#define GPT163_GTCLR_CCLR0                GPT162_GTCLR_CCLR0
#define GPT163_GTSSR_OFFSET               GPT162_GTSSR_OFFSET
#define GPT163_GTSSR                      GPT162_GTSSR
#define GPT163_GTSSR_CSTRT                GPT162_GTSSR_CSTRT
#define GPT163_GTSSR_SSELCH               GPT162_GTSSR_SSELCH
#define GPT163_GTSSR_SSELCG               GPT162_GTSSR_SSELCG
#define GPT163_GTSSR_SSELCF               GPT162_GTSSR_SSELCF
#define GPT163_GTSSR_SSELCE               GPT162_GTSSR_SSELCE
#define GPT163_GTSSR_SSELCD               GPT162_GTSSR_SSELCD
#define GPT163_GTSSR_SSELCC               GPT162_GTSSR_SSELCC
#define GPT163_GTSSR_SSELCB               GPT162_GTSSR_SSELCB
#define GPT163_GTSSR_SSELCA               GPT162_GTSSR_SSELCA
#define GPT163_GTSSR_SSCBFAH              GPT162_GTSSR_SSCBFAH
#define GPT163_GTSSR_SSCBFAL              GPT162_GTSSR_SSCBFAL
#define GPT163_GTSSR_SSCBRAH              GPT162_GTSSR_SSCBRAH
#define GPT163_GTSSR_SSCBRAL              GPT162_GTSSR_SSCBRAL
#define GPT163_GTSSR_SSCAFBH              GPT162_GTSSR_SSCAFBH
#define GPT163_GTSSR_SSCAFBL              GPT162_GTSSR_SSCAFBL
#define GPT163_GTSSR_SSCARBH              GPT162_GTSSR_SSCARBH
#define GPT163_GTSSR_SSCARBL              GPT162_GTSSR_SSCARBL
#define GPT163_GTSSR_SSGTRGBF             GPT162_GTSSR_SSGTRGBF
#define GPT163_GTSSR_SSGTRGBR             GPT162_GTSSR_SSGTRGBR
#define GPT163_GTSSR_SSGTRGAF             GPT162_GTSSR_SSGTRGAF
#define GPT163_GTSSR_SSGTRGAR             GPT162_GTSSR_SSGTRGAR
#define GPT163_GTPSR_OFFSET               GPT162_GTPSR_OFFSET
#define GPT163_GTPSR                      GPT162_GTPSR
#define GPT163_GTPSR_CSTOP                GPT162_GTPSR_CSTOP
#define GPT163_GTPSR_PSELCH               GPT162_GTPSR_PSELCH
#define GPT163_GTPSR_PSELCG               GPT162_GTPSR_PSELCG
#define GPT163_GTPSR_PSELCF               GPT162_GTPSR_PSELCF
#define GPT163_GTPSR_PSELCE               GPT162_GTPSR_PSELCE
#define GPT163_GTPSR_PSELCD               GPT162_GTPSR_PSELCD
#define GPT163_GTPSR_PSELCC               GPT162_GTPSR_PSELCC
#define GPT163_GTPSR_PSELCB               GPT162_GTPSR_PSELCB
#define GPT163_GTPSR_PSELCA               GPT162_GTPSR_PSELCA
#define GPT163_GTPSR_PSCBFAH              GPT162_GTPSR_PSCBFAH
#define GPT163_GTPSR_PSCBFAL              GPT162_GTPSR_PSCBFAL
#define GPT163_GTPSR_PSCBRAH              GPT162_GTPSR_PSCBRAH
#define GPT163_GTPSR_PSCBRAL              GPT162_GTPSR_PSCBRAL
#define GPT163_GTPSR_PSCAFBH              GPT162_GTPSR_PSCAFBH
#define GPT163_GTPSR_PSCAFBL              GPT162_GTPSR_PSCAFBL
#define GPT163_GTPSR_PSCARBH              GPT162_GTPSR_PSCARBH
#define GPT163_GTPSR_PSCARBL              GPT162_GTPSR_PSCARBL
#define GPT163_GTPSR_PSGTRGBF             GPT162_GTPSR_PSGTRGBF
#define GPT163_GTPSR_PSGTRGBR             GPT162_GTPSR_PSGTRGBR
#define GPT163_GTPSR_PSGTRGAF             GPT162_GTPSR_PSGTRGAF
#define GPT163_GTPSR_PSGTRGAR             GPT162_GTPSR_PSGTRGAR
#define GPT163_GTCSR_OFFSET               GPT162_GTCSR_OFFSET
#define GPT163_GTCSR                      GPT162_GTCSR
#define GPT163_GTCSR_CCLR                 GPT162_GTCSR_CCLR
#define GPT163_GTCSR_CSELCH               GPT162_GTCSR_CSELCH
#define GPT163_GTCSR_CSELCG               GPT162_GTCSR_CSELCG
#define GPT163_GTCSR_CSELCF               GPT162_GTCSR_CSELCF
#define GPT163_GTCSR_CSELCE               GPT162_GTCSR_CSELCE
#define GPT163_GTCSR_CSELCD               GPT162_GTCSR_CSELCD
#define GPT163_GTCSR_CSELCC               GPT162_GTCSR_CSELCC
#define GPT163_GTCSR_CSELCB               GPT162_GTCSR_CSELCB
#define GPT163_GTCSR_CSELCA               GPT162_GTCSR_CSELCA
#define GPT163_GTCSR_CSCBFAH              GPT162_GTCSR_CSCBFAH
#define GPT163_GTCSR_CSCBFAL              GPT162_GTCSR_CSCBFAL
#define GPT163_GTCSR_CSCBRAH              GPT162_GTCSR_CSCBRAH
#define GPT163_GTCSR_CSCBRAL              GPT162_GTCSR_CSCBRAL
#define GPT163_GTCSR_CSCAFBH              GPT162_GTCSR_CSCAFBH
#define GPT163_GTCSR_CSCAFBL              GPT162_GTCSR_CSCAFBL
#define GPT163_GTCSR_CSCARBH              GPT162_GTCSR_CSCARBH
#define GPT163_GTCSR_CSCARBL              GPT162_GTCSR_CSCARBL
#define GPT163_GTCSR_CSGTRGBF             GPT162_GTCSR_CSGTRGBF
#define GPT163_GTCSR_CSGTRGBR             GPT162_GTCSR_CSGTRGBR
#define GPT163_GTCSR_CSGTRGAF             GPT162_GTCSR_CSGTRGAF
#define GPT163_GTCSR_CSGTRGAR             GPT162_GTCSR_CSGTRGAR
#define GPT163_GTUPSR_OFFSET              GPT162_GTUPSR_OFFSET
#define GPT163_GTUPSR                     GPT162_GTUPSR
#define GPT163_GTUPSR_USELCH              GPT162_GTUPSR_USELCH
#define GPT163_GTUPSR_USELCG              GPT162_GTUPSR_USELCG
#define GPT163_GTUPSR_USELCF              GPT162_GTUPSR_USELCF
#define GPT163_GTUPSR_USELCE              GPT162_GTUPSR_USELCE
#define GPT163_GTUPSR_USELCD              GPT162_GTUPSR_USELCD
#define GPT163_GTUPSR_USELCC              GPT162_GTUPSR_USELCC
#define GPT163_GTUPSR_USELCB              GPT162_GTUPSR_USELCB
#define GPT163_GTUPSR_USELCA              GPT162_GTUPSR_USELCA
#define GPT163_GTUPSR_USCBFAH             GPT162_GTUPSR_USCBFAH
#define GPT163_GTUPSR_USCBFAL             GPT162_GTUPSR_USCBFAL
#define GPT163_GTUPSR_USCBRAH             GPT162_GTUPSR_USCBRAH
#define GPT163_GTUPSR_USCBRAL             GPT162_GTUPSR_USCBRAL
#define GPT163_GTUPSR_USCAFBH             GPT162_GTUPSR_USCAFBH
#define GPT163_GTUPSR_USCAFBL             GPT162_GTUPSR_USCAFBL
#define GPT163_GTUPSR_USCARBH             GPT162_GTUPSR_USCARBH
#define GPT163_GTUPSR_USCARBL             GPT162_GTUPSR_USCARBL
#define GPT163_GTUPSR_USGTRGBF            GPT162_GTUPSR_USGTRGBF
#define GPT163_GTUPSR_USGTRGBR            GPT162_GTUPSR_USGTRGBR
#define GPT163_GTUPSR_USGTRGAF            GPT162_GTUPSR_USGTRGAF
#define GPT163_GTUPSR_USGTRGAR            GPT162_GTUPSR_USGTRGAR
#define GPT163_GTDNSR_OFFSET              GPT162_GTDNSR_OFFSET
#define GPT163_GTDNSR                     GPT162_GTDNSR
#define GPT163_GTDNSR_DSELCH              GPT162_GTDNSR_DSELCH
#define GPT163_GTDNSR_DSELCG              GPT162_GTDNSR_DSELCG
#define GPT163_GTDNSR_DSELCF              GPT162_GTDNSR_DSELCF
#define GPT163_GTDNSR_DSELCE              GPT162_GTDNSR_DSELCE
#define GPT163_GTDNSR_DSELCD              GPT162_GTDNSR_DSELCD
#define GPT163_GTDNSR_DSELCC              GPT162_GTDNSR_DSELCC
#define GPT163_GTDNSR_DSELCB              GPT162_GTDNSR_DSELCB
#define GPT163_GTDNSR_DSELCA              GPT162_GTDNSR_DSELCA
#define GPT163_GTDNSR_DSCBFAH             GPT162_GTDNSR_DSCBFAH
#define GPT163_GTDNSR_DSCBFAL             GPT162_GTDNSR_DSCBFAL
#define GPT163_GTDNSR_DSCBRAH             GPT162_GTDNSR_DSCBRAH
#define GPT163_GTDNSR_DSCBRAL             GPT162_GTDNSR_DSCBRAL
#define GPT163_GTDNSR_DSCAFBH             GPT162_GTDNSR_DSCAFBH
#define GPT163_GTDNSR_DSCAFBL             GPT162_GTDNSR_DSCAFBL
#define GPT163_GTDNSR_DSCARBH             GPT162_GTDNSR_DSCARBH
#define GPT163_GTDNSR_DSCARBL             GPT162_GTDNSR_DSCARBL
#define GPT163_GTDNSR_DSGTRGBF            GPT162_GTDNSR_DSGTRGBF
#define GPT163_GTDNSR_DSGTRGBR            GPT162_GTDNSR_DSGTRGBR
#define GPT163_GTDNSR_DSGTRGAF            GPT162_GTDNSR_DSGTRGAF
#define GPT163_GTDNSR_DSGTRGAR            GPT162_GTDNSR_DSGTRGAR
#define GPT163_GTICASR_OFFSET             GPT162_GTICASR_OFFSET
#define GPT163_GTICASR                    GPT162_GTICASR
#define GPT163_GTICASR_ASELCH             GPT162_GTICASR_ASELCH
#define GPT163_GTICASR_ASELCG             GPT162_GTICASR_ASELCG
#define GPT163_GTICASR_ASELCF             GPT162_GTICASR_ASELCF
#define GPT163_GTICASR_ASELCE             GPT162_GTICASR_ASELCE
#define GPT163_GTICASR_ASELCD             GPT162_GTICASR_ASELCD
#define GPT163_GTICASR_ASELCC             GPT162_GTICASR_ASELCC
#define GPT163_GTICASR_ASELCB             GPT162_GTICASR_ASELCB
#define GPT163_GTICASR_ASELCA             GPT162_GTICASR_ASELCA
#define GPT163_GTICASR_ASCBFAH            GPT162_GTICASR_ASCBFAH
#define GPT163_GTICASR_ASCBFAL            GPT162_GTICASR_ASCBFAL
#define GPT163_GTICASR_ASCBRAH            GPT162_GTICASR_ASCBRAH
#define GPT163_GTICASR_ASCBRAL            GPT162_GTICASR_ASCBRAL
#define GPT163_GTICASR_ASCAFBH            GPT162_GTICASR_ASCAFBH
#define GPT163_GTICASR_ASCAFBL            GPT162_GTICASR_ASCAFBL
#define GPT163_GTICASR_ASCARBH            GPT162_GTICASR_ASCARBH
#define GPT163_GTICASR_ASCARBL            GPT162_GTICASR_ASCARBL
#define GPT163_GTICASR_ASGTRGBF           GPT162_GTICASR_ASGTRGBF
#define GPT163_GTICASR_ASGTRGBR           GPT162_GTICASR_ASGTRGBR
#define GPT163_GTICASR_ASGTRGAF           GPT162_GTICASR_ASGTRGAF
#define GPT163_GTICASR_ASGTRGAR           GPT162_GTICASR_ASGTRGAR
#define GPT163_GTICBSR_OFFSET             GPT162_GTICBSR_OFFSET
#define GPT163_GTICBSR                    GPT162_GTICBSR
#define GPT163_GTICBSR_BSELCH             GPT162_GTICBSR_BSELCH
#define GPT163_GTICBSR_BSELCG             GPT162_GTICBSR_BSELCG
#define GPT163_GTICBSR_BSELCF             GPT162_GTICBSR_BSELCF
#define GPT163_GTICBSR_BSELCE             GPT162_GTICBSR_BSELCE
#define GPT163_GTICBSR_BSELCD             GPT162_GTICBSR_BSELCD
#define GPT163_GTICBSR_BSELCC             GPT162_GTICBSR_BSELCC
#define GPT163_GTICBSR_BSELCB             GPT162_GTICBSR_BSELCB
#define GPT163_GTICBSR_BSELCA             GPT162_GTICBSR_BSELCA
#define GPT163_GTICBSR_BSCBFAH            GPT162_GTICBSR_BSCBFAH
#define GPT163_GTICBSR_BSCBFAL            GPT162_GTICBSR_BSCBFAL
#define GPT163_GTICBSR_BSCBRAH            GPT162_GTICBSR_BSCBRAH
#define GPT163_GTICBSR_BSCBRAL            GPT162_GTICBSR_BSCBRAL
#define GPT163_GTICBSR_BSCAFBH            GPT162_GTICBSR_BSCAFBH
#define GPT163_GTICBSR_BSCAFBL            GPT162_GTICBSR_BSCAFBL
#define GPT163_GTICBSR_BSCARBH            GPT162_GTICBSR_BSCARBH
#define GPT163_GTICBSR_BSCARBL            GPT162_GTICBSR_BSCARBL
#define GPT163_GTICBSR_BSGTRGBF           GPT162_GTICBSR_BSGTRGBF
#define GPT163_GTICBSR_BSGTRGBR           GPT162_GTICBSR_BSGTRGBR
#define GPT163_GTICBSR_BSGTRGAF           GPT162_GTICBSR_BSGTRGAF
#define GPT163_GTICBSR_BSGTRGAR           GPT162_GTICBSR_BSGTRGAR
#define GPT163_GTCR_OFFSET                GPT162_GTCR_OFFSET
#define GPT163_GTCR                       GPT162_GTCR
#define GPT163_GTCR_TPCS                  GPT162_GTCR_TPCS
#define GPT163_GTCR_TPCS_MASK             GPT162_GTCR_TPCS_MASK
#define GPT163_GTCR_MD                    GPT162_GTCR_MD
#define GPT163_GTCR_MD_MASK               GPT162_GTCR_MD_MASK
#define GPT163_GTCR_CST                   GPT162_GTCR_CST
#define GPT163_GTUDDTYC_OFFSET            GPT162_GTUDDTYC_OFFSET
#define GPT163_GTUDDTYC                   GPT162_GTUDDTYC
#define GPT163_GTUDDTYC_OBDTYR            GPT162_GTUDDTYC_OBDTYR
#define GPT163_GTUDDTYC_OBDTYF            GPT162_GTUDDTYC_OBDTYF
#define GPT163_GTUDDTYC_OBDTY             GPT162_GTUDDTYC_OBDTY
#define GPT163_GTUDDTYC_OBDTY_MASK        GPT162_GTUDDTYC_OBDTY_MASK
#define GPT163_GTUDDTYC_OADTYR            GPT162_GTUDDTYC_OADTYR
#define GPT163_GTUDDTYC_OADTYF            GPT162_GTUDDTYC_OADTYF
#define GPT163_GTUDDTYC_OADTY             GPT162_GTUDDTYC_OADTY
#define GPT163_GTUDDTYC_OADTY_MASK        GPT162_GTUDDTYC_OADTY_MASK
#define GPT163_GTUDDTYC_UDF               GPT162_GTUDDTYC_UDF
#define GPT163_GTUDDTYC_UD                GPT162_GTUDDTYC_UD
#define GPT163_GTIOR_OFFSET               GPT162_GTIOR_OFFSET
#define GPT163_GTIOR                      GPT162_GTIOR
#define GPT163_GTIOR_NFCSB                GPT162_GTIOR_NFCSB
#define GPT163_GTIOR_NFCSB_MASK           GPT162_GTIOR_NFCSB_MASK
#define GPT163_GTIOR_NFBEN                GPT162_GTIOR_NFBEN
#define GPT163_GTIOR_OBDF                 GPT162_GTIOR_OBDF
#define GPT163_GTIOR_OBDF_MASK            GPT162_GTIOR_OBDF_MASK
#define GPT163_GTIOR_OBE                  GPT162_GTIOR_OBE
#define GPT163_GTIOR_OBHLD                GPT162_GTIOR_OBHLD
#define GPT163_GTIOR_OBDFLT               GPT162_GTIOR_OBDFLT
#define GPT163_GTIOR_GTIOB                GPT162_GTIOR_GTIOB
#define GPT163_GTIOR_GTIOB_MASK           GPT162_GTIOR_GTIOB_MASK
#define GPT163_GTIOR_NFCSA                GPT162_GTIOR_NFCSA
#define GPT163_GTIOR_NFCSA_MASK           GPT162_GTIOR_NFCSA_MASK
#define GPT163_GTIOR_NFAEN                GPT162_GTIOR_NFAEN
#define GPT163_GTIOR_OADF                 GPT162_GTIOR_OADF
#define GPT163_GTIOR_OADF_MASK            GPT162_GTIOR_OADF_MASK
#define GPT163_GTIOR_OAE                  GPT162_GTIOR_OAE
#define GPT163_GTIOR_OAHLD                GPT162_GTIOR_OAHLD
#define GPT163_GTIOR_OADFLT               GPT162_GTIOR_OADFLT
#define GPT163_GTIOR_GTIOA                GPT162_GTIOR_GTIOA
#define GPT163_GTIOR_GTIOA_MASK           GPT162_GTIOR_GTIOA_MASK
#define GPT163_GTINTAD_OFFSET             GPT162_GTINTAD_OFFSET
#define GPT163_GTINTAD                    GPT162_GTINTAD
#define GPT163_GTINTAD_GRPABL             GPT162_GTINTAD_GRPABL
#define GPT163_GTINTAD_GRPABH             GPT162_GTINTAD_GRPABH
#define GPT163_GTINTAD_GRP                GPT162_GTINTAD_GRP
#define GPT163_GTINTAD_GRP_MASK           GPT162_GTINTAD_GRP_MASK
#define GPT163_GTST_OFFSET                GPT162_GTST_OFFSET
#define GPT163_GTST                       GPT162_GTST
#define GPT163_GTST_OABLF                 GPT162_GTST_OABLF
#define GPT163_GTST_OABHF                 GPT162_GTST_OABHF
#define GPT163_GTST_ODF                   GPT162_GTST_ODF
#define GPT163_GTST_TUCF                  GPT162_GTST_TUCF
#define GPT163_GTST_TCFPU                 GPT162_GTST_TCFPU
#define GPT163_GTST_TCFPO                 GPT162_GTST_TCFPO
#define GPT163_GTST_TCFF                  GPT162_GTST_TCFF
#define GPT163_GTST_TCFE                  GPT162_GTST_TCFE
#define GPT163_GTST_TCFD                  GPT162_GTST_TCFD
#define GPT163_GTST_TCFC                  GPT162_GTST_TCFC
#define GPT163_GTST_TCFB                  GPT162_GTST_TCFB
#define GPT163_GTST_TCFA                  GPT162_GTST_TCFA
#define GPT163_GTBER_OFFSET               GPT162_GTBER_OFFSET
#define GPT163_GTBER                      GPT162_GTBER
#define GPT163_GTBER_CCRSWT               GPT162_GTBER_CCRSWT
#define GPT163_GTBER_PR                   GPT162_GTBER_PR
#define GPT163_GTBER_PR_MASK              GPT162_GTBER_PR_MASK
#define GPT163_GTBER_CCRB                 GPT162_GTBER_CCRB
#define GPT163_GTBER_CCRB_MASK            GPT162_GTBER_CCRB_MASK
#define GPT163_GTBER_CCRA                 GPT162_GTBER_CCRA
#define GPT163_GTBER_CCRA_MASK            GPT162_GTBER_CCRA_MASK
#define GPT163_GTBER_BD                   GPT162_GTBER_BD
#define GPT163_GTBER_BD_MASK              GPT162_GTBER_BD_MASK
#define GPT163_GTCNT_OFFSET               GPT162_GTCNT_OFFSET
#define GPT163_GTCNT                      GPT162_GTCNT
#define GPT163_GTCNT_GTCNT                GPT162_GTCNT_GTCNT
#define GPT163_GTCNT_GTCNT_MASK           GPT162_GTCNT_GTCNT_MASK
#define GPT163_GTCCRA_OFFSET              GPT162_GTCCRA_OFFSET
#define GPT163_GTCCRA                     GPT162_GTCCRA
#define GPT163_GTCCRA_GTCCRA              GPT162_GTCCRA_GTCCRA
#define GPT163_GTCCRA_GTCCRA_MASK         GPT162_GTCCRA_GTCCRA_MASK
#define GPT163_GTCCRB_OFFSET              GPT162_GTCCRB_OFFSET
#define GPT163_GTCCRB                     GPT162_GTCCRB
#define GPT163_GTCCRB_GTCCRB              GPT162_GTCCRB_GTCCRB
#define GPT163_GTCCRB_GTCCRB_MASK         GPT162_GTCCRB_GTCCRB_MASK
#define GPT163_GTCCRC_OFFSET              GPT162_GTCCRC_OFFSET
#define GPT163_GTCCRC                     GPT162_GTCCRC
#define GPT163_GTCCRC_GTCCRC              GPT162_GTCCRC_GTCCRC
#define GPT163_GTCCRC_GTCCRC_MASK         GPT162_GTCCRC_GTCCRC_MASK
#define GPT163_GTCCRE_OFFSET              GPT162_GTCCRE_OFFSET
#define GPT163_GTCCRE                     GPT162_GTCCRE
#define GPT163_GTCCRE_GTCCRE              GPT162_GTCCRE_GTCCRE
#define GPT163_GTCCRE_GTCCRE_MASK         GPT162_GTCCRE_GTCCRE_MASK
#define GPT163_GTCCRD_OFFSET              GPT162_GTCCRD_OFFSET
#define GPT163_GTCCRD                     GPT162_GTCCRD
#define GPT163_GTCCRD_GTCCRD              GPT162_GTCCRD_GTCCRD
#define GPT163_GTCCRD_GTCCRD_MASK         GPT162_GTCCRD_GTCCRD_MASK
#define GPT163_GTCCRF_OFFSET              GPT162_GTCCRF_OFFSET
#define GPT163_GTCCRF                     GPT162_GTCCRF
#define GPT163_GTCCRF_GTCCRF              GPT162_GTCCRF_GTCCRF
#define GPT163_GTCCRF_GTCCRF_MASK         GPT162_GTCCRF_GTCCRF_MASK
#define GPT163_GTPR_OFFSET                GPT162_GTPR_OFFSET
#define GPT163_GTPR                       GPT162_GTPR
#define GPT163_GTPR_GTPR                  GPT162_GTPR_GTPR
#define GPT163_GTPR_GTPR_MASK             GPT162_GTPR_GTPR_MASK
#define GPT163_GTPBR_OFFSET               GPT162_GTPBR_OFFSET
#define GPT163_GTPBR                      GPT162_GTPBR
#define GPT163_GTPBR_GTPBR                GPT162_GTPBR_GTPBR
#define GPT163_GTPBR_GTPBR_MASK           GPT162_GTPBR_GTPBR_MASK
#define GPT163_GTDTCR_OFFSET              GPT162_GTDTCR_OFFSET
#define GPT163_GTDTCR                     GPT162_GTDTCR
#define GPT163_GTDTCR_TDE                 GPT162_GTDTCR_TDE
#define GPT163_GTDVU_OFFSET               GPT162_GTDVU_OFFSET
#define GPT163_GTDVU                      GPT162_GTDVU
#define GPT163_GTDVU_GTDVU                GPT162_GTDVU_GTDVU
#define GPT163_GTDVU_GTDVU_MASK           GPT162_GTDVU_GTDVU_MASK

