leocafonso/svdtoheaders/demo/h/ra4m1_reg.h
/* No registers defined for peripheral GPT167. Using those of GPT162. */
#define GPT167_BASE                       0x40078700
#define GPT167_GTWP_OFFSET                GPT162_GTWP_OFFSET
#define GPT167_GTWP                       GPT162_GTWP
#define GPT167_GTWP_PRKEY                 GPT162_GTWP_PRKEY
#define GPT167_GTWP_PRKEY_MASK            GPT162_GTWP_PRKEY_MASK
#define GPT167_GTWP_WP                    GPT162_GTWP_WP
#define GPT167_GTSTR_OFFSET               GPT162_GTSTR_OFFSET
#define GPT167_GTSTR                      GPT162_GTSTR
#define GPT167_GTSTR_CSTRT7               GPT162_GTSTR_CSTRT7
#define GPT167_GTSTR_CSTRT6               GPT162_GTSTR_CSTRT6
#define GPT167_GTSTR_CSTRT5               GPT162_GTSTR_CSTRT5
#define GPT167_GTSTR_CSTRT4               GPT162_GTSTR_CSTRT4
#define GPT167_GTSTR_CSTRT3               GPT162_GTSTR_CSTRT3
#define GPT167_GTSTR_CSTRT2               GPT162_GTSTR_CSTRT2
#define GPT167_GTSTR_CSTRT1               GPT162_GTSTR_CSTRT1
#define GPT167_GTSTR_CSTRT0               GPT162_GTSTR_CSTRT0
#define GPT167_GTSTP_OFFSET               GPT162_GTSTP_OFFSET
#define GPT167_GTSTP                      GPT162_GTSTP
#define GPT167_GTSTP_CSTOP7               GPT162_GTSTP_CSTOP7
#define GPT167_GTSTP_CSTOP6               GPT162_GTSTP_CSTOP6
#define GPT167_GTSTP_CSTOP5               GPT162_GTSTP_CSTOP5
#define GPT167_GTSTP_CSTOP4               GPT162_GTSTP_CSTOP4
#define GPT167_GTSTP_CSTOP3               GPT162_GTSTP_CSTOP3
#define GPT167_GTSTP_CSTOP2               GPT162_GTSTP_CSTOP2
#define GPT167_GTSTP_CSTOP1               GPT162_GTSTP_CSTOP1
#define GPT167_GTSTP_CSTOP0               GPT162_GTSTP_CSTOP0
#define GPT167_GTCLR_OFFSET               GPT162_GTCLR_OFFSET
#define GPT167_GTCLR                      GPT162_GTCLR
#define GPT167_GTCLR_CCLR7                GPT162_GTCLR_CCLR7
#define GPT167_GTCLR_CCLR6                GPT162_GTCLR_CCLR6
#define GPT167_GTCLR_CCLR5                GPT162_GTCLR_CCLR5
#define GPT167_GTCLR_CCLR4                GPT162_GTCLR_CCLR4
#define GPT167_GTCLR_CCLR3                GPT162_GTCLR_CCLR3
#define GPT167_GTCLR_CCLR2                GPT162_GTCLR_CCLR2
#define GPT167_GTCLR_CCLR1                GPT162_GTCLR_CCLR1
#define GPT167_GTCLR_CCLR0                GPT162_GTCLR_CCLR0
#define GPT167_GTSSR_OFFSET               GPT162_GTSSR_OFFSET
#define GPT167_GTSSR                      GPT162_GTSSR
#define GPT167_GTSSR_CSTRT                GPT162_GTSSR_CSTRT
#define GPT167_GTSSR_SSELCH               GPT162_GTSSR_SSELCH
#define GPT167_GTSSR_SSELCG               GPT162_GTSSR_SSELCG
#define GPT167_GTSSR_SSELCF               GPT162_GTSSR_SSELCF
#define GPT167_GTSSR_SSELCE               GPT162_GTSSR_SSELCE
#define GPT167_GTSSR_SSELCD               GPT162_GTSSR_SSELCD
#define GPT167_GTSSR_SSELCC               GPT162_GTSSR_SSELCC
#define GPT167_GTSSR_SSELCB               GPT162_GTSSR_SSELCB
#define GPT167_GTSSR_SSELCA               GPT162_GTSSR_SSELCA
#define GPT167_GTSSR_SSCBFAH              GPT162_GTSSR_SSCBFAH
#define GPT167_GTSSR_SSCBFAL              GPT162_GTSSR_SSCBFAL
#define GPT167_GTSSR_SSCBRAH              GPT162_GTSSR_SSCBRAH
#define GPT167_GTSSR_SSCBRAL              GPT162_GTSSR_SSCBRAL
#define GPT167_GTSSR_SSCAFBH              GPT162_GTSSR_SSCAFBH
#define GPT167_GTSSR_SSCAFBL              GPT162_GTSSR_SSCAFBL
#define GPT167_GTSSR_SSCARBH              GPT162_GTSSR_SSCARBH
#define GPT167_GTSSR_SSCARBL              GPT162_GTSSR_SSCARBL
#define GPT167_GTSSR_SSGTRGBF             GPT162_GTSSR_SSGTRGBF
#define GPT167_GTSSR_SSGTRGBR             GPT162_GTSSR_SSGTRGBR
#define GPT167_GTSSR_SSGTRGAF             GPT162_GTSSR_SSGTRGAF
#define GPT167_GTSSR_SSGTRGAR             GPT162_GTSSR_SSGTRGAR
#define GPT167_GTPSR_OFFSET               GPT162_GTPSR_OFFSET
#define GPT167_GTPSR                      GPT162_GTPSR
#define GPT167_GTPSR_CSTOP                GPT162_GTPSR_CSTOP
#define GPT167_GTPSR_PSELCH               GPT162_GTPSR_PSELCH
#define GPT167_GTPSR_PSELCG               GPT162_GTPSR_PSELCG
#define GPT167_GTPSR_PSELCF               GPT162_GTPSR_PSELCF
#define GPT167_GTPSR_PSELCE               GPT162_GTPSR_PSELCE
#define GPT167_GTPSR_PSELCD               GPT162_GTPSR_PSELCD
#define GPT167_GTPSR_PSELCC               GPT162_GTPSR_PSELCC
#define GPT167_GTPSR_PSELCB               GPT162_GTPSR_PSELCB
#define GPT167_GTPSR_PSELCA               GPT162_GTPSR_PSELCA
#define GPT167_GTPSR_PSCBFAH              GPT162_GTPSR_PSCBFAH
#define GPT167_GTPSR_PSCBFAL              GPT162_GTPSR_PSCBFAL
#define GPT167_GTPSR_PSCBRAH              GPT162_GTPSR_PSCBRAH
#define GPT167_GTPSR_PSCBRAL              GPT162_GTPSR_PSCBRAL
#define GPT167_GTPSR_PSCAFBH              GPT162_GTPSR_PSCAFBH
#define GPT167_GTPSR_PSCAFBL              GPT162_GTPSR_PSCAFBL
#define GPT167_GTPSR_PSCARBH              GPT162_GTPSR_PSCARBH
#define GPT167_GTPSR_PSCARBL              GPT162_GTPSR_PSCARBL
#define GPT167_GTPSR_PSGTRGBF             GPT162_GTPSR_PSGTRGBF
#define GPT167_GTPSR_PSGTRGBR             GPT162_GTPSR_PSGTRGBR
#define GPT167_GTPSR_PSGTRGAF             GPT162_GTPSR_PSGTRGAF
#define GPT167_GTPSR_PSGTRGAR             GPT162_GTPSR_PSGTRGAR
#define GPT167_GTCSR_OFFSET               GPT162_GTCSR_OFFSET
#define GPT167_GTCSR                      GPT162_GTCSR
#define GPT167_GTCSR_CCLR                 GPT162_GTCSR_CCLR
#define GPT167_GTCSR_CSELCH               GPT162_GTCSR_CSELCH
#define GPT167_GTCSR_CSELCG               GPT162_GTCSR_CSELCG
#define GPT167_GTCSR_CSELCF               GPT162_GTCSR_CSELCF
#define GPT167_GTCSR_CSELCE               GPT162_GTCSR_CSELCE
#define GPT167_GTCSR_CSELCD               GPT162_GTCSR_CSELCD
#define GPT167_GTCSR_CSELCC               GPT162_GTCSR_CSELCC
#define GPT167_GTCSR_CSELCB               GPT162_GTCSR_CSELCB
#define GPT167_GTCSR_CSELCA               GPT162_GTCSR_CSELCA
#define GPT167_GTCSR_CSCBFAH              GPT162_GTCSR_CSCBFAH
#define GPT167_GTCSR_CSCBFAL              GPT162_GTCSR_CSCBFAL
#define GPT167_GTCSR_CSCBRAH              GPT162_GTCSR_CSCBRAH
#define GPT167_GTCSR_CSCBRAL              GPT162_GTCSR_CSCBRAL
#define GPT167_GTCSR_CSCAFBH              GPT162_GTCSR_CSCAFBH
#define GPT167_GTCSR_CSCAFBL              GPT162_GTCSR_CSCAFBL
#define GPT167_GTCSR_CSCARBH              GPT162_GTCSR_CSCARBH
#define GPT167_GTCSR_CSCARBL              GPT162_GTCSR_CSCARBL
#define GPT167_GTCSR_CSGTRGBF             GPT162_GTCSR_CSGTRGBF
#define GPT167_GTCSR_CSGTRGBR             GPT162_GTCSR_CSGTRGBR
#define GPT167_GTCSR_CSGTRGAF             GPT162_GTCSR_CSGTRGAF
#define GPT167_GTCSR_CSGTRGAR             GPT162_GTCSR_CSGTRGAR
#define GPT167_GTUPSR_OFFSET              GPT162_GTUPSR_OFFSET
#define GPT167_GTUPSR                     GPT162_GTUPSR
#define GPT167_GTUPSR_USELCH              GPT162_GTUPSR_USELCH
#define GPT167_GTUPSR_USELCG              GPT162_GTUPSR_USELCG
#define GPT167_GTUPSR_USELCF              GPT162_GTUPSR_USELCF
#define GPT167_GTUPSR_USELCE              GPT162_GTUPSR_USELCE
#define GPT167_GTUPSR_USELCD              GPT162_GTUPSR_USELCD
#define GPT167_GTUPSR_USELCC              GPT162_GTUPSR_USELCC
#define GPT167_GTUPSR_USELCB              GPT162_GTUPSR_USELCB
#define GPT167_GTUPSR_USELCA              GPT162_GTUPSR_USELCA
#define GPT167_GTUPSR_USCBFAH             GPT162_GTUPSR_USCBFAH
#define GPT167_GTUPSR_USCBFAL             GPT162_GTUPSR_USCBFAL
#define GPT167_GTUPSR_USCBRAH             GPT162_GTUPSR_USCBRAH
#define GPT167_GTUPSR_USCBRAL             GPT162_GTUPSR_USCBRAL
#define GPT167_GTUPSR_USCAFBH             GPT162_GTUPSR_USCAFBH
#define GPT167_GTUPSR_USCAFBL             GPT162_GTUPSR_USCAFBL
#define GPT167_GTUPSR_USCARBH             GPT162_GTUPSR_USCARBH
#define GPT167_GTUPSR_USCARBL             GPT162_GTUPSR_USCARBL
#define GPT167_GTUPSR_USGTRGBF            GPT162_GTUPSR_USGTRGBF
#define GPT167_GTUPSR_USGTRGBR            GPT162_GTUPSR_USGTRGBR
#define GPT167_GTUPSR_USGTRGAF            GPT162_GTUPSR_USGTRGAF
#define GPT167_GTUPSR_USGTRGAR            GPT162_GTUPSR_USGTRGAR
#define GPT167_GTDNSR_OFFSET              GPT162_GTDNSR_OFFSET
#define GPT167_GTDNSR                     GPT162_GTDNSR
#define GPT167_GTDNSR_DSELCH              GPT162_GTDNSR_DSELCH
#define GPT167_GTDNSR_DSELCG              GPT162_GTDNSR_DSELCG
#define GPT167_GTDNSR_DSELCF              GPT162_GTDNSR_DSELCF
#define GPT167_GTDNSR_DSELCE              GPT162_GTDNSR_DSELCE
#define GPT167_GTDNSR_DSELCD              GPT162_GTDNSR_DSELCD
#define GPT167_GTDNSR_DSELCC              GPT162_GTDNSR_DSELCC
#define GPT167_GTDNSR_DSELCB              GPT162_GTDNSR_DSELCB
#define GPT167_GTDNSR_DSELCA              GPT162_GTDNSR_DSELCA
#define GPT167_GTDNSR_DSCBFAH             GPT162_GTDNSR_DSCBFAH
#define GPT167_GTDNSR_DSCBFAL             GPT162_GTDNSR_DSCBFAL
#define GPT167_GTDNSR_DSCBRAH             GPT162_GTDNSR_DSCBRAH
#define GPT167_GTDNSR_DSCBRAL             GPT162_GTDNSR_DSCBRAL
#define GPT167_GTDNSR_DSCAFBH             GPT162_GTDNSR_DSCAFBH
#define GPT167_GTDNSR_DSCAFBL             GPT162_GTDNSR_DSCAFBL
#define GPT167_GTDNSR_DSCARBH             GPT162_GTDNSR_DSCARBH
#define GPT167_GTDNSR_DSCARBL             GPT162_GTDNSR_DSCARBL
#define GPT167_GTDNSR_DSGTRGBF            GPT162_GTDNSR_DSGTRGBF
#define GPT167_GTDNSR_DSGTRGBR            GPT162_GTDNSR_DSGTRGBR
#define GPT167_GTDNSR_DSGTRGAF            GPT162_GTDNSR_DSGTRGAF
#define GPT167_GTDNSR_DSGTRGAR            GPT162_GTDNSR_DSGTRGAR
#define GPT167_GTICASR_OFFSET             GPT162_GTICASR_OFFSET
#define GPT167_GTICASR                    GPT162_GTICASR
#define GPT167_GTICASR_ASELCH             GPT162_GTICASR_ASELCH
#define GPT167_GTICASR_ASELCG             GPT162_GTICASR_ASELCG
#define GPT167_GTICASR_ASELCF             GPT162_GTICASR_ASELCF
#define GPT167_GTICASR_ASELCE             GPT162_GTICASR_ASELCE
#define GPT167_GTICASR_ASELCD             GPT162_GTICASR_ASELCD
#define GPT167_GTICASR_ASELCC             GPT162_GTICASR_ASELCC
#define GPT167_GTICASR_ASELCB             GPT162_GTICASR_ASELCB
#define GPT167_GTICASR_ASELCA             GPT162_GTICASR_ASELCA
#define GPT167_GTICASR_ASCBFAH            GPT162_GTICASR_ASCBFAH
#define GPT167_GTICASR_ASCBFAL            GPT162_GTICASR_ASCBFAL
#define GPT167_GTICASR_ASCBRAH            GPT162_GTICASR_ASCBRAH
#define GPT167_GTICASR_ASCBRAL            GPT162_GTICASR_ASCBRAL
#define GPT167_GTICASR_ASCAFBH            GPT162_GTICASR_ASCAFBH
#define GPT167_GTICASR_ASCAFBL            GPT162_GTICASR_ASCAFBL
#define GPT167_GTICASR_ASCARBH            GPT162_GTICASR_ASCARBH
#define GPT167_GTICASR_ASCARBL            GPT162_GTICASR_ASCARBL
#define GPT167_GTICASR_ASGTRGBF           GPT162_GTICASR_ASGTRGBF
#define GPT167_GTICASR_ASGTRGBR           GPT162_GTICASR_ASGTRGBR
#define GPT167_GTICASR_ASGTRGAF           GPT162_GTICASR_ASGTRGAF
#define GPT167_GTICASR_ASGTRGAR           GPT162_GTICASR_ASGTRGAR
#define GPT167_GTICBSR_OFFSET             GPT162_GTICBSR_OFFSET
#define GPT167_GTICBSR                    GPT162_GTICBSR
#define GPT167_GTICBSR_BSELCH             GPT162_GTICBSR_BSELCH
#define GPT167_GTICBSR_BSELCG             GPT162_GTICBSR_BSELCG
#define GPT167_GTICBSR_BSELCF             GPT162_GTICBSR_BSELCF
#define GPT167_GTICBSR_BSELCE             GPT162_GTICBSR_BSELCE
#define GPT167_GTICBSR_BSELCD             GPT162_GTICBSR_BSELCD
#define GPT167_GTICBSR_BSELCC             GPT162_GTICBSR_BSELCC
#define GPT167_GTICBSR_BSELCB             GPT162_GTICBSR_BSELCB
#define GPT167_GTICBSR_BSELCA             GPT162_GTICBSR_BSELCA
#define GPT167_GTICBSR_BSCBFAH            GPT162_GTICBSR_BSCBFAH
#define GPT167_GTICBSR_BSCBFAL            GPT162_GTICBSR_BSCBFAL
#define GPT167_GTICBSR_BSCBRAH            GPT162_GTICBSR_BSCBRAH
#define GPT167_GTICBSR_BSCBRAL            GPT162_GTICBSR_BSCBRAL
#define GPT167_GTICBSR_BSCAFBH            GPT162_GTICBSR_BSCAFBH
#define GPT167_GTICBSR_BSCAFBL            GPT162_GTICBSR_BSCAFBL
#define GPT167_GTICBSR_BSCARBH            GPT162_GTICBSR_BSCARBH
#define GPT167_GTICBSR_BSCARBL            GPT162_GTICBSR_BSCARBL
#define GPT167_GTICBSR_BSGTRGBF           GPT162_GTICBSR_BSGTRGBF
#define GPT167_GTICBSR_BSGTRGBR           GPT162_GTICBSR_BSGTRGBR
#define GPT167_GTICBSR_BSGTRGAF           GPT162_GTICBSR_BSGTRGAF
#define GPT167_GTICBSR_BSGTRGAR           GPT162_GTICBSR_BSGTRGAR
#define GPT167_GTCR_OFFSET                GPT162_GTCR_OFFSET
#define GPT167_GTCR                       GPT162_GTCR
#define GPT167_GTCR_TPCS                  GPT162_GTCR_TPCS
#define GPT167_GTCR_TPCS_MASK             GPT162_GTCR_TPCS_MASK
#define GPT167_GTCR_MD                    GPT162_GTCR_MD
#define GPT167_GTCR_MD_MASK               GPT162_GTCR_MD_MASK
#define GPT167_GTCR_CST                   GPT162_GTCR_CST
#define GPT167_GTUDDTYC_OFFSET            GPT162_GTUDDTYC_OFFSET
#define GPT167_GTUDDTYC                   GPT162_GTUDDTYC
#define GPT167_GTUDDTYC_OBDTYR            GPT162_GTUDDTYC_OBDTYR
#define GPT167_GTUDDTYC_OBDTYF            GPT162_GTUDDTYC_OBDTYF
#define GPT167_GTUDDTYC_OBDTY             GPT162_GTUDDTYC_OBDTY
#define GPT167_GTUDDTYC_OBDTY_MASK        GPT162_GTUDDTYC_OBDTY_MASK
#define GPT167_GTUDDTYC_OADTYR            GPT162_GTUDDTYC_OADTYR
#define GPT167_GTUDDTYC_OADTYF            GPT162_GTUDDTYC_OADTYF
#define GPT167_GTUDDTYC_OADTY             GPT162_GTUDDTYC_OADTY
#define GPT167_GTUDDTYC_OADTY_MASK        GPT162_GTUDDTYC_OADTY_MASK
#define GPT167_GTUDDTYC_UDF               GPT162_GTUDDTYC_UDF
#define GPT167_GTUDDTYC_UD                GPT162_GTUDDTYC_UD
#define GPT167_GTIOR_OFFSET               GPT162_GTIOR_OFFSET
#define GPT167_GTIOR                      GPT162_GTIOR
#define GPT167_GTIOR_NFCSB                GPT162_GTIOR_NFCSB
#define GPT167_GTIOR_NFCSB_MASK           GPT162_GTIOR_NFCSB_MASK
#define GPT167_GTIOR_NFBEN                GPT162_GTIOR_NFBEN
#define GPT167_GTIOR_OBDF                 GPT162_GTIOR_OBDF
#define GPT167_GTIOR_OBDF_MASK            GPT162_GTIOR_OBDF_MASK
#define GPT167_GTIOR_OBE                  GPT162_GTIOR_OBE
#define GPT167_GTIOR_OBHLD                GPT162_GTIOR_OBHLD
#define GPT167_GTIOR_OBDFLT               GPT162_GTIOR_OBDFLT
#define GPT167_GTIOR_GTIOB                GPT162_GTIOR_GTIOB
#define GPT167_GTIOR_GTIOB_MASK           GPT162_GTIOR_GTIOB_MASK
#define GPT167_GTIOR_NFCSA                GPT162_GTIOR_NFCSA
#define GPT167_GTIOR_NFCSA_MASK           GPT162_GTIOR_NFCSA_MASK
#define GPT167_GTIOR_NFAEN                GPT162_GTIOR_NFAEN
#define GPT167_GTIOR_OADF                 GPT162_GTIOR_OADF
#define GPT167_GTIOR_OADF_MASK            GPT162_GTIOR_OADF_MASK
#define GPT167_GTIOR_OAE                  GPT162_GTIOR_OAE
#define GPT167_GTIOR_OAHLD                GPT162_GTIOR_OAHLD
#define GPT167_GTIOR_OADFLT               GPT162_GTIOR_OADFLT
#define GPT167_GTIOR_GTIOA                GPT162_GTIOR_GTIOA
#define GPT167_GTIOR_GTIOA_MASK           GPT162_GTIOR_GTIOA_MASK
#define GPT167_GTINTAD_OFFSET             GPT162_GTINTAD_OFFSET
#define GPT167_GTINTAD                    GPT162_GTINTAD
#define GPT167_GTINTAD_GRPABL             GPT162_GTINTAD_GRPABL
#define GPT167_GTINTAD_GRPABH             GPT162_GTINTAD_GRPABH
#define GPT167_GTINTAD_GRP                GPT162_GTINTAD_GRP
#define GPT167_GTINTAD_GRP_MASK           GPT162_GTINTAD_GRP_MASK
#define GPT167_GTST_OFFSET                GPT162_GTST_OFFSET
#define GPT167_GTST                       GPT162_GTST
#define GPT167_GTST_OABLF                 GPT162_GTST_OABLF
#define GPT167_GTST_OABHF                 GPT162_GTST_OABHF
#define GPT167_GTST_ODF                   GPT162_GTST_ODF
#define GPT167_GTST_TUCF                  GPT162_GTST_TUCF
#define GPT167_GTST_TCFPU                 GPT162_GTST_TCFPU
#define GPT167_GTST_TCFPO                 GPT162_GTST_TCFPO
#define GPT167_GTST_TCFF                  GPT162_GTST_TCFF
#define GPT167_GTST_TCFE                  GPT162_GTST_TCFE
#define GPT167_GTST_TCFD                  GPT162_GTST_TCFD
#define GPT167_GTST_TCFC                  GPT162_GTST_TCFC
#define GPT167_GTST_TCFB                  GPT162_GTST_TCFB
#define GPT167_GTST_TCFA                  GPT162_GTST_TCFA
#define GPT167_GTBER_OFFSET               GPT162_GTBER_OFFSET
#define GPT167_GTBER                      GPT162_GTBER
#define GPT167_GTBER_CCRSWT               GPT162_GTBER_CCRSWT
#define GPT167_GTBER_PR                   GPT162_GTBER_PR
#define GPT167_GTBER_PR_MASK              GPT162_GTBER_PR_MASK
#define GPT167_GTBER_CCRB                 GPT162_GTBER_CCRB
#define GPT167_GTBER_CCRB_MASK            GPT162_GTBER_CCRB_MASK
#define GPT167_GTBER_CCRA                 GPT162_GTBER_CCRA
#define GPT167_GTBER_CCRA_MASK            GPT162_GTBER_CCRA_MASK
#define GPT167_GTBER_BD                   GPT162_GTBER_BD
#define GPT167_GTBER_BD_MASK              GPT162_GTBER_BD_MASK
#define GPT167_GTCNT_OFFSET               GPT162_GTCNT_OFFSET
#define GPT167_GTCNT                      GPT162_GTCNT
#define GPT167_GTCNT_GTCNT                GPT162_GTCNT_GTCNT
#define GPT167_GTCNT_GTCNT_MASK           GPT162_GTCNT_GTCNT_MASK
#define GPT167_GTCCRA_OFFSET              GPT162_GTCCRA_OFFSET
#define GPT167_GTCCRA                     GPT162_GTCCRA
#define GPT167_GTCCRA_GTCCRA              GPT162_GTCCRA_GTCCRA
#define GPT167_GTCCRA_GTCCRA_MASK         GPT162_GTCCRA_GTCCRA_MASK
#define GPT167_GTCCRB_OFFSET              GPT162_GTCCRB_OFFSET
#define GPT167_GTCCRB                     GPT162_GTCCRB
#define GPT167_GTCCRB_GTCCRB              GPT162_GTCCRB_GTCCRB
#define GPT167_GTCCRB_GTCCRB_MASK         GPT162_GTCCRB_GTCCRB_MASK
#define GPT167_GTCCRC_OFFSET              GPT162_GTCCRC_OFFSET
#define GPT167_GTCCRC                     GPT162_GTCCRC
#define GPT167_GTCCRC_GTCCRC              GPT162_GTCCRC_GTCCRC
#define GPT167_GTCCRC_GTCCRC_MASK         GPT162_GTCCRC_GTCCRC_MASK
#define GPT167_GTCCRE_OFFSET              GPT162_GTCCRE_OFFSET
#define GPT167_GTCCRE                     GPT162_GTCCRE
#define GPT167_GTCCRE_GTCCRE              GPT162_GTCCRE_GTCCRE
#define GPT167_GTCCRE_GTCCRE_MASK         GPT162_GTCCRE_GTCCRE_MASK
#define GPT167_GTCCRD_OFFSET              GPT162_GTCCRD_OFFSET
#define GPT167_GTCCRD                     GPT162_GTCCRD
#define GPT167_GTCCRD_GTCCRD              GPT162_GTCCRD_GTCCRD
#define GPT167_GTCCRD_GTCCRD_MASK         GPT162_GTCCRD_GTCCRD_MASK
#define GPT167_GTCCRF_OFFSET              GPT162_GTCCRF_OFFSET
#define GPT167_GTCCRF                     GPT162_GTCCRF
#define GPT167_GTCCRF_GTCCRF              GPT162_GTCCRF_GTCCRF
#define GPT167_GTCCRF_GTCCRF_MASK         GPT162_GTCCRF_GTCCRF_MASK
#define GPT167_GTPR_OFFSET                GPT162_GTPR_OFFSET
#define GPT167_GTPR                       GPT162_GTPR
#define GPT167_GTPR_GTPR                  GPT162_GTPR_GTPR
#define GPT167_GTPR_GTPR_MASK             GPT162_GTPR_GTPR_MASK
#define GPT167_GTPBR_OFFSET               GPT162_GTPBR_OFFSET
#define GPT167_GTPBR                      GPT162_GTPBR
#define GPT167_GTPBR_GTPBR                GPT162_GTPBR_GTPBR
#define GPT167_GTPBR_GTPBR_MASK           GPT162_GTPBR_GTPBR_MASK
#define GPT167_GTDTCR_OFFSET              GPT162_GTDTCR_OFFSET
#define GPT167_GTDTCR                     GPT162_GTDTCR
#define GPT167_GTDTCR_TDE                 GPT162_GTDTCR_TDE
#define GPT167_GTDVU_OFFSET               GPT162_GTDVU_OFFSET
#define GPT167_GTDVU                      GPT162_GTDVU
#define GPT167_GTDVU_GTDVU                GPT162_GTDVU_GTDVU
#define GPT167_GTDVU_GTDVU_MASK           GPT162_GTDVU_GTDVU_MASK

/* GPT_OPS - Output Phase Switching Controller */
#define GPT_OPS_BASE                      0x40078ff0
#define GPT_OPS_OPSCR_OFFSET              0x0000
#define GPT_OPS_OPSCR                     (GPT_OPS_BASE + GPT_OPS_OPSCR_OFFSET)
#define GPT_OPS_OPSCR_NFCS                (2 << 30) /* 40000000: External Input Noise Filter Clock selection Noise filter sampling clock setting of the external input. */
#define GPT_OPS_OPSCR_NFCS_MASK                (0x03)
#define GPT_OPS_OPSCR_NFEN                (1 << 29) /* 20000000: External Input Noise Filter Enable */
#define GPT_OPS_OPSCR_GODF                (1 << 26) /* 4000000: Group output disable function */
#define GPT_OPS_OPSCR_GRP                 (2 << 24) /* 1000000: Output disabled source selection */
#define GPT_OPS_OPSCR_GRP_MASK                 (0x03)
#define GPT_OPS_OPSCR_ALIGN               (1 << 21) /* 200000: Input phase alignment */
#define GPT_OPS_OPSCR_RV                  (1 << 20) /* 100000: Output phase rotation direction reversal */
#define GPT_OPS_OPSCR_INV                 (1 << 19) /* 80000: Invert-Phase Output Control */
#define GPT_OPS_OPSCR_N                   (1 << 18) /* 40000: Negative-Phase Output (N) Control */
#define GPT_OPS_OPSCR_P                   (1 << 17) /* 20000: Positive-Phase Output (P) Control */
#define GPT_OPS_OPSCR_FB                  (1 << 16) /* 10000: External Feedback Signal Enable This bit selects the input phase from the software settings and external input. */
#define GPT_OPS_OPSCR_EN                  (1 <<  8) /* 100: Enable-Phase Output Control */
#define GPT_OPS_OPSCR_W                   (1 <<  6) /* 40: Input W-Phase Monitor This bit monitors the state of the input phase. OPSCR.FB=0:External input monitoring by PCLK OPSCR.FB=1:Software settings (UF/VF/WF) */
#define GPT_OPS_OPSCR_V                   (1 <<  5) /* 20: Input V-Phase Monitor This bit monitors the state of the input phase. OPSCR.FB=0:External input monitoring by PCLK OPSCR.FB=1:Software settings (UF/VF/WF) */
#define GPT_OPS_OPSCR_U                   (1 <<  4) /* 10: Input U-Phase Monitor This bit monitors the state of the input phase. OPSCR.FB=0:External input monitoring by PCLK OPSCR.FB=1:Software settings (UF/VF/WF) */
#define GPT_OPS_OPSCR_WF                  (1 <<  2) /* 04: Input Phase Soft Setting UF This bit sets the input phase by the software settings. This bit setting is valid when the OPSCR.FB bit = 1. */
#define GPT_OPS_OPSCR_VF                  (1 <<  1) /* 02: Input Phase Soft Setting VF This bit sets the input phase by the software settings. This bit setting is valid when the OPSCR.FB bit = 1. */
#define GPT_OPS_OPSCR_UF                  (1 <<  0) /* 01: Input Phase Soft Setting WF This bit sets the input phase by the software settings. This bit setting is valid when the OPSCR.FB bit = 1. */
